[
    {"id": 1, "text": "Pergunta: O que é um banco de dados relacional? Resposta: Um banco de dados relacional é um tipo de banco de dados que organiza os dados em tabelas relacionadas."},
    {"id": 2, "text": "Pergunta: Quais são os benefícios de usar um banco de dados relacional? Resposta: Os benefícios incluem integridade referencial, flexibilidade, consistência e capacidade de consultar os dados de várias maneiras."},
    {"id": 3, "text": "Pergunta: O que é SQL? Resposta: SQL (Structured Query Language) é uma linguagem de programação usada para gerenciar e manipular bancos de dados relacionais."},
    {"id": 4, "text": "Pergunta: Quais são os tipos de comandos SQL? Resposta: Os principais tipos são comandos DDL (Data Definition Language), DML (Data Manipulation Language), DQL (Data Query Language) e DCL (Data Control Language)."},
    {"id": 5, "text": "Pergunta: O que é uma chave primária em um banco de dados? Resposta: Uma chave primária é um campo ou conjunto de campos que identifica exclusivamente cada registro em uma tabela."},
    {"id": 6, "text": "Pergunta: Qual é a diferença entre uma chave primária e uma chave estrangeira? Resposta: Uma chave primária identifica exclusivamente cada registro em uma tabela, enquanto uma chave estrangeira estabelece uma relação entre duas tabelas."},
    {"id": 7, "text": "Pergunta: O que é normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 8, "text": "Pergunta: Quais são as formas normais mais comuns na normalização de banco de dados? Resposta: As formas normais mais comuns são a primeira forma normal (1NF), a segunda forma normal (2NF) e a terceira forma normal (3NF)."},
    {"id": 9, "text": "Pergunta: O que é um índice em um banco de dados? Resposta: Um índice é uma estrutura de dados que melhora a velocidade de recuperação de dados de uma tabela."},
    {"id": 10, "text": "Pergunta: Quais são os diferentes tipos de índices em um banco de dados? Resposta: Os tipos comuns incluem índices simples, índices únicos, índices compostos e índices em cluster."},
    {"id": 11, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma unidade de trabalho que é executada em um banco de dados e é tratada de forma isolada e consistente."},
    {"id": 12, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 13, "text": "Pergunta: O que é a linguagem de consulta NoSQL? Resposta: NoSQL é uma categoria de bancos de dados que não seguem o modelo relacional tradicional e, portanto, não usam SQL para consultas."},
    {"id": 14, "text": "Pergunta: Quais são os tipos de bancos de dados NoSQL mais comuns? Resposta: Os tipos incluem bancos de dados de documentos, bancos de dados de chave-valor, bancos de dados de coluna ampla e bancos de dados de gráfico."},
    {"id": 15, "text": "Pergunta: O que é a consistência eventual em um banco de dados NoSQL? Resposta: Consistência eventual é uma garantia de que, eventualmente, todas as réplicas de dados em um sistema distribuído estarão consistentes."},
    {"id": 16, "text": "Pergunta: O que é sharding em um banco de dados NoSQL? Resposta: Sharding é o processo de dividir os dados em várias máquinas para melhorar o desempenho e a escalabilidade."},
    {"id": 17, "text": "Pergunta: O que é um banco de dados em memória? Resposta: Um banco de dados em memória é um tipo de banco de dados que armazena e manipula os dados principais na memória do computador, em vez de em um disco."},
    {"id": 18, "text": "Pergunta: Quais são as vantagens de usar um banco de dados em memória? Resposta: As vantagens incluem alta velocidade de acesso aos dados, baixa latência e capacidade de lidar com grandes volumes de dados em tempo real."},
    {"id": 19, "text": "Pergunta: O que é replicação de banco de dados? Resposta: Replicação é o processo de criar e manter cópias redundantes dos dados em diferentes locais para fins de backup, recuperação de desastres e balanceamento de carga."},
    {"id": 20, "text": "Pergunta: Quais são os métodos de replicação de banco de dados? Resposta: Os métodos incluem replicação síncrona, replicação assíncrona e replicação em cascata."},
    {"id": 21, "text": "Pergunta: O que é uma stored procedure? Resposta: Uma stored procedure é um conjunto de instruções SQL pré-compiladas que podem ser armazenadas e executadas no servidor de banco de dados."},
    {"id": 22, "text": "Pergunta: Quais são as vantagens de usar stored procedures? Resposta: As vantagens incluem melhor desempenho, segurança aprimorada e reutilização de código."},
    {"id": 23, "text": "Pergunta: O que é um trigger em um banco de dados? Resposta: Um trigger é uma ação automática que é executada quando um evento específico ocorre em uma tabela."},
    {"id": 24, "text": "Pergunta: Quais são os tipos de triggers em um banco de dados? Resposta: Os tipos comuns incluem triggers de inserção, triggers de atualização, triggers de exclusão e triggers de ação em cascata."},
    {"id": 25, "text": "Pergunta: O que é uma visão em um banco de dados? Resposta: Uma visão é uma consulta SQL armazenada que aparece como uma tabela virtual para os usuários do banco de dados."},
    {"id": 26, "text": "Pergunta: Quais são as vantagens de usar visões em um banco de dados? Resposta: As vantagens incluem segurança aprimorada, simplificação de consultas complexas e reuso de consultas frequentes."},
    {"id": 27, "text": "Pergunta: O que é a linguagem de programação PL/SQL? Resposta: PL/SQL (Procedural Language/Structured Query Language) é uma extensão procedural da SQL usada em bancos de dados Oracle."},
    {"id": 28, "text": "Pergunta: O que é a linguagem de programação T-SQL? Resposta: T-SQL (Transact-SQL) é uma extensão procedural da SQL usada em bancos de dados SQL Server."},
    {"id": 29, "text": "Pergunta: O que é um modelo de dados em um banco de dados? Resposta: Um modelo de dados é uma representação dos dados e suas relações em um banco de dados."},
    {"id": 30, "text": "Pergunta: Quais são os modelos de dados mais comuns? Resposta: Os modelos mais comuns incluem o modelo relacional, o modelo hierárquico, o modelo de rede e o modelo de objeto."},
    {"id": 31, "text": "Pergunta: O que é o modelo E-R? Resposta: O modelo E-R (Entidade-Relacionamento) é um modelo de dados usado para representar entidades e seus relacionamentos em um banco de dados."},
    {"id": 32, "text": "Pergunta: O que é a normalização de dados em um modelo E-R? Resposta: Normalização de dados é o processo de organizar os atributos de uma entidade de forma que não haja redundância ou dependência."},
    {"id": 33, "text": "Pergunta: O que é um diagrama de entidade-relacionamento (DER)? Resposta: Um diagrama de entidade-relacionamento é uma representação gráfica das entidades e seus relacionamentos em um modelo E-R."},
    {"id": 34, "text": "Pergunta: O que é o modelo de dados relacional? Resposta: O modelo de dados relacional é um modelo de dados baseado em tabelas que representam entidades e seus relacionamentos."},
    {"id": 35, "text": "Pergunta: Quais são os componentes de um modelo de dados relacional? Resposta: Os componentes incluem tabelas, colunas, chaves primárias, chaves estrangeiras e relacionamentos."},
    {"id": 36, "text": "Pergunta: O que é uma tabela em um modelo de dados relacional? Resposta: Uma tabela é uma estrutura de dados que armazena informações em linhas e colunas."},
    {"id": 37, "text": "Pergunta: O que é uma coluna em uma tabela de banco de dados? Resposta: Uma coluna é uma estrutura de dados que armazena um tipo específico de informação em uma tabela de banco de dados."},
    {"id": 38, "text": "Pergunta: O que é uma restrição de integridade em um banco de dados relacional? Resposta: Uma restrição de integridade é uma regra que limita os valores que podem ser inseridos em uma coluna de uma tabela."},
    {"id": 39, "text": "Pergunta: O que é uma chave estrangeira em um banco de dados relacional? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 40, "text": "Pergunta: O que é uma consulta em um banco de dados? Resposta: Uma consulta é uma instrução SQL usada para recuperar dados de um banco de dados."},
    {"id": 41, "text": "Pergunta: Quais são os tipos de consultas SQL? Resposta: Os tipos incluem consultas de seleção, consultas de inserção, consultas de atualização e consultas de exclusão."},
    {"id": 42, "text": "Pergunta: O que é uma cláusula WHERE em uma consulta SQL? Resposta: A cláusula WHERE é usada para filtrar os resultados de uma consulta com base em uma condição especificada."},
    {"id": 43, "text": "Pergunta: O que é uma cláusula ORDER BY em uma consulta SQL? Resposta: A cláusula ORDER BY é usada para classificar os resultados de uma consulta com base em uma ou mais colunas especificadas."},
    {"id": 44, "text": "Pergunta: O que é uma cláusula GROUP BY em uma consulta SQL? Resposta: A cláusula GROUP BY é usada para agrupar os resultados de uma consulta com base em valores semelhantes em uma ou mais colunas."},
    {"id": 45, "text": "Pergunta: O que é uma cláusula HAVING em uma consulta SQL? Resposta: A cláusula HAVING é usada para filtrar os resultados de uma consulta agrupada com base em uma condição especificada."},
    {"id": 46, "text": "Pergunta: O que é uma junção em uma consulta SQL? Resposta: Uma junção é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada."},
    {"id": 47, "text": "Pergunta: Quais são os tipos de junções em uma consulta SQL? Resposta: Os tipos incluem INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN."},
    {"id": 48, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma série de operações de banco de dados que são tratadas como uma única unidade de trabalho."},
    {"id": 49, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 50, "text": "Pergunta: O que é a atomicidade em uma transação? Resposta: Atomicidade garante que uma transação seja tratada como uma unidade indivisível de trabalho."},
    {"id": 51, "text": "Pergunta: O que é a consistência em uma transação? Resposta: Consistência garante que uma transação leve o banco de dados de um estado consistente para outro estado consistente."},
    {"id": 52, "text": "Pergunta: O que é o isolamento em uma transação? Resposta: Isolamento garante que os efeitos de uma transação sejam invisíveis para outras transações até que ela seja concluída."},
    {"id": 53, "text": "Pergunta: O que é a durabilidade em uma transação? Resposta: Durabilidade garante que os efeitos de uma transação persistam mesmo em caso de falha do sistema."},
    {"id": 54, "text": "Pergunta: O que é a normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 55, "text": "Pergunta: Quais são as formas normais na normalização de banco de dados? Resposta: As formas normais incluem 1NF (Primeira Forma Normal), 2NF (Segunda Forma Normal) e 3NF (Terceira Forma Normal)."},
    {"id": 56, "text": "Pergunta: O que é a primeira forma normal (1NF) em normalização de banco de dados? Resposta: 1NF exige que cada coluna em uma tabela tenha um único valor, não permitindo valores repetidos."},
    {"id": 57, "text": "Pergunta: O que é a segunda forma normal (2NF) em normalização de banco de dados? Resposta: 2NF exige que uma tabela esteja na 1NF e que todas as dependências parciais sejam removidas."},
    {"id": 58, "text": "Pergunta: O que é a terceira forma normal (3NF) em normalização de banco de dados? Resposta: 3NF exige que uma tabela esteja na 2NF e que todas as dependências transitivas sejam removidas."},
    {"id": 59, "text": "Pergunta: O que é a chave primária de uma tabela? Resposta: A chave primária é um conjunto de um ou mais campos que identificam exclusivamente cada registro em uma tabela."},
    {"id": 60, "text": "Pergunta: O que é uma chave estrangeira em uma tabela? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 61, "text": "Pergunta: O que é um índice em um banco de dados? Resposta: Um índice é uma estrutura de dados que melhora a velocidade de recuperação de dados de uma tabela."},
    {"id": 62, "text": "Pergunta: Quais são os tipos de índices em um banco de dados? Resposta: Os tipos incluem índices simples, índices compostos, índices únicos e índices em cluster."},
    {"id": 63, "text": "Pergunta: O que é replicação de banco de dados? Resposta: Replicação é o processo de criar e manter cópias redundantes dos dados em diferentes locais para fins de backup, recuperação de desastres e balanceamento de carga."},
    {"id": 64, "text": "Pergunta: Quais são os métodos de replicação de banco de dados? Resposta: Os métodos incluem replicação síncrona, replicação assíncrona e replicação em cascata."},
    {"id": 65, "text": "Pergunta: O que é uma stored procedure em um banco de dados? Resposta: Uma stored procedure é um conjunto de instruções SQL armazenadas que podem ser executadas no servidor de banco de dados."},
    {"id": 66, "text": "Pergunta: Quais são as vantagens de usar stored procedures? Resposta: As vantagens incluem melhor desempenho, segurança aprimorada e reutilização de código."},
    {"id": 67, "text": "Pergunta: O que é um trigger em um banco de dados? Resposta: Um trigger é uma ação automática que é executada quando um evento específico ocorre em uma tabela."},
    {"id": 68, "text": "Pergunta: Quais são os tipos de triggers em um banco de dados? Resposta: Os tipos comuns incluem triggers de inserção, triggers de atualização, triggers de exclusão e triggers de ação em cascata."},
    {"id": 69, "text": "Pergunta: O que é uma visão em um banco de dados? Resposta: Uma visão é uma consulta SQL armazenada que aparece como uma tabela virtual para os usuários do banco de dados."},
    {"id": 70, "text": "Pergunta: Quais são as vantagens de usar visões em um banco de dados? Resposta: As vantagens incluem segurança aprimorada, simplificação de consultas complexas e reuso de consultas frequentes."},
    {"id": 71, "text": "Pergunta: O que é a linguagem de programação PL/SQL? Resposta: PL/SQL (Procedural Language/Structured Query Language) é uma extensão procedural da SQL usada em bancos de dados Oracle."},
    {"id": 72, "text": "Pergunta: O que é a linguagem de programação T-SQL? Resposta: T-SQL (Transact-SQL) é uma extensão procedural da SQL usada em bancos de dados SQL Server."},
    {"id": 73, "text": "Pergunta: O que é um modelo de dados em um banco de dados? Resposta: Um modelo de dados é uma representação dos dados e suas relações em um banco de dados."},
    {"id": 74, "text": "Pergunta: Quais são os modelos de dados mais comuns? Resposta: Os modelos mais comuns incluem o modelo relacional, o modelo hierárquico, o modelo de rede e o modelo de objeto."},
    {"id": 75, "text": "Pergunta: O que é o modelo E-R? Resposta: O modelo E-R (Entidade-Relacionamento) é um modelo de dados usado para representar entidades e seus relacionamentos em um banco de dados."},
    {"id": 76, "text": "Pergunta: O que é a normalização de dados em um modelo E-R? Resposta: Normalização de dados é o processo de organizar os atributos de uma entidade de forma que não haja redundância ou dependência."},
    {"id": 77, "text": "Pergunta: O que é um diagrama de entidade-relacionamento (DER)? Resposta: Um diagrama de entidade-relacionamento é uma representação gráfica das entidades e seus relacionamentos em um modelo E-R."},
    {"id": 78, "text": "Pergunta: O que é o modelo de dados relacional? Resposta: O modelo de dados relacional é um modelo de dados baseado em tabelas que representam entidades e seus relacionamentos."},
    {"id": 79, "text": "Pergunta: Quais são os componentes de um modelo de dados relacional? Resposta: Os componentes incluem tabelas, colunas, chaves primárias, chaves estrangeiras e relacionamentos."},
    {"id": 80, "text": "Pergunta: O que é uma tabela em um modelo de dados relacional? Resposta: Uma tabela é uma estrutura de dados que armazena informações em linhas e colunas."},
    {"id": 81, "text": "Pergunta: O que é uma coluna em uma tabela de banco de dados? Resposta: Uma coluna é uma estrutura de dados que armazena um tipo específico de informação em uma tabela de banco de dados."},
    {"id": 82, "text": "Pergunta: O que é uma restrição de integridade em um banco de dados relacional? Resposta: Uma restrição de integridade é uma regra que limita os valores que podem ser inseridos em uma coluna de uma tabela."},
    {"id": 83, "text": "Pergunta: O que é uma chave estrangeira em um banco de dados relacional? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 84, "text": "Pergunta: O que é uma consulta em um banco de dados? Resposta: Uma consulta é uma instrução SQL usada para recuperar dados de um banco de dados."},
    {"id": 85, "text": "Pergunta: Quais são os tipos de consultas SQL? Resposta: Os tipos incluem consultas de seleção, consultas de inserção, consultas de atualização e consultas de exclusão."},
    {"id": 86, "text": "Pergunta: O que é uma cláusula WHERE em uma consulta SQL? Resposta: A cláusula WHERE é usada para filtrar os resultados de uma consulta com base em uma condição especificada."},
    {"id": 87, "text": "Pergunta: O que é uma cláusula ORDER BY em uma consulta SQL? Resposta: A cláusula ORDER BY é usada para classificar os resultados de uma consulta com base em uma ou mais colunas especificadas."},
    {"id": 88, "text": "Pergunta: O que é uma cláusula GROUP BY em uma consulta SQL? Resposta: A cláusula GROUP BY é usada para agrupar os resultados de uma consulta com base em valores semelhantes em uma ou mais colunas."},
    {"id": 89, "text": "Pergunta: O que é uma cláusula HAVING em uma consulta SQL? Resposta: A cláusula HAVING é usada para filtrar os resultados de uma consulta agrupada com base em uma condição especificada."},
    {"id": 90, "text": "Pergunta: O que é uma junção em uma consulta SQL? Resposta: Uma junção é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada."},
    {"id": 91, "text": "Pergunta: Quais são os tipos de junções em uma consulta SQL? Resposta: Os tipos incluem INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN."},
    {"id": 92, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma série de operações de banco de dados que são tratadas como uma única unidade de trabalho."},
    {"id": 93, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 94, "text": "Pergunta: O que é a atomicidade em uma transação? Resposta: Atomicidade garante que uma transação seja tratada como uma unidade indivisível de trabalho."},
    {"id": 95, "text": "Pergunta: O que é a consistência em uma transação? Resposta: Consistência garante que uma transação leve o banco de dados de um estado consistente para outro estado consistente."},
    {"id": 96, "text": "Pergunta: O que é o isolamento em uma transação? Resposta: Isolamento garante que os efeitos de uma transação sejam invisíveis para outras transações até que ela seja concluída."},
    {"id": 97, "text": "Pergunta: O que é a durabilidade em uma transação? Resposta: Durabilidade garante que os efeitos de uma transação persistam mesmo em caso de falha do sistema."},
    {"id": 98, "text": "Pergunta: O que é a normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 99, "text": "Pergunta: Quais são as formas normais na normalização de banco de dados? Resposta: As formas normais incluem 1NF (Primeira Forma Normal), 2NF (Segunda Forma Normal) e 3NF (Terceira Forma Normal)."},
    {"id": 100, "text": "Pergunta: O que é a primeira forma normal (1NF) em normalização de banco de dados? Resposta: 1NF exige que cada coluna em uma tabela tenha um único valor, não permitindo valores repetidos."},
    {"id": 101, "text": "Pergunta: O que é um banco de dados NoSQL? Resposta: Um banco de dados NoSQL é um tipo de banco de dados que não segue o modelo relacional tradicional e é otimizado para cargas de trabalho específicas."},
    {"id": 102, "text": "Pergunta: Quais são os tipos de bancos de dados NoSQL mais comuns? Resposta: Os tipos incluem bancos de dados de documentos, bancos de dados de chave-valor, bancos de dados de coluna ampla e bancos de dados de gráfico."},
    {"id": 103, "text": "Pergunta: O que é consistência eventual em um banco de dados NoSQL? Resposta: Consistência eventual é uma garantia de que, eventualmente, todas as réplicas de dados em um sistema distribuído estarão consistentes."},
    {"id": 104, "text": "Pergunta: O que é sharding em um banco de dados NoSQL? Resposta: Sharding é o processo de dividir os dados em várias máquinas para melhorar o desempenho e a escalabilidade."},
    {"id": 105, "text": "Pergunta: O que é um banco de dados em memória? Resposta: Um banco de dados em memória é um tipo de banco de dados que armazena e manipula os dados principais na memória do computador, em vez de em um disco."},
    {"id": 106, "text": "Pergunta: Quais são as vantagens de usar um banco de dados em memória? Resposta: As vantagens incluem alta velocidade de acesso aos dados, baixa latência e capacidade de lidar com grandes volumes de dados em tempo real."},
    {"id": 107, "text": "Pergunta: O que é replicação de banco de dados? Resposta: Replicação é o processo de criar e manter cópias redundantes dos dados em diferentes locais para fins de backup, recuperação de desastres e balanceamento de carga."},
    {"id": 108, "text": "Pergunta: Quais são os métodos de replicação de banco de dados? Resposta: Os métodos incluem replicação síncrona, replicação assíncrona e replicação em cascata."},
    {"id": 109, "text": "Pergunta: O que é uma stored procedure? Resposta: Uma stored procedure é um conjunto de instruções SQL pré-compiladas que podem ser armazenadas e executadas no servidor de banco de dados."},
    {"id": 110, "text": "Pergunta: Quais são as vantagens de usar stored procedures? Resposta: As vantagens incluem melhor desempenho, segurança aprimorada e reutilização de código."},
    {"id": 111, "text": "Pergunta: O que é um trigger em um banco de dados? Resposta: Um trigger é uma ação automática que é executada quando um evento específico ocorre em uma tabela."},
    {"id": 112, "text": "Pergunta: Quais são os tipos de triggers em um banco de dados? Resposta: Os tipos comuns incluem triggers de inserção, triggers de atualização, triggers de exclusão e triggers de ação em cascata."},
    {"id": 113, "text": "Pergunta: O que é uma visão em um banco de dados? Resposta: Uma visão é uma consulta SQL armazenada que aparece como uma tabela virtual para os usuários do banco de dados."},
    {"id": 114, "text": "Pergunta: Quais são as vantagens de usar visões em um banco de dados? Resposta: As vantagens incluem segurança aprimorada, simplificação de consultas complexas e reuso de consultas frequentes."},
    {"id": 115, "text": "Pergunta: O que é a linguagem de programação PL/SQL? Resposta: PL/SQL (Procedural Language/Structured Query Language) é uma extensão procedural da SQL usada em bancos de dados Oracle."},
    {"id": 116, "text": "Pergunta: O que é a linguagem de programação T-SQL? Resposta: T-SQL (Transact-SQL) é uma extensão procedural da SQL usada em bancos de dados SQL Server."},
    {"id": 117, "text": "Pergunta: O que é um modelo de dados em um banco de dados? Resposta: Um modelo de dados é uma representação dos dados e suas relações em um banco de dados."},
    {"id": 118, "text": "Pergunta: Quais são os modelos de dados mais comuns? Resposta: Os modelos mais comuns incluem o modelo relacional, o modelo hierárquico, o modelo de rede e o modelo de objeto."},
    {"id": 119, "text": "Pergunta: O que é o modelo E-R? Resposta: O modelo E-R (Entidade-Relacionamento) é um modelo de dados usado para representar entidades e seus relacionamentos em um banco de dados."},
    {"id": 120, "text": "Pergunta: O que é a normalização de dados em um modelo E-R? Resposta: Normalização de dados é o processo de organizar os atributos de uma entidade de forma que não haja redundância ou dependência."},
    {"id": 121, "text": "Pergunta: O que é um diagrama de entidade-relacionamento (DER)? Resposta: Um diagrama de entidade-relacionamento é uma representação gráfica das entidades e seus relacionamentos em um modelo E-R."},
    {"id": 122, "text": "Pergunta: O que é o modelo de dados relacional? Resposta: O modelo de dados relacional é um modelo de dados baseado em tabelas que representam entidades e seus relacionamentos."},
    {"id": 123, "text": "Pergunta: Quais são os componentes de um modelo de dados relacional? Resposta: Os componentes incluem tabelas, colunas, chaves primárias, chaves estrangeiras e relacionamentos."},
    {"id": 124, "text": "Pergunta: O que é uma tabela em um modelo de dados relacional? Resposta: Uma tabela é uma estrutura de dados que armazena informações em linhas e colunas."},
    {"id": 125, "text": "Pergunta: O que é uma coluna em uma tabela de banco de dados? Resposta: Uma coluna é uma estrutura de dados que armazena um tipo específico de informação em uma tabela de banco de dados."},
    {"id": 126, "text": "Pergunta: O que é uma restrição de integridade em um banco de dados relacional? Resposta: Uma restrição de integridade é uma regra que limita os valores que podem ser inseridos em uma coluna de uma tabela."},
    {"id": 127, "text": "Pergunta: O que é uma chave estrangeira em um banco de dados relacional? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 128, "text": "Pergunta: O que é uma consulta em um banco de dados? Resposta: Uma consulta é uma instrução SQL usada para recuperar dados de um banco de dados."},
    {"id": 129, "text": "Pergunta: Quais são os tipos de consultas SQL? Resposta: Os tipos incluem consultas de seleção, consultas de inserção, consultas de atualização e consultas de exclusão."},
    {"id": 130, "text": "Pergunta: O que é uma cláusula WHERE em uma consulta SQL? Resposta: A cláusula WHERE é usada para filtrar os resultados de uma consulta com base em uma condição especificada."},
    {"id": 131, "text": "Pergunta: O que é uma cláusula ORDER BY em uma consulta SQL? Resposta: A cláusula ORDER BY é usada para classificar os resultados de uma consulta com base em uma ou mais colunas especificadas."},
    {"id": 132, "text": "Pergunta: O que é uma cláusula GROUP BY em uma consulta SQL? Resposta: A cláusula GROUP BY é usada para agrupar os resultados de uma consulta com base em valores semelhantes em uma ou mais colunas."},
    {"id": 133, "text": "Pergunta: O que é uma cláusula HAVING em uma consulta SQL? Resposta: A cláusula HAVING é usada para filtrar os resultados de uma consulta agrupada com base em uma condição especificada."},
    {"id": 134, "text": "Pergunta: O que é uma junção em uma consulta SQL? Resposta: Uma junção é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada."},
    {"id": 135, "text": "Pergunta: Quais são os tipos de junções em uma consulta SQL? Resposta: Os tipos incluem INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN."},
    {"id": 136, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma série de operações de banco de dados que são tratadas como uma única unidade de trabalho."},
    {"id": 137, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 138, "text": "Pergunta: O que é a atomicidade em uma transação? Resposta: Atomicidade garante que uma transação seja tratada como uma unidade indivisível de trabalho."},
    {"id": 139, "text": "Pergunta: O que é a consistência em uma transação? Resposta: Consistência garante que uma transação leve o banco de dados de um estado consistente para outro estado consistente."},
    {"id": 140, "text": "Pergunta: O que é o isolamento em uma transação? Resposta: Isolamento garante que os efeitos de uma transação sejam invisíveis para outras transações até que ela seja concluída."},
    {"id": 141, "text": "Pergunta: O que é a durabilidade em uma transação? Resposta: Durabilidade garante que os efeitos de uma transação persistam mesmo em caso de falha do sistema."},
    {"id": 142, "text": "Pergunta: O que é a normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 143, "text": "Pergunta: Quais são as formas normais na normalização de banco de dados? Resposta: As formas normais incluem 1NF (Primeira Forma Normal), 2NF (Segunda Forma Normal) e 3NF (Terceira Forma Normal)."},
    {"id": 144, "text": "Pergunta: O que é a primeira forma normal (1NF) em normalização de banco de dados? Resposta: 1NF exige que cada coluna em uma tabela tenha um único valor, não permitindo valores repetidos."},
    {"id": 145, "text": "Pergunta: O que é a segunda forma normal (2NF) em normalização de banco de dados? Resposta: 2NF exige que uma tabela esteja na 1NF e que todas as dependências parciais sejam removidas."},
    {"id": 146, "text": "Pergunta: O que é a terceira forma normal (3NF) em normalização de banco de dados? Resposta: 3NF exige que uma tabela esteja na 2NF e que todas as dependências transitivas sejam removidas."},
    {"id": 147, "text": "Pergunta: O que é a chave primária de uma tabela? Resposta: A chave primária é um conjunto de um ou mais campos que identificam exclusivamente cada registro em uma tabela."},
    {"id": 148, "text": "Pergunta: O que é uma chave estrangeira em uma tabela? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 149, "text": "Pergunta: O que é um índice em um banco de dados? Resposta: Um índice é uma estrutura de dados que melhora a velocidade de recuperação de dados de uma tabela."},
    {"id": 150, "text": "Pergunta: Quais são os tipos de índices em um banco de dados? Resposta: Os tipos incluem índices simples, índices compostos, índices únicos e índices em cluster."},
    {"id": 151, "text": "Pergunta: O que é replicação de banco de dados? Resposta: Replicação é o processo de criar e manter cópias redundantes dos dados em diferentes locais para fins de backup, recuperação de desastres e balanceamento de carga."},
    {"id": 152, "text": "Pergunta: Quais são os métodos de replicação de banco de dados? Resposta: Os métodos incluem replicação síncrona, replicação assíncrona e replicação em cascata."},
    {"id": 153, "text": "Pergunta: O que é uma stored procedure em um banco de dados? Resposta: Uma stored procedure é um conjunto de instruções SQL armazenadas que podem ser executadas no servidor de banco de dados."},
    {"id": 154, "text": "Pergunta: Quais são as vantagens de usar stored procedures? Resposta: As vantagens incluem melhor desempenho, segurança aprimorada e reutilização de código."},
    {"id": 155, "text": "Pergunta: O que é um trigger em um banco de dados? Resposta: Um trigger é uma ação automática que é executada quando um evento específico ocorre em uma tabela."},
    {"id": 156, "text": "Pergunta: Quais são os tipos de triggers em um banco de dados? Resposta: Os tipos comuns incluem triggers de inserção, triggers de atualização, triggers de exclusão e triggers de ação em cascata."},
    {"id": 157, "text": "Pergunta: O que é uma visão em um banco de dados? Resposta: Uma visão é uma consulta SQL armazenada que aparece como uma tabela virtual para os usuários do banco de dados."},
    {"id": 158, "text": "Pergunta: Quais são as vantagens de usar visões em um banco de dados? Resposta: As vantagens incluem segurança aprimorada, simplificação de consultas complexas e reuso de consultas frequentes."},
    {"id": 159, "text": "Pergunta: O que é a linguagem de programação PL/SQL? Resposta: PL/SQL (Procedural Language/Structured Query Language) é uma extensão procedural da SQL usada em bancos de dados Oracle."},
    {"id": 160, "text": "Pergunta: O que é a linguagem de programação T-SQL? Resposta: T-SQL (Transact-SQL) é uma extensão procedural da SQL usada em bancos de dados SQL Server."},
    {"id": 161, "text": "Pergunta: O que é um modelo de dados em um banco de dados? Resposta: Um modelo de dados é uma representação dos dados e suas relações em um banco de dados."},
    {"id": 162, "text": "Pergunta: Quais são os modelos de dados mais comuns? Resposta: Os modelos mais comuns incluem o modelo relacional, o modelo hierárquico, o modelo de rede e o modelo de objeto."},
    {"id": 163, "text": "Pergunta: O que é o modelo E-R? Resposta: O modelo E-R (Entidade-Relacionamento) é um modelo de dados usado para representar entidades e seus relacionamentos em um banco de dados."},
    {"id": 164, "text": "Pergunta: O que é a normalização de dados em um modelo E-R? Resposta: Normalização de dados é o processo de organizar os atributos de uma entidade de forma que não haja redundância ou dependência."},
    {"id": 165, "text": "Pergunta: O que é um diagrama de entidade-relacionamento (DER)? Resposta: Um diagrama de entidade-relacionamento é uma representação gráfica das entidades e seus relacionamentos em um modelo E-R."},
    {"id": 166, "text": "Pergunta: O que é o modelo de dados relacional? Resposta: O modelo de dados relacional é um modelo de dados baseado em tabelas que representam entidades e seus relacionamentos."},
    {"id": 167, "text": "Pergunta: Quais são os componentes de um modelo de dados relacional? Resposta: Os componentes incluem tabelas, colunas, chaves primárias, chaves estrangeiras e relacionamentos."},
    {"id": 168, "text": "Pergunta: O que é uma tabela em um modelo de dados relacional? Resposta: Uma tabela é uma estrutura de dados que armazena informações em linhas e colunas."},
    {"id": 169, "text": "Pergunta: O que é uma coluna em uma tabela de banco de dados? Resposta: Uma coluna é uma estrutura de dados que armazena um tipo específico de informação em uma tabela de banco de dados."},
    {"id": 170, "text": "Pergunta: O que é uma restrição de integridade em um banco de dados relacional? Resposta: Uma restrição de integridade é uma regra que limita os valores que podem ser inseridos em uma coluna de uma tabela."},
    {"id": 171, "text": "Pergunta: O que é uma chave estrangeira em um banco de dados relacional? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 172, "text": "Pergunta: O que é uma consulta em um banco de dados? Resposta: Uma consulta é uma instrução SQL usada para recuperar dados de um banco de dados."},
    {"id": 173, "text": "Pergunta: Quais são os tipos de consultas SQL? Resposta: Os tipos incluem consultas de seleção, consultas de inserção, consultas de atualização e consultas de exclusão."},
    {"id": 174, "text": "Pergunta: O que é uma cláusula WHERE em uma consulta SQL? Resposta: A cláusula WHERE é usada para filtrar os resultados de uma consulta com base em uma condição especificada."},
    {"id": 175, "text": "Pergunta: O que é uma cláusula ORDER BY em uma consulta SQL? Resposta: A cláusula ORDER BY é usada para classificar os resultados de uma consulta com base em uma ou mais colunas especificadas."},
    {"id": 176, "text": "Pergunta: O que é uma cláusula GROUP BY em uma consulta SQL? Resposta: A cláusula GROUP BY é usada para agrupar os resultados de uma consulta com base em valores semelhantes em uma ou mais colunas."},
    {"id": 177, "text": "Pergunta: O que é uma cláusula HAVING em uma consulta SQL? Resposta: A cláusula HAVING é usada para filtrar os resultados de uma consulta agrupada com base em uma condição especificada."},
    {"id": 178, "text": "Pergunta: O que é uma junção em uma consulta SQL? Resposta: Uma junção é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada."},
    {"id": 179, "text": "Pergunta: Quais são os tipos de junções em uma consulta SQL? Resposta: Os tipos incluem INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN."},
    {"id": 180, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma série de operações de banco de dados que são tratadas como uma única unidade de trabalho."},
    {"id": 181, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 182, "text": "Pergunta: O que é a atomicidade em uma transação? Resposta: Atomicidade garante que uma transação seja tratada como uma unidade indivisível de trabalho."},
    {"id": 183, "text": "Pergunta: O que é a consistência em uma transação? Resposta: Consistência garante que uma transação leve o banco de dados de um estado consistente para outro estado consistente."},
    {"id": 184, "text": "Pergunta: O que é o isolamento em uma transação? Resposta: Isolamento garante que os efeitos de uma transação sejam invisíveis para outras transações até que ela seja concluída."},
    {"id": 185, "text": "Pergunta: O que é a durabilidade em uma transação? Resposta: Durabilidade garante que os efeitos de uma transação persistam mesmo em caso de falha do sistema."},
    {"id": 186, "text": "Pergunta: O que é a normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 187, "text": "Pergunta: Quais são as formas normais na normalização de banco de dados? Resposta: As formas normais incluem 1NF (Primeira Forma Normal), 2NF (Segunda Forma Normal) e 3NF (Terceira Forma Normal)."},
    {"id": 188, "text": "Pergunta: O que é a primeira forma normal (1NF) em normalização de banco de dados? Resposta: 1NF exige que cada coluna em uma tabela tenha um único valor, não permitindo valores repetidos."},
    {"id": 189, "text": "Pergunta: O que é a segunda forma normal (2NF) em normalização de banco de dados? Resposta: 2NF exige que uma tabela esteja na 1NF e que todas as dependências parciais sejam removidas."},
    {"id": 190, "text": "Pergunta: O que é a terceira forma normal (3NF) em normalização de banco de dados? Resposta: 3NF exige que uma tabela esteja na 2NF e que todas as dependências transitivas sejam removidas."},
    {"id": 191, "text": "Pergunta: O que é um banco de dados distribuído? Resposta: Um banco de dados distribuído é um banco de dados no qual os dados são armazenados em várias localizações geográficas."},
    {"id": 192, "text": "Pergunta: Quais são os desafios de um banco de dados distribuído? Resposta: Os desafios incluem consistência de dados, latência de rede e complexidade de gerenciamento."},
    {"id": 193, "text": "Pergunta: O que é uma transação distribuída? Resposta: Uma transação distribuída é uma transação que envolve acessar e modificar dados em várias localizações geográficas."},
    {"id": 194, "text": "Pergunta: Quais são os protocolos de comunicação usados em um banco de dados distribuído? Resposta: Os protocolos comuns incluem TCP/IP, HTTP, e gRPC."},
    {"id": 195, "text": "Pergunta: O que é a arquitetura cliente-servidor em um banco de dados? Resposta: Na arquitetura cliente-servidor, os clientes enviam solicitações para um servidor de banco de dados que processa essas solicitações e retorna os resultados."},
    {"id": 196, "text": "Pergunta: O que é a arquitetura peer-to-peer em um banco de dados? Resposta: Na arquitetura peer-to-peer, cada nó em um sistema tem capacidade para ser tanto cliente quanto servidor, permitindo a comunicação direta entre eles."},
    {"id": 197, "text": "Pergunta: O que é um índice em um banco de dados? Resposta: Um índice é uma estrutura de dados que melhora a velocidade de recuperação de dados de uma tabela."},
    {"id": 198, "text": "Pergunta: Quais são os tipos de índices em um banco de dados? Resposta: Os tipos incluem índices simples, índices compostos, índices únicos e índices em cluster."},
    {"id": 199, "text": "Pergunta: O que é normalização de banco de dados? Resposta: Normalização de banco de dados é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 200, "text": "Pergunta: Quais são os benefícios da normalização de banco de dados? Resposta: Os benefícios incluem redução de redundância, melhoria da integridade dos dados e economia de espaço de armazenamento."},
    {"id": 201, "text": "Pergunta: O que é denormalização de banco de dados? Resposta: Denormalização de banco de dados é o processo de adicionar redundância aos dados para melhorar o desempenho das consultas."},
    {"id": 202, "text": "Pergunta: Quais são os benefícios da denormalização de banco de dados? Resposta: Os benefícios incluem melhor desempenho de consulta e simplificação de consultas complexas."},
    {"id": 203, "text": "Pergunta: O que é particionamento de banco de dados? Resposta: Particionamento de banco de dados é o processo de dividir uma grande tabela em partes menores para melhorar o desempenho e a escalabilidade."},
    {"id": 204, "text": "Pergunta: Quais são os tipos de particionamento de banco de dados? Resposta: Os tipos incluem particionamento horizontal e particionamento vertical."},
    {"id": 205, "text": "Pergunta: O que é particionamento horizontal de banco de dados? Resposta: Particionamento horizontal é quando os dados de uma tabela são divididos em várias partes com base em uma condição, como intervalos de valores."},
    {"id": 206, "text": "Pergunta: O que é particionamento vertical de banco de dados? Resposta: Particionamento vertical é quando os dados de uma tabela são divididos em várias partes com base em colunas."},
    {"id": 207, "text": "Pergunta: O que é um banco de dados OLTP? Resposta: Um banco de dados OLTP (Online Transaction Processing) é um banco de dados projetado para processar transações em tempo real."},
    {"id": 208, "text": "Pergunta: O que é um banco de dados OLAP? Resposta: Um banco de dados OLAP (Online Analytical Processing) é um banco de dados projetado para análise e consulta de dados de negócios."},
    {"id": 209, "text": "Pergunta: Quais são as diferenças entre um banco de dados OLTP e um banco de dados OLAP? Resposta: Um banco de dados OLTP é otimizado para transações em tempo real, enquanto um banco de dados OLAP é otimizado para análise e consulta de dados."},
    {"id": 210, "text": "Pergunta: O que é um banco de dados em nuvem? Resposta: Um banco de dados em nuvem é um banco de dados hospedado em uma infraestrutura de computação em nuvem, como AWS, Azure ou Google Cloud."},
    {"id": 211, "text": "Pergunta: Quais são os benefícios de um banco de dados em nuvem? Resposta: Os benefícios incluem escalabilidade sob demanda, alta disponibilidade, e custo reduzido de gerenciamento."},
    {"id": 212, "text": "Pergunta: O que é o modelo de dados NoSQL? Resposta: O modelo de dados NoSQL é um modelo de dados que não segue o modelo relacional tradicional, permitindo flexibilidade e escalabilidade."},
    {"id": 213, "text": "Pergunta: Quais são os tipos de bancos de dados NoSQL mais comuns? Resposta: Os tipos incluem bancos de dados de documentos, bancos de dados de chave-valor, bancos de dados de coluna ampla e bancos de dados de gráfico."},
    {"id": 214, "text": "Pergunta: O que é consistência eventual em um banco de dados NoSQL? Resposta: Consistência eventual é uma garantia de que, eventualmente, todas as réplicas de dados em um sistema distribuído estarão consistentes."},
    {"id": 215, "text": "Pergunta: O que é sharding em um banco de dados NoSQL? Resposta: Sharding é o processo de dividir os dados em várias máquinas para melhorar o desempenho e a escalabilidade."},
    {"id": 216, "text": "Pergunta: O que é um banco de dados em memória? Resposta: Um banco de dados em memória é um tipo de banco de dados que armazena e manipula os dados principais na memória do computador, em vez de em um disco."},
    {"id": 217, "text": "Pergunta: Quais são as vantagens de usar um banco de dados em memória? Resposta: As vantagens incluem alta velocidade de acesso aos dados, baixa latência e capacidade de lidar com grandes volumes de dados em tempo real."},
    {"id": 218, "text": "Pergunta: O que é replicação de banco de dados? Resposta: Replicação é o processo de criar e manter cópias redundantes dos dados em diferentes locais para fins de backup, recuperação de desastres e balanceamento de carga."},
    {"id": 219, "text": "Pergunta: Quais são os métodos de replicação de banco de dados? Resposta: Os métodos incluem replicação síncrona, replicação assíncrona e replicação em cascata."},
    {"id": 220, "text": "Pergunta: O que é uma stored procedure? Resposta: Uma stored procedure é um conjunto de instruções SQL pré-compiladas que podem ser armazenadas e executadas no servidor de banco de dados."},
    {"id": 221, "text": "Pergunta: Quais são as vantagens de usar stored procedures? Resposta: As vantagens incluem melhor desempenho, segurança aprimorada e reutilização de código."},
    {"id": 222, "text": "Pergunta: O que é um trigger em um banco de dados? Resposta: Um trigger é uma ação automática que é executada quando um evento específico ocorre em uma tabela."},
    {"id": 223, "text": "Pergunta: Quais são os tipos de triggers em um banco de dados? Resposta: Os tipos comuns incluem triggers de inserção, triggers de atualização, triggers de exclusão e triggers de ação em cascata."},
    {"id": 224, "text": "Pergunta: O que é uma visão em um banco de dados? Resposta: Uma visão é uma consulta SQL armazenada que aparece como uma tabela virtual para os usuários do banco de dados."},
    {"id": 225, "text": "Pergunta: Quais são as vantagens de usar visões em um banco de dados? Resposta: As vantagens incluem segurança aprimorada, simplificação de consultas complexas e reuso de consultas frequentes."},
    {"id": 226, "text": "Pergunta: O que é a linguagem de programação PL/SQL? Resposta: PL/SQL (Procedural Language/Structured Query Language) é uma extensão procedural da SQL usada em bancos de dados Oracle."},
    {"id": 227, "text": "Pergunta: O que é a linguagem de programação T-SQL? Resposta: T-SQL (Transact-SQL) é uma extensão procedural da SQL usada em bancos de dados SQL Server."},
    {"id": 228, "text": "Pergunta: O que é um modelo de dados em um banco de dados? Resposta: Um modelo de dados é uma representação dos dados e suas relações em um banco de dados."},
    {"id": 229, "text": "Pergunta: Quais são os modelos de dados mais comuns? Resposta: Os modelos mais comuns incluem o modelo relacional, o modelo hierárquico, o modelo de rede e o modelo de objeto."},
    {"id": 230, "text": "Pergunta: O que é o modelo E-R? Resposta: O modelo E-R (Entidade-Relacionamento) é um modelo de dados usado para representar entidades e seus relacionamentos em um banco de dados."},
    {"id": 231, "text": "Pergunta: O que é a normalização de dados em um modelo E-R? Resposta: Normalização de dados é o processo de organizar os atributos de uma entidade de forma que não haja redundância ou dependência."},
    {"id": 232, "text": "Pergunta: O que é um diagrama de entidade-relacionamento (DER)? Resposta: Um diagrama de entidade-relacionamento é uma representação gráfica das entidades e seus relacionamentos em um modelo E-R."},
    {"id": 233, "text": "Pergunta: O que é o modelo de dados relacional? Resposta: O modelo de dados relacional é um modelo de dados baseado em tabelas que representam entidades e seus relacionamentos."},
    {"id": 234, "text": "Pergunta: Quais são os componentes de um modelo de dados relacional? Resposta: Os componentes incluem tabelas, colunas, chaves primárias, chaves estrangeiras e relacionamentos."},
    {"id": 235, "text": "Pergunta: O que é uma tabela em um modelo de dados relacional? Resposta: Uma tabela é uma estrutura de dados que armazena informações em linhas e colunas."},
    {"id": 236, "text": "Pergunta: O que é uma coluna em uma tabela de banco de dados? Resposta: Uma coluna é uma estrutura de dados que armazena um tipo específico de informação em uma tabela de banco de dados."},
    {"id": 237, "text": "Pergunta: O que é uma restrição de integridade em um banco de dados relacional? Resposta: Uma restrição de integridade é uma regra que limita os valores que podem ser inseridos em uma coluna de uma tabela."},
    {"id": 238, "text": "Pergunta: O que é uma chave estrangeira em um banco de dados relacional? Resposta: Uma chave estrangeira é um campo ou conjunto de campos em uma tabela que estabelece uma relação com outra tabela."},
    {"id": 239, "text": "Pergunta: O que é uma consulta em um banco de dados? Resposta: Uma consulta é uma instrução SQL usada para recuperar dados de um banco de dados."},
    {"id": 240, "text": "Pergunta: Quais são os tipos de consultas SQL? Resposta: Os tipos incluem consultas de seleção, consultas de inserção, consultas de atualização e consultas de exclusão."},
    {"id": 241, "text": "Pergunta: O que é uma cláusula WHERE em uma consulta SQL? Resposta: A cláusula WHERE é usada para filtrar os resultados de uma consulta com base em uma condição especificada."},
    {"id": 242, "text": "Pergunta: O que é uma cláusula ORDER BY em uma consulta SQL? Resposta: A cláusula ORDER BY é usada para classificar os resultados de uma consulta com base em uma ou mais colunas especificadas."},
    {"id": 243, "text": "Pergunta: O que é uma cláusula GROUP BY em uma consulta SQL? Resposta: A cláusula GROUP BY é usada para agrupar os resultados de uma consulta com base em valores semelhantes em uma ou mais colunas."},
    {"id": 244, "text": "Pergunta: O que é uma cláusula HAVING em uma consulta SQL? Resposta: A cláusula HAVING é usada para filtrar os resultados de uma consulta agrupada com base em uma condição especificada."},
    {"id": 245, "text": "Pergunta: O que é uma junção em uma consulta SQL? Resposta: Uma junção é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada."},
    {"id": 246, "text": "Pergunta: Quais são os tipos de junções em uma consulta SQL? Resposta: Os tipos incluem INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN."},
    {"id": 247, "text": "Pergunta: O que é uma transação em um banco de dados? Resposta: Uma transação é uma série de operações de banco de dados que são tratadas como uma única unidade de trabalho."},
    {"id": 248, "text": "Pergunta: Quais são as propriedades ACID de uma transação? Resposta: As propriedades são Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 249, "text": "Pergunta: O que é a atomicidade em uma transação? Resposta: Atomicidade garante que uma transação seja tratada como uma unidade indivisível de trabalho."},
    {"id": 250, "text": "Pergunta: O que é a consistência em uma transação? Resposta: Consistência garante que uma transação leve o banco de dados de um estado consistente para outro estado consistente."},
    {"id": 251, "text": "Pergunta: O que é o isolamento em uma transação? Resposta: Isolamento garante que os efeitos de uma transação sejam invisíveis para outras transações até que ela seja concluída."},
    {"id": 252, "text": "Pergunta: O que é a durabilidade em uma transação? Resposta: Durabilidade garante que os efeitos de uma transação persistam mesmo em caso de falha do sistema."},
    {"id": 253, "text": "Pergunta: O que é a normalização de banco de dados? Resposta: Normalização é o processo de organizar os dados em um banco de dados relacional para reduzir a redundância e a inconsistência."},
    {"id": 254, "text": "Pergunta: Quais são as formas normais na normalização de banco de dados? Resposta: As formas normais incluem 1NF (Primeira Forma Normal), 2NF (Segunda Forma Normal) e 3NF (Terceira Forma Normal)."},
    {"id": 255, "text": "Pergunta: O que é a primeira forma normal (1NF) em normalização de banco de dados? Resposta: 1NF exige que cada coluna em uma tabela tenha um único valor, não permitindo valores repetidos."},
    {"id": 256, "text": "Pergunta: O que é a segunda forma normal (2NF) em normalização de banco de dados? Resposta: 2NF exige que uma tabela esteja na 1NF e que todas as dependências parciais sejam removidas."},
    {"id": 257, "text": "Pergunta: O que é a terceira forma normal (3NF) em normalização de banco de dados? Resposta: 3NF exige que uma tabela esteja na 2NF e que todas as dependências transitivas sejam removidas."}
]
