[
    {"id": 1, "text": "Pergunta: O que é HTML? Resposta: HTML é uma linguagem de marcação usada para estruturar o conteúdo na web."},
    {"id": 2, "text": "Pergunta: O que significa <!DOCTYPE html>? Resposta: É uma declaração que informa ao navegador a versão do HTML que o documento está usando."},
    {"id": 3, "text": "Pergunta: O que é uma tag HTML? Resposta: Uma tag HTML é uma palavra-chave cercada por colchetes angulares (<>) usada para definir o conteúdo."},
    {"id": 4, "text": "Pergunta: O que é o elemento head em HTML? Resposta: O elemento head contém metadados sobre o documento HTML, como seu título e links para scripts e folhas de estilo."},
    {"id": 5, "text": "Pergunta: O que é o elemento body em HTML? Resposta: O elemento body contém o conteúdo principal que é exibido no navegador."},
    {"id": 6, "text": "Pergunta: O que é uma tag de título em HTML? Resposta: A tag de título define o título do documento, que é exibido na barra de título do navegador."},
    {"id": 7, "text": "Pergunta: O que é uma tag de parágrafo em HTML? Resposta: A tag de parágrafo (<p>) é usada para definir um parágrafo de texto."},
    {"id": 8, "text": "Pergunta: O que é uma tag de link em HTML? Resposta: A tag de link (<a>) é usada para criar um link para outra página."},
    {"id": 9, "text": "Pergunta: O que é uma tag de imagem em HTML? Resposta: A tag de imagem (<img>) é usada para incorporar uma imagem na página."},
    {"id": 10, "text": "Pergunta: O que é uma tag de lista em HTML? Resposta: As tags de lista (<ul> para listas não ordenadas, <ol> para listas ordenadas) são usadas para criar listas de itens."},
    {"id": 11, "text": "Pergunta: O que é uma tag de cabeçalho em HTML? Resposta: As tags de cabeçalho (<h1> a <h6>) são usadas para definir títulos e subtítulos."},
    {"id": 12, "text": "Pergunta: O que é uma tag de divisão em HTML? Resposta: A tag de divisão (<div>) é usada para agrupar elementos em blocos."},
    {"id": 13, "text": "Pergunta: O que é uma tag de tabela em HTML? Resposta: A tag de tabela (<table>) é usada para criar uma tabela."},
    {"id": 14, "text": "Pergunta: O que é uma tag de formulário em HTML? Resposta: A tag de formulário (<form>) é usada para criar um formulário interativo."},
    {"id": 15, "text": "Pergunta: O que é uma tag de entrada em HTML? Resposta: A tag de entrada (<input>) é usada para criar campos de entrada interativos."},
    {"id": 16, "text": "Pergunta: O que é uma tag de botão em HTML? Resposta: A tag de botão (<button>) é usada para criar um botão clicável."},
    {"id": 17, "text": "Pergunta: O que é uma tag de script em HTML? Resposta: A tag de script (<script>) é usada para incorporar ou referenciar código JavaScript."},
    {"id": 18, "text": "Pergunta: O que é uma tag de estilo em HTML? Resposta: A tag de estilo (<style>) é usada para incorporar estilos CSS."},
    {"id": 19, "text": "Pergunta: O que é uma tag de comentário em HTML? Resposta: A tag de comentário (<!-- -->) é usada para adicionar comentários que não são exibidos no navegador."},
    {"id": 20, "text": "Pergunta: O que é uma tag de âncora em HTML? Resposta: A tag de âncora (<a>) é usada para criar hiperlinks."},
    {"id": 21, "text": "Pergunta: O que é uma tag de vídeo em HTML? Resposta: A tag de vídeo (<video>) é usada para incorporar um vídeo na página."},
    {"id": 22, "text": "Pergunta: O que é uma tag de áudio em HTML? Resposta: A tag de áudio (<audio>) é usada para incorporar um áudio na página."},
    {"id": 23, "text": "Pergunta: O que é uma tag de citação em HTML? Resposta: A tag de citação (<blockquote>) é usada para definir uma seção que é citada de outra fonte."},
    {"id": 24, "text": "Pergunta: O que é uma tag de código em HTML? Resposta: A tag de código (<code>) é usada para definir um pedaço de código de computador."},
    {"id": 25, "text": "Pergunta: O que é uma tag de ênfase em HTML? Resposta: A tag de ênfase (<em>) é usada para definir um texto enfatizado."},
    {"id": 26, "text": "Pergunta: O que é uma tag de negrito em HTML? Resposta: A tag de negrito (<b>) é usada para definir um texto em negrito."},
    {"id": 27, "text": "Pergunta: O que é uma tag de itálico em HTML? Resposta: A tag de itálico (<i>) é usada para definir um texto em itálico."},
    {"id": 28, "text": "Pergunta: O que é uma tag de sublinhado em HTML? Resposta: A tag de sublinhado (<u>) é usada para definir um texto sublinhado."},
    {"id": 29, "text": "Pergunta: O que é uma tag de pequeno em HTML? Resposta: A tag de pequeno (<small>) é usada para definir um texto menor."},
    {"id": 30, "text": "Pergunta: O que é uma tag de grande em HTML? Resposta: A tag de grande (<big>) é usada para definir um texto maior."},
    {"id": 31, "text": "Pergunta: O que é uma tag de suprimido em HTML? Resposta: A tag de suprimido (<del>) é usada para definir um texto que foi excluído de um documento."},
    {"id": 32, "text": "Pergunta: O que é uma tag de inserido em HTML? Resposta: A tag de inserido (<ins>) é usada para definir um texto que foi inserido em um documento."},
    {"id": 33, "text": "Pergunta: O que é uma tag de marca em HTML? Resposta: A tag de marca (<mark>) é usada para definir um texto marcado ou destacado para referência."},
    {"id": 34, "text": "Pergunta: O que é uma tag de abreviação em HTML? Resposta: A tag de abreviação (<abbr>) é usada para definir uma abreviação ou acrônimo."},
    {"id": 35, "text": "Pergunta: O que é uma tag de endereço em HTML? Resposta: A tag de endereço (<address>) é usada para definir informações de contato para o autor/proprietário de um documento ou artigo."},
    {"id": 36, "text": "Pergunta: O que é uma tag de bi-direcional em HTML? Resposta: A tag de bi-direcional (<bdi>) isola uma parte do texto que pode ser formatada em uma direção diferente de outros textos fora dela."},
    {"id": 37, "text": "Pergunta: O que é uma tag de detalhes em HTML? Resposta: A tag de detalhes (<details>) é usada para definir detalhes adicionais que o usuário pode abrir ou fechar."},
    {"id": 38, "text": "Pergunta: O que é uma tag de diálogo em HTML? Resposta: A tag de diálogo (<dialog>) é usada para definir uma caixa de diálogo ou janela."},
    {"id": 39, "text": "Pergunta: O que é uma tag de figcaption em HTML? Resposta: A tag de figcaption (<figcaption>) é usada para definir uma legenda para uma figura (<figure>)."},
    {"id": 40, "text": "Pergunta: O que é uma tag de cabeçalho de seção em HTML? Resposta: A tag de cabeçalho de seção (<header>) é usada para definir um cabeçalho para uma seção ou documento."},
    {"id": 41, "text": "Pergunta: O que é uma tag de rodapé de seção em HTML? Resposta: A tag de rodapé de seção (<footer>) é usada para definir um rodapé para uma seção ou documento."},
    {"id": 42, "text": "Pergunta: O que é uma tag de artigo em HTML? Resposta: A tag de artigo (<article>) é usada para definir um conteúdo independente, como um post de blog ou um comentário."},
    {"id": 43, "text": "Pergunta: O que é uma tag de seção em HTML? Resposta: A tag de seção (<section>) é usada para definir uma seção em um documento."},
    {"id": 44, "text": "Pergunta: O que é uma tag de navegação em HTML? Resposta: A tag de navegação (<nav>) é usada para definir links de navegação."},
    {"id": 45, "text": "Pergunta: O que é uma tag de lado em HTML? Resposta: A tag de lado (<aside>) é usada para definir conteúdo à parte do conteúdo principal."},
    {"id": 46, "text": "Pergunta: O que é uma tag de tempo em HTML? Resposta: A tag de tempo (<time>) é usada para definir uma data/hora."},
    {"id": 47, "text": "Pergunta: O que é uma tag de resumo em HTML? Resposta: A tag de resumo (<summary>) é usada para definir um cabeçalho visível para o elemento <details>."},
    {"id": 48, "text": "Pergunta: O que é uma tag de progresso em HTML? Resposta: A tag de progresso (<progress>) é usada para representar o progresso de uma tarefa."},
    {"id": 49, "text": "Pergunta: O que é uma tag de metro em HTML? Resposta: A tag de metro (<meter>) é usada para medir a escala dentro de um intervalo predefinido."},
    {"id": 50, "text": "Pergunta: O que é uma tag de data e hora em HTML? Resposta: A tag de data e hora (<datetime>) é usada para representar uma data e hora."},
    {"id": 51, "text": "Pergunta: O que é uma tag de cabeçalho de tabela em HTML? Resposta: A tag de cabeçalho de tabela (<th>) é usada para definir uma célula de cabeçalho em uma tabela."},
    {"id": 52, "text": "Pergunta: O que é uma tag de célula de tabela em HTML? Resposta: A tag de célula de tabela (<td>) é usada para definir uma célula padrão em uma tabela."},
    {"id": 53, "text": "Pergunta: O que é uma tag de linha de tabela em HTML? Resposta: A tag de linha de tabela (<tr>) é usada para definir uma linha em uma tabela."},
    {"id": 54, "text": "Pergunta: O que é uma tag de corpo de tabela em HTML? Resposta: A tag de corpo de tabela (<tbody>) é usada para agrupar o conteúdo do corpo em uma tabela."},
    {"id": 55, "text": "Pergunta: O que é uma tag de cabeçalho de tabela em HTML? Resposta: A tag de cabeçalho de tabela (<thead>) é usada para agrupar o conteúdo do cabeçalho em uma tabela."},
    {"id": 56, "text": "Pergunta: O que é uma tag de rodapé de tabela em HTML? Resposta: A tag de rodapé de tabela (<tfoot>) é usada para agrupar o conteúdo do rodapé em uma tabela."},
    {"id": 57, "text": "Pergunta: O que é uma tag de coluna de tabela em HTML? Resposta: A tag de coluna de tabela (<col>) é usada para especificar propriedades de coluna para cada coluna dentro de um grupo de colunas (<colgroup>) em uma tabela."},
    {"id": 58, "text": "Pergunta: O que é uma tag de grupo de colunas em HTML? Resposta: A tag de grupo de colunas (<colgroup>) é usada para especificar um grupo de uma ou mais colunas em uma tabela para formatação."},
    {"id": 59, "text": "Pergunta: O que é uma tag de legenda de tabela em HTML? Resposta: A tag de legenda de tabela (<caption>) é usada para definir uma legenda para uma tabela."},
    {"id": 60, "text": "Pergunta: O que é uma tag de campo de conjunto em HTML? Resposta: A tag de campo de conjunto (<fieldset>) é usada para agrupar elementos relacionados em um formulário."},
    {"id": 61, "text": "Pergunta: O que é uma tag de legenda de campo em HTML? Resposta: A tag de legenda de campo (<legend>) é usada para definir uma legenda para um elemento <fieldset>."},
    {"id": 62, "text": "Pergunta: O que é uma tag de opção em HTML? Resposta: A tag de opção (<option>) é usada para definir uma opção que pode ser selecionada."},
    {"id": 63, "text": "Pergunta: O que é uma tag de seleção em HTML? Resposta: A tag de seleção (<select>) é usada para criar uma lista suspensa."},
    {"id": 64, "text": "Pergunta: O que é uma tag de optgroup em HTML? Resposta: A tag de optgroup (<optgroup>) é usada para agrupar opções relacionadas."},
    {"id": 65, "text": "Pergunta: O que é uma tag de textarea em HTML? Resposta: A tag de textarea (<textarea>) é usada para criar uma área de texto multilinha."},
    {"id": 66, "text": "Pergunta: O que é uma tag de rótulo em HTML? Resposta: A tag de rótulo (<label>) é usada para definir um rótulo para um elemento <input>."},
    {"id": 67, "text": "Pergunta: O que é uma tag de saída em HTML? Resposta: A tag de saída (<output>) é usada para representar o resultado de um cálculo."},
    {"id": 68, "text": "Pergunta: O que é uma tag de progresso em HTML? Resposta: A tag de progresso (<progress>) é usada para representar o progresso de uma tarefa."},
    {"id": 69, "text": "Pergunta: O que é uma tag de metro em HTML? Resposta: A tag de metro (<meter>) é usada para medir a escala dentro de um intervalo predefinido."},
    {"id": 70, "text": "Pergunta: O que é uma tag de data e hora em HTML? Resposta: A tag de data e hora (<datetime>) é usada para representar uma data e hora."},
    {"id": 71, "text": "Pergunta: O que é uma tag de legenda em HTML? Resposta: A tag de legenda (<caption>) é usada para fornecer uma legenda para uma tabela."},
    {"id": 72, "text": "Pergunta: O que é uma tag de figura em HTML? Resposta: A tag de figura (<figure>) é usada para especificar conteúdo autônomo, como uma imagem, diagrama, foto, código ou texto."},
    {"id": 73, "text": "Pergunta: O que é uma tag de figcaption em HTML? Resposta: A tag de figcaption (<figcaption>) é usada para fornecer uma legenda para uma figura (<figure>)."},
    {"id": 74, "text": "Pergunta: O que é uma tag de main em HTML? Resposta: A tag de main (<main>) é usada para especificar o conteúdo principal único dentro de um documento."},
    {"id": 75, "text": "Pergunta: O que é uma tag de mark em HTML? Resposta: A tag de mark (<mark>) é usada para destacar ou marcar partes do texto."},
    {"id": 76, "text": "Pergunta: O que é uma tag de menu em HTML? Resposta: A tag de menu (<menu>) é usada para criar um menu de comandos."},
    {"id": 77, "text": "Pergunta: O que é uma tag de menuitem em HTML? Resposta: A tag de menuitem (<menuitem>) é usada para definir um comando/menu que o usuário pode invocar a partir de um menu popup."},
    {"id": 78, "text": "Pergunta: O que é uma tag de nav em HTML? Resposta: A tag de nav (<nav>) é usada para definir links de navegação."},
    {"id": 79, "text": "Pergunta: O que é uma tag de noscript em HTML? Resposta: A tag de noscript (<noscript>) é usada para fornecer uma alternativa para usuários que têm scripts desativados ou cujo navegador não suporta script."},
    {"id": 80, "text": "Pergunta: O que é uma tag de output em HTML? Resposta: A tag de output (<output>) é usada para representar o resultado de um cálculo ou ação do usuário."},
    {"id": 81, "text": "Pergunta: O que é uma tag de progress em HTML? Resposta: A tag de progress (<progress>) é usada para representar o progresso de uma tarefa."},
    {"id": 82, "text": "Pergunta: O que é uma tag de rb em HTML? Resposta: A tag de rb (<rb>) é usada para marcar o componente base de um ruby annotation, usado para fornecer leituras fonéticas ou explicações de caracteres chineses, japoneses e coreanos."},
    {"id": 83, "text": "Pergunta: O que é uma tag de rp em HTML? Resposta: A tag de rp (<rp>) é usada para fornecer parênteses ao redor de um ruby text component, para navegadores que não suportam ruby annotations."},
    {"id": 84, "text": "Pergunta: O que é uma tag de rt em HTML? Resposta: A tag de rt (<rt>) é usada para marcar o componente de texto de uma ruby annotation."},
    {"id": 85, "text": "Pergunta: O que é uma tag de rtc em HTML? Resposta: A tag de rtc (<rtc>) é usada para marcar o componente de descrição de uma ruby annotation."},
    {"id": 86, "text": "Pergunta: O que é uma tag de ruby em HTML? Resposta: A tag de ruby (<ruby>) é usada para fornecer leituras fonéticas ou explicações de caracteres chineses, japoneses e coreanos."},
    {"id": 87, "text": "Pergunta: O que é uma tag de s em HTML? Resposta: A tag de s (<s>) é usada para representar texto que não é mais correto ou relevante."},
    {"id": 88, "text": "Pergunta: O que é uma tag de samp em HTML? Resposta: A tag de samp (<samp>) é usada para representar texto de saída de amostra de um programa de computador."},
    {"id": 89, "text": "Pergunta: O que é uma tag de script em HTML? Resposta: A tag de script (<script>) é usada para incorporar ou referenciar código JavaScript."},
    {"id": 90, "text": "Pergunta: O que é uma tag de section em HTML? Resposta: A tag de section (<section>) é usada para definir uma seção em um documento."},
    {"id": 91, "text": "Pergunta: O que é uma tag de select em HTML? Resposta: A tag de select (<select>) é usada para criar uma lista suspensa de opções."},
    {"id": 92, "text": "Pergunta: O que é uma tag de small em HTML? Resposta: A tag de small (<small>) é usada para definir um texto menor."},
    {"id": 93, "text": "Pergunta: O que é uma tag de source em HTML? Resposta: A tag de source (<source>) é usada com as tags <video> e <audio> para fornecer várias fontes de mídia."},
    {"id": 94, "text": "Pergunta: O que é uma tag de span em HTML? Resposta: A tag de span (<span>) é usada para agrupar elementos inline."},
    {"id": 95, "text": "Pergunta: O que é uma tag de strong em HTML? Resposta: A tag de strong (<strong>) é usada para definir um texto importante."},
    {"id": 96, "text": "Pergunta: O que é uma tag de style em HTML? Resposta: A tag de style (<style>) é usada para definir estilos CSS inline."},
    {"id": 97, "text": "Pergunta: O que é uma tag de sub em HTML? Resposta: A tag de sub (<sub>) é usada para definir um texto subscrito."},
    {"id": 98, "text": "Pergunta: O que é uma tag de summary em HTML? Resposta: A tag de summary (<summary>) é usada para fornecer um cabeçalho visível para o elemento <details>."},
    {"id": 99, "text": "Pergunta: O que é uma tag de sup em HTML? Resposta: A tag de sup (<sup>) é usada para definir um texto sobrescrito."},
    {"id": 100, "text": "Pergunta: O que é uma tag de table em HTML? Resposta: A tag de table (<table>) é usada para criar uma tabela."}
]
