[
    {"id": 1, "text": "Pergunta: O que é HTML? Resposta: HTML é uma linguagem de marcação usada para estruturar o conteúdo na web."},
    {"id": 2, "text": "Pergunta: O que significa <!DOCTYPE html>? Resposta: É uma declaração que informa ao navegador a versão do HTML que o documento está usando."},
    {"id": 3, "text": "Pergunta: O que é uma tag HTML? Resposta: Uma tag HTML é uma palavra-chave cercada por colchetes angulares (<>) usada para definir o conteúdo."},
    {"id": 4, "text": "Pergunta: Qual é a estrutura básica de um documento HTML? Resposta: A estrutura básica de um documento HTML inclui a declaração do tipo de documento, a tag <html>, que contém as tags <head> e <body>."},
    {"id": 5, "text": "Pergunta: O que é uma tag de abertura e fechamento em HTML? Resposta: Uma tag de abertura é usada para iniciar um elemento e uma tag de fechamento é usada para encerrá-lo."},
    {"id": 6, "text": "Pergunta: Como criar um link em HTML? Resposta: Você pode criar um link em HTML usando a tag <a> e especificando o atributo href com o URL desejado."}, 
    {"id": 7, "text": "Pergunta: O que é um elemento de lista em HTML? Resposta: Um elemento de lista em HTML é usado para criar listas ordenadas ou não ordenadas e é definido pelas tags <ul> (para listas não ordenadas) ou <ol> (para listas ordenadas)."},
    {"id": 8, "text": "Pergunta: Qual é a diferença entre elementos inline e block em HTML? Resposta: Elementos inline são exibidos em linha, ocupando apenas o espaço necessário ao redor do conteúdo, enquanto elementos block começam em uma nova linha e ocupam toda a largura disponível."},
    {"id": 9, "text": "Pergunta: O que é um atributo em HTML? Resposta: Um atributo em HTML fornece informações adicionais sobre um elemento e é especificado dentro da tag de abertura do elemento."},
    {"id": 10, "text": "Pergunta: O que é um formulário em HTML? Resposta: Um formulário em HTML é usado para coletar dados do usuário e é definido pela tag <form>."},
    {"id": 11, "text": "Pergunta: Como criar uma tabela em HTML? Resposta: Você pode criar uma tabela em HTML usando as tags <table> para definir a tabela em si, <tr> para definir as linhas e <td> para definir as células."},
    {"id": 12, "text": "Pergunta: O que são tags semânticas em HTML? Resposta: Tags semânticas em HTML são elementos que fornecem significado para o conteúdo, facilitando a compreensão da estrutura do documento."},
    {"id": 13, "text": "Pergunta: O que é um comentário em HTML? Resposta: Um comentário em HTML é usado para incluir anotações no código que não serão exibidas no navegador."},
    {"id": 14, "text": "Pergunta: Como incluir imagens em uma página HTML? Resposta: Você pode incluir imagens em uma página HTML usando a tag <img> e especificando o atributo src com o URL da imagem."},
    {"id": 15, "text": "Pergunta: O que é o elemento <div> em HTML? Resposta: O elemento <div> em HTML é usado como um contêiner genérico para agrupar elementos e estilizá-los com CSS."},
    {"id": 16, "text": "Pergunta: Qual é a diferença entre HTML e HTML5? Resposta: HTML5 é a versão mais recente do HTML e introduz novos recursos, como elementos semânticos, APIs e capacidades de multimídia."},
    {"id": 17, "text": "Pergunta: O que é um elemento de formulário em HTML? Resposta: Um elemento de formulário em HTML é uma entrada usada para coletar informações do usuário, como caixas de texto, botões de opção e botões de envio."},
    {"id": 18, "text": "Pergunta: Como incluir um vídeo em uma página HTML? Resposta: Você pode incluir um vídeo em uma página HTML usando a tag <video> e especificando o atributo src com o URL do vídeo."},
    {"id": 19, "text": "Pergunta: O que é um hyperlink em HTML? Resposta: Um hyperlink em HTML é um elemento usado para vincular uma página a outra ou a um recurso externo."},
    {"id": 20, "text": "Pergunta: O que é o atributo href em HTML? Resposta: O atributo href em HTML é usado em elementos de hyperlink para especificar o destino do link."},
    {"id": 21, "text": "Pergunta: O que é um cabeçalho em HTML? Resposta: Um cabeçalho em HTML é uma seção que contém informações introdutórias ou de navegação, geralmente definida pela tag <header>."},
    {"id": 22, "text": "Pergunta: O que é uma tag de título em HTML? Resposta: Uma tag de título em HTML é usada para definir o título de um documento, que é exibido na barra de título do navegador."},
    {"id": 23, "text": "Pergunta: Como criar um comentário em HTML? Resposta: Você pode criar um comentário em HTML usando <!-- para iniciar o comentário e --> para encerrá-lo."},
    {"id": 24, "text": "Pergunta: O que é o elemento <span> em HTML? Resposta: O elemento <span> em HTML é usado para aplicar estilos a partes específicas do texto sem alterar a estrutura do documento."},
    {"id": 25, "text": "Pergunta: O que é a validação de formulário em HTML? Resposta: A validação de formulário em HTML é o processo de verificar se os dados inseridos em um formulário atendem aos critérios especificados antes de serem enviados para processamento."},
    {"id": 26, "text": "Pergunta: O que é uma tag de script em HTML? Resposta: Uma tag de script em HTML é usada para incluir código JavaScript em um documento HTML."},
    {"id": 27, "text": "Pergunta: O que é o elemento <footer> em HTML? Resposta: O elemento <footer> em HTML é usado para definir o rodapé de uma página ou de uma seção específica."},
    {"id": 28, "text": "Pergunta: Como adicionar um comentário em HTML? Resposta: Você pode adicionar um comentário em HTML usando <!-- para iniciar o comentário e --> para encerrá-lo."},
    {"id": 29, "text": "Pergunta: O que é um atributo src em HTML? Resposta: O atributo src em HTML é usado para especificar o local de origem de um recurso, como uma imagem ou um vídeo."},
    {"id": 30, "text": "Pergunta: Qual é a finalidade da tag <meta> em HTML? Resposta: A tag <meta> em HTML é usada para fornecer metadados sobre o documento, como descrição, palavras-chave e codificação de caracteres."},
    {"id": 31, "text": "Pergunta: Como criar uma lista ordenada em HTML? Resposta: Você pode criar uma lista ordenada em HTML usando a tag <ol> e inserindo itens de lista com a tag <li> dentro dela."},
    {"id": 32, "text": "Pergunta: O que é uma tabela em HTML? Resposta: Uma tabela em HTML é usada para organizar dados em linhas e colunas, permitindo uma apresentação estruturada."},
    {"id": 33, "text": "Pergunta: Como definir o idioma de uma página HTML? Resposta: Você pode definir o idioma de uma página HTML usando o atributo lang na tag <html>, por exemplo, lang=\"en\" para inglês."},
    {"id": 34, "text": "Pergunta: O que é a tag <head> em HTML? Resposta: A tag <head> em HTML é usada para conter metadados, scripts, estilos e outras informações que não são exibidas diretamente na página."},
    {"id": 35, "text": "Pergunta: O que é um elemento <iframe> em HTML? Resposta: O elemento <iframe> em HTML é usado para incorporar outro documento HTML dentro do documento atual."},
    {"id": 36, "text": "Pergunta: Como adicionar um título a uma página HTML? Resposta: Você pode adicionar um título a uma página HTML usando a tag <title> dentro da tag <head>."},
    {"id": 37, "text": "Pergunta: O que é uma tag <article> em HTML? Resposta: A tag <article> em HTML é usada para representar um conteúdo independente que faz sentido por si só, como um post de blog ou um artigo de jornal."},
    {"id": 38, "text": "Pergunta: Como definir estilos em uma página HTML? Resposta: Você pode definir estilos em uma página HTML usando a tag <style> dentro da tag <head> ou vinculando um arquivo CSS externo."},
    {"id": 39, "text": "Pergunta: O que é uma tag <section> em HTML? Resposta: A tag <section> em HTML é usada para agrupar conteúdo relacionado em uma seção temática da página."},
    {"id": 40, "text": "Pergunta: O que é a tag <nav> em HTML? Resposta: A tag <nav> em HTML é usada para definir um conjunto de links de navegação em uma página."},
    {"id": 41, "text": "Pergunta: O que é a tag <main> em HTML? Resposta: A tag <main> em HTML é usada para representar o conteúdo principal de um documento, que é único e central para a página."},
    {"id": 42, "text": "Pergunta: Como incluir áudio em uma página HTML? Resposta: Você pode incluir áudio em uma página HTML usando a tag <audio> e especificando o atributo src com o URL do arquivo de áudio."},
    {"id": 43, "text": "Pergunta: O que é uma tag <aside> em HTML? Resposta: A tag <aside> em HTML é usada para definir conteúdo que está relacionado ao conteúdo principal, mas que pode ser considerado separado, como barras laterais ou notas de rodapé."},
    {"id": 44, "text": "Pergunta: O que é uma tag <figure> em HTML? Resposta: A tag <figure> em HTML é usada para encapsular conteúdo de mídia, como imagens ou gráficos, junto com sua legenda."},
    {"id": 45, "text": "Pergunta: O que é a tag <figcaption> em HTML? Resposta: A tag <figcaption> em HTML é usada para fornecer uma legenda ou descrição para o conteúdo encapsulado pela tag <figure>."},
    {"id": 46, "text": "Pergunta: Como incluir um arquivo CSS externo em uma página HTML? Resposta: Você pode incluir um arquivo CSS externo em uma página HTML usando a tag <link> dentro da tag <head> e especificando o atributo href com o URL do arquivo CSS."},
    {"id": 47, "text": "Pergunta: O que é a tag <em> em HTML? Resposta: A tag <em> em HTML é usada para enfatizar texto, geralmente exibindo-o em itálico."},
    {"id": 48, "text": "Pergunta: O que é a tag <strong> em HTML? Resposta: A tag <strong> em HTML é usada para destacar texto importante, geralmente exibindo-o em negrito."},
    {"id": 49, "text": "Pergunta: O que é a tag <code> em HTML? Resposta: A tag <code> em HTML é usada para definir trechos de código de programação, geralmente exibidos em uma fonte monoespaçada."},
    {"id": 50, "text": "Pergunta: Como criar um botão em HTML? Resposta: Você pode criar um botão em HTML usando a tag <button> e definindo seu conteúdo dentro da tag."},
    {"id": 51, "text": "Pergunta: O que é o elemento <abbr> em HTML? Resposta: O elemento <abbr> em HTML é usado para definir uma abreviação ou um acrônimo, fornecendo uma explicação completa que aparece quando o cursor é sobreposta à abreviação."},
    {"id": 52, "text": "Pergunta: O que é a tag <blockquote> em HTML? Resposta: A tag <blockquote> em HTML é usada para citar um bloco de texto de outra fonte."},
    {"id": 53, "text": "Pergunta: O que é um elemento <pre> em HTML? Resposta: O elemento <pre> em HTML é usado para representar texto pré-formatado, preservando espaços em branco e quebras de linha."},
    {"id": 54, "text": "Pergunta: Qual é a função da tag <cite> em HTML? Resposta: A tag <cite> em HTML é usada para citar o título de uma obra, como um livro, filme ou artigo."},
    {"id": 55, "text": "Pergunta: O que é a tag <code> em HTML? Resposta: A tag <code> em HTML é usada para representar código de computador."},
    {"id": 56, "text": "Pergunta: O que é o elemento <datalist> em HTML? Resposta: O elemento <datalist> em HTML é usado para fornecer uma lista de opções para elementos de entrada, como campos de texto."},
    {"id": 57, "text": "Pergunta: O que é a tag <details> em HTML? Resposta: A tag <details> em HTML é usada para criar um elemento de detalhes interativo que pode ser expandido ou recolhido para exibir ou ocultar informações adicionais."},
    {"id": 58, "text": "Pergunta: O que é a tag <fieldset> em HTML? Resposta: A tag <fieldset> em HTML é usada para agrupar elementos de formulário relacionados, como rótulos e campos de entrada."},
    {"id": 59, "text": "Pergunta: Qual é a função da tag <legend> em HTML? Resposta: A tag <legend> em HTML é usada para fornecer uma legenda descritiva para um elemento <fieldset>."},
    {"id": 60, "text": "Pergunta: O que é o elemento <figcaption> em HTML? Resposta: O elemento <figcaption> em HTML é usado para fornecer uma legenda ou uma descrição para um elemento <figure>."},
    {"id": 61, "text": "Pergunta: O que é a tag <form> em HTML? Resposta: A tag <form> em HTML é usada para criar um formulário para coletar dados do usuário."},
    {"id": 62, "text": "Pergunta: Como criar uma caixa de seleção em HTML? Resposta: Você pode criar uma caixa de seleção em HTML usando a tag <select> juntamente com a tag <option> para cada opção de escolha."},
    {"id": 63, "text": "Pergunta: O que é o atributo action em uma tag <form> em HTML? Resposta: O atributo action em uma tag <form> em HTML especifica para onde os dados do formulário serão enviados após o envio."},
    {"id": 64, "text": "Pergunta: O que é o atributo method em uma tag <form> em HTML? Resposta: O atributo method em uma tag <form> em HTML especifica como os dados do formulário serão enviados, sendo geralmente GET ou POST."},
    {"id": 65, "text": "Pergunta: O que é a tag <input> em HTML? Resposta: A tag <input> em HTML é usada para criar controles de formulário interativos, como campos de texto, botões de rádio ou caixas de seleção."},
    {"id": 66, "text": "Pergunta: Como criar um campo de texto em HTML? Resposta: Você pode criar um campo de texto em HTML usando a tag <input> com o atributo type=\"text\"."},
    {"id": 67, "text": "Pergunta: O que é o elemento <label> em HTML? Resposta: O elemento <label> em HTML é usado para associar um rótulo descritivo a um elemento de formulário, melhorando a acessibilidade e a usabilidade."},
    {"id": 68, "text": "Pergunta: Como criar um botão de envio em HTML? Resposta: Você pode criar um botão de envio em HTML usando a tag <input> com o atributo type=\"submit\"."},
    {"id": 69, "text": "Pergunta: Como criar um botão de reinicialização em HTML? Resposta: Você pode criar um botão de reinicialização em HTML usando a tag <input> com o atributo type=\"reset\"."},
    {"id": 70, "text": "Pergunta: O que é o elemento <optgroup> em HTML? Resposta: O elemento <optgroup> em HTML é usado para agrupar opções relacionadas dentro de um elemento <select>."},
    {"id": 71, "text": "Pergunta: O que é o atributo disabled em HTML? Resposta: O atributo disabled em HTML é usado para desativar um controle de formulário, impedindo que ele seja interagido ou enviado com o formulário."},
    {"id": 72, "text": "Pergunta: O que é o atributo required em HTML? Resposta: O atributo required em HTML é usado para tornar um controle de formulário obrigatório, exigindo que o usuário preencha-o antes de enviar o formulário."},
    {"id": 73, "text": "Pergunta: O que é a tag <textarea> em HTML? Resposta: A tag <textarea> em HTML é usada para criar um campo de texto de várias linhas em um formulário."},
    {"id": 74, "text": "Pergunta: O que é o atributo rows em uma tag <textarea> em HTML? Resposta: O atributo rows em uma tag <textarea> em HTML especifica o número de linhas visíveis no campo de texto."},
    {"id": 75, "text": "Pergunta: O que é o atributo cols em uma tag <textarea> em HTML? Resposta: O atributo cols em uma tag <textarea> em HTML especifica o número de colunas visíveis no campo de texto."},
    {"id": 76, "text": "Pergunta: Como criar um campo de senha em HTML? Resposta: Você pode criar um campo de senha em HTML usando a tag <input> com o atributo type=\"password\"."},
    {"id": 77, "text": "Pergunta: O que é o atributo placeholder em HTML? Resposta: O atributo placeholder em HTML é usado para fornecer um texto de exemplo dentro de um campo de formulário, indicando ao usuário o tipo de informação a ser inserida."},
    {"id": 78, "text": "Pergunta: O que é o atributo autofocus em HTML? Resposta: O atributo autofocus em HTML é usado para especificar que um controle de formulário deve receber automaticamente o foco quando a página é carregada."},
    {"id": 79, "text": "Pergunta: O que é o atributo autocomplete em HTML? Resposta: O atributo autocomplete em HTML é usado para especificar se um controle de formulário deve ter o recurso de preenchimento automático ativado ou desativado."},
    {"id": 80, "text": "Pergunta: O que é o elemento <select> em HTML? Resposta: O elemento <select> em HTML é usado para criar uma lista suspensa de opções selecionáveis."},
    {"id": 81, "text": "Pergunta: Como criar uma opção em um menu suspenso em HTML? Resposta: Você pode criar uma opção em um menu suspenso em HTML usando a tag <option> dentro de um elemento <select>."},
    {"id": 82, "text": "Pergunta: O que é o atributo multiple em uma tag <select> em HTML? Resposta: O atributo multiple em uma tag <select> em HTML permite que o usuário selecione várias opções."},
    {"id": 83, "text": "Pergunta: O que é a tag <optgroup> em HTML? Resposta: A tag <optgroup> em HTML é usada para agrupar opções relacionadas dentro de um elemento <select>."},
    {"id": 84, "text": "Pergunta: O que é o elemento <option> em HTML? Resposta: O elemento <option> em HTML é usado para definir uma opção em um menu suspenso."},
    {"id": 85, "text": "Pergunta: O que é o elemento <datalist> em HTML? Resposta: O elemento <datalist> em HTML é usado para fornecer uma lista de opções para elementos de entrada, como campos de texto."},
    {"id": 86, "text": "Pergunta: O que é o atributo form em uma tag <input> em HTML? Resposta: O atributo form em uma tag <input> em HTML especifica a qual formulário o controle de entrada pertence."},
    {"id": 87, "text": "Pergunta: O que é o atributo value em uma tag <input> em HTML? Resposta: O atributo value em uma tag <input> em HTML define o valor inicial ou o valor inserido pelo usuário para um campo de entrada."},
    {"id": 88, "text": "Pergunta: O que é o atributo name em uma tag <input> em HTML? Resposta: O atributo name em uma tag <input> em HTML define o nome do controle de entrada, usado para identificar os dados enviados para o servidor."},
    {"id": 89, "text": "Pergunta: O que é o atributo type em uma tag <input> em HTML? Resposta: O atributo type em uma tag <input> em HTML define o tipo de controle de entrada, como texto, senha ou botão."},
    {"id": 90, "text": "Pergunta: O que é o elemento <button> em HTML? Resposta: O elemento <button> em HTML é usado para criar um botão clicável em um formulário."},
    {"id": 91, "text": "Pergunta: Como criar um botão de rádio em HTML? Resposta: Você pode criar um botão de rádio em HTML usando a tag <input> com o atributo type=\"radio\"."},
    {"id": 92, "text": "Pergunta: O que é o atributo checked em uma tag <input> em HTML? Resposta: O atributo checked em uma tag <input> em HTML define se um controle de entrada, como um botão de rádio ou uma caixa de seleção, deve estar inicialmente marcado."},
    {"id": 93, "text": "Pergunta: Como criar uma caixa de seleção em HTML? Resposta: Você pode criar uma caixa de seleção em HTML usando a tag <input> com o atributo type=\"checkbox\"."},
    {"id": 94, "text": "Pergunta: O que é o atributo src em uma tag <img> em HTML? Resposta: O atributo src em uma tag <img> em HTML especifica o URL da imagem que será exibida."},
    {"id": 95, "text": "Pergunta: O que é o atributo alt em uma tag <img> em HTML? Resposta: O atributo alt em uma tag <img> em HTML fornece um texto alternativo que será exibido se a imagem não puder ser carregada ou acessada."},
    {"id": 96, "text": "Pergunta: Como criar um link em HTML? Resposta: Você pode criar um link em HTML usando a tag <a> e especificando o atributo href com o URL desejado."},
    {"id": 97, "text": "Pergunta: O que é o atributo href em uma tag <a> em HTML? Resposta: O atributo href em uma tag <a> em HTML especifica o URL de destino para o link."},
    {"id": 98, "text": "Pergunta: O que é o atributo target em uma tag <a> em HTML? Resposta: O atributo target em uma tag <a> em HTML especifica onde abrir o URL de destino, como em uma nova janela ou na mesma janela."},
    {"id": 99, "text": "Pergunta: O que é o elemento <meta> em HTML? Resposta: O elemento <meta> em HTML é usado para fornecer metadados sobre o documento, como descrição, palavras-chave e codificação de caracteres."},
    {"id": 100, "text": "Pergunta: Qual é a finalidade da tag <head> em HTML? Resposta: A tag <head> em HTML é usada para conter metadados, scripts, estilos e outras informações que não são exibidas diretamente na página."},
    {"id": 101, "text": "Pergunta: O que é o elemento <title> em HTML? Resposta: O elemento <title> em HTML é usado para definir o título do documento, que é exibido na barra de título do navegador."},
    {"id": 102, "text": "Pergunta: O que é o elemento <body> em HTML? Resposta: O elemento <body> em HTML é usado para conter todo o conteúdo visível de uma página da web, como texto, imagens, vídeos e outros elementos."},
    {"id": 103, "text": "Pergunta: Como adicionar um comentário em HTML? Resposta: Você pode adicionar um comentário em HTML usando <!-- para iniciar o comentário e --> para encerrá-lo."},
    {"id": 104, "text": "Pergunta: O que é o elemento <div> em HTML? Resposta: O elemento <div> em HTML é usado como um contêiner genérico para agrupar elementos e estilizá-los com CSS."},
    {"id": 105, "text": "Pergunta: O que é o elemento <span> em HTML? Resposta: O elemento <span> em HTML é usado para aplicar estilos a partes específicas do texto sem alterar a estrutura do documento."},
    {"id": 106, "text": "Pergunta: O que é o atributo id em HTML? Resposta: O atributo id em HTML é usado para fornecer uma identificação única para um elemento, permitindo que ele seja referenciado por CSS ou JavaScript."},
    {"id": 107, "text": "Pergunta: O que é o atributo class em HTML? Resposta: O atributo class em HTML é usado para aplicar uma ou mais classes a um elemento, permitindo a estilização e o comportamento especificados por CSS ou JavaScript."},
    {"id": 108, "text": "Pergunta: O que é o elemento <iframe> em HTML? Resposta: O elemento <iframe> em HTML é usado para incorporar outro documento HTML dentro do documento atual."},
    {"id": 109, "text": "Pergunta: O que é o atributo src em uma tag <iframe> em HTML? Resposta: O atributo src em uma tag <iframe> em HTML especifica o URL do documento a ser incorporado."},
    {"id": 110, "text": "Pergunta: O que é o atributo width em uma tag <iframe> em HTML? Resposta: O atributo width em uma tag <iframe> em HTML especifica a largura da área de visualização do iframe."},
    {"id": 111, "text": "Pergunta: O que é o atributo height em uma tag <iframe> em HTML? Resposta: O atributo height em uma tag <iframe> em HTML especifica a altura da área de visualização do iframe."},
    {"id": 112, "text": "Pergunta: O que é o elemento <audio> em HTML? Resposta: O elemento <audio> em HTML é usado para incorporar arquivos de áudio em uma página da web."},
    {"id": 113, "text": "Pergunta: O que é o atributo controls em uma tag <audio> em HTML? Resposta: O atributo controls em uma tag <audio> em HTML especifica que controles de reprodução de áudio devem ser exibidos para o usuário."},
    {"id": 114, "text": "Pergunta: O que é o atributo autoplay em uma tag <audio> em HTML? Resposta: O atributo autoplay em uma tag <audio> em HTML especifica que o áudio deve começar a ser reproduzido automaticamente quando a página é carregada."},
    {"id": 115, "text": "Pergunta: O que é o atributo loop em uma tag <audio> em HTML? Resposta: O atributo loop em uma tag <audio> em HTML especifica que o áudio deve ser reproduzido em um loop infinito."},
    {"id": 116, "text": "Pergunta: O que é o elemento <video> em HTML? Resposta: O elemento <video> em HTML é usado para incorporar arquivos de vídeo em uma página da web."},
    {"id": 117, "text": "Pergunta: O que é o atributo controls em uma tag <video> em HTML? Resposta: O atributo controls em uma tag <video> em HTML especifica que controles de reprodução de vídeo devem ser exibidos para o usuário."},
    {"id": 118, "text": "Pergunta: O que é o atributo autoplay em uma tag <video> em HTML? Resposta: O atributo autoplay em uma tag <video> em HTML especifica que o vídeo deve começar a ser reproduzido automaticamente quando a página é carregada."},
    {"id": 119, "text": "Pergunta: O que é o atributo loop em uma tag <video> em HTML? Resposta: O atributo loop em uma tag <video> em HTML especifica que o vídeo deve ser reproduzido em um loop infinito."},
    {"id": 120, "text": "Pergunta: O que é o atributo muted em uma tag <video> em HTML? Resposta: O atributo muted em uma tag <video> em HTML especifica que o áudio do vídeo deve ser reproduzido em silêncio."},
    {"id": 121, "text": "Pergunta: O que é o atributo poster em uma tag <video> em HTML? Resposta: O atributo poster em uma tag <video> em HTML especifica uma imagem a ser exibida enquanto o vídeo está sendo carregado ou até que o usuário inicie a reprodução."},
    {"id": 122, "text": "Pergunta: O que é o elemento <canvas> em HTML? Resposta: O elemento <canvas> em HTML é usado para desenhar gráficos, gráficos, animações e outros gráficos dinâmicos usando JavaScript."},
    {"id": 123, "text": "Pergunta: O que é o elemento <svg> em HTML? Resposta: O elemento <svg> em HTML é usado para desenhar gráficos vetoriais escaláveis usando XML e JavaScript."},
    {"id": 124, "text": "Pergunta: O que é o elemento <map> em HTML? Resposta: O elemento <map> em HTML é usado junto com a tag <area> para definir uma imagem como um mapa de imagem com áreas clicáveis."},
    {"id": 125, "text": "Pergunta: O que é o elemento <area> em HTML? Resposta: O elemento <area> em HTML é usado dentro de um elemento <map> para definir uma área clicável em um mapa de imagem."},
    {"id": 126, "text": "Pergunta: O que é o atributo alt em uma tag <area> em HTML? Resposta: O atributo alt em uma tag <area> em HTML fornece um texto alternativo para uma área clicável em um mapa de imagem, para acessibilidade."},
    {"id": 127, "text": "Pergunta: O que é o elemento <figure> em HTML? Resposta: O elemento <figure> em HTML é usado para encapsular conteúdo multimídia, como imagens, vídeos ou gráficos, juntamente com uma legenda opcional representada pela tag <figcaption>."},
    {"id": 128, "text": "Pergunta: O que é o elemento <figcaption> em HTML? Resposta: O elemento <figcaption> em HTML é usado para fornecer uma legenda ou uma descrição para um elemento <figure>."},
    {"id": 129, "text": "Pergunta: O que é o elemento <details> em HTML? Resposta: O elemento <details> em HTML é usado para criar um elemento de detalhes interativo que pode ser expandido ou recolhido para exibir ou ocultar informações adicionais."},
    {"id": 130, "text": "Pergunta: O que é o atributo open em uma tag <details> em HTML? Resposta: O atributo open em uma tag <details> em HTML especifica que os detalhes devem ser visíveis por padrão."},
    {"id": 131, "text": "Pergunta: O que é o elemento <summary> em HTML? Resposta: O elemento <summary> em HTML é usado dentro de um elemento <details> para fornecer um título ou uma legenda para os detalhes."},
    {"id": 132, "text": "Pergunta: O que é o elemento <progress> em HTML? Resposta: O elemento <progress> em HTML é usado para criar uma barra de progresso que representa o andamento de uma tarefa."},
    {"id": 133, "text": "Pergunta: O que é o atributo value em uma tag <progress> em HTML? Resposta: O atributo value em uma tag <progress> em HTML especifica o valor atual da barra de progresso."},
    {"id": 134, "text": "Pergunta: O que é o atributo max em uma tag <progress> em HTML? Resposta: O atributo max em uma tag <progress> em HTML especifica o valor máximo possível da barra de progresso."},
    {"id": 135, "text": "Pergunta: O que é o elemento <meter> em HTML? Resposta: O elemento <meter> em HTML é usado para criar uma barra de medição que representa uma medida escalar dentro de um intervalo conhecido."},
    {"id": 136, "text": "Pergunta: O que é o atributo value em uma tag <meter> em HTML? Resposta: O atributo value em uma tag <meter> em HTML especifica o valor atual da medição."},
    {"id": 137, "text": "Pergunta: O que é o atributo min em uma tag <meter> em HTML? Resposta: O atributo min em uma tag <meter> em HTML especifica o valor mínimo possível da medição."},
    {"id": 138, "text": "Pergunta: O que é o atributo max em uma tag <meter> em HTML? Resposta: O atributo max em uma tag <meter> em HTML especifica o valor máximo possível da medição."},
    {"id": 139, "text": "Pergunta: O que é o elemento <time> em HTML? Resposta: O elemento <time> em HTML é usado para representar uma data ou hora, permitindo que os navegadores compreendam e formate a informação adequadamente."},
    {"id": 140, "text": "Pergunta: O que é o atributo datetime em uma tag <time> em HTML? Resposta: O atributo datetime em uma tag <time> em HTML especifica a data e/ou hora associada ao conteúdo, usando o formato de data e hora globalmente aceito."},
    {"id": 141, "text": "Pergunta: O que é o elemento <nav> em HTML? Resposta: O elemento <nav> em HTML é usado para definir uma seção de navegação em uma página da web, contendo links para outras páginas ou áreas da mesma página."},
    {"id": 142, "text": "Pergunta: O que é o elemento <article> em HTML? Resposta: O elemento <article> em HTML é usado para definir uma seção autônoma de conteúdo em uma página da web, como um post de blog ou uma notícia."},
    {"id": 143, "text": "Pergunta: O que é o elemento <aside> em HTML? Resposta: O elemento <aside> em HTML é usado para definir um conteúdo lateral relacionado ao conteúdo circundante, como barras laterais ou informações adicionais."},
    {"id": 144, "text": "Pergunta: O que é o elemento <footer> em HTML? Resposta: O elemento <footer> em HTML é usado para definir o rodapé de uma página ou de uma seção específica de uma página."},
    {"id": 145, "text": "Pergunta: O que é o elemento <header> em HTML? Resposta: O elemento <header> em HTML é usado para definir o cabeçalho de uma página ou de uma seção específica de uma página."},
    {"id": 146, "text": "Pergunta: O que é o elemento <main> em HTML? Resposta: O elemento <main> em HTML é usado para definir o conteúdo principal de uma página da web, excluindo cabeçalhos, rodapés e barras laterais."},
    {"id": 147, "text": "Pergunta: O que é o elemento <section> em HTML? Resposta: O elemento <section> em HTML é usado para agrupar conteúdo relacionado em uma página da web, como uma seção de um artigo ou uma parte de uma página."},
    {"id": 148, "text": "Pergunta: O que é o atributo role em HTML? Resposta: O atributo role em HTML é usado para especificar a função de um elemento em uma página da web, ajudando a melhorar a acessibilidade e a semântica do código."},
    {"id": 149, "text": "Pergunta: O que é o elemento <details> em HTML? Resposta: O elemento <details> em HTML é usado para criar um elemento de detalhes interativo que pode ser expandido ou recolhido para exibir ou ocultar informações adicionais."},
    {"id": 150, "text": "Pergunta: O que é o atributo open em uma tag <details> em HTML? Resposta: O atributo open em uma tag <details> em HTML especifica que os detalhes devem ser visíveis por padrão."},
    {"id": 151, "text": "Pergunta: O que é o elemento <summary> em HTML? Resposta: O elemento <summary> em HTML é usado dentro de um elemento <details> para fornecer um título ou uma legenda para os detalhes."},
    {"id": 152, "text": "Pergunta: O que é o elemento <dialog> em HTML? Resposta: O elemento <dialog> em HTML é usado para criar uma caixa de diálogo ou uma janela modal que exige a atenção do usuário antes de continuar."},
    {"id": 153, "text": "Pergunta: O que é o atributo open em uma tag <dialog> em HTML? Resposta: O atributo open em uma tag <dialog> em HTML especifica que o diálogo deve ser exibido aberto por padrão."},
    {"id": 154, "text": "Pergunta: O que é o elemento <mark> em HTML? Resposta: O elemento <mark> em HTML é usado para destacar ou marcar partes do texto, geralmente com um fundo amarelo."},
    {"id": 155, "text": "Pergunta: O que é o elemento <progress> em HTML? Resposta: O elemento <progress> em HTML é usado para criar uma barra de progresso que representa o andamento de uma tarefa."},
    {"id": 156, "text": "Pergunta: O que é o atributo value em uma tag <progress> em HTML? Resposta: O atributo value em uma tag <progress> em HTML especifica o valor atual da barra de progresso."},
    {"id": 157, "text": "Pergunta: O que é o atributo max em uma tag <progress> em HTML? Resposta: O atributo max em uma tag <progress> em HTML especifica o valor máximo possível da barra de progresso."},
    {"id": 158, "text": "Pergunta: O que é o elemento <meter> em HTML? Resposta: O elemento <meter> em HTML é usado para criar uma barra de medição que representa uma medida escalar dentro de um intervalo conhecido."},
    {"id": 159, "text": "Pergunta: O que é o atributo value em uma tag <meter> em HTML? Resposta: O atributo value em uma tag <meter> em HTML especifica o valor atual da medição."},
    {"id": 160, "text": "Pergunta: O que é o atributo min em uma tag <meter> em HTML? Resposta: O atributo min em uma tag <meter> em HTML especifica o valor mínimo possível da medição."},
    {"id": 161, "text": "Pergunta: O que é o atributo max em uma tag <meter> em HTML? Resposta: O atributo max em uma tag <meter> em HTML especifica o valor máximo possível da medição."},
    {"id": 162, "text": "Pergunta: O que é o elemento <time> em HTML? Resposta: O elemento <time> em HTML é usado para representar uma data ou hora, permitindo que os navegadores compreendam e formate a informação adequadamente."},
    {"id": 163, "text": "Pergunta: O que é o atributo datetime em uma tag <time> em HTML? Resposta: O atributo datetime em uma tag <time> em HTML especifica a data e/ou hora associada ao conteúdo, usando o formato de data e hora globalmente aceito."},
    {"id": 164, "text": "Pergunta: O que é o elemento <abbr> em HTML? Resposta: O elemento <abbr> em HTML é usado para definir uma abreviação ou uma sigla, fornecendo uma expansão opcional que é exibida quando o mouse passa sobre ela."},
    {"id": 165, "text": "Pergunta: O que é o atributo title em uma tag <abbr> em HTML? Resposta: O atributo title em uma tag <abbr> em HTML fornece a expansão da abreviação ou sigla, que é exibida quando o mouse passa sobre ela."},
    {"id": 166, "text": "Pergunta: O que é o elemento <cite> em HTML? Resposta: O elemento <cite> em HTML é usado para definir o título de uma obra, como um livro, filme ou artigo, que pode ser referenciado no texto."},
    {"id": 167, "text": "Pergunta: O que é o elemento <code> em HTML? Resposta: O elemento <code> em HTML é usado para representar uma peça de código, geralmente em um contexto de computação ou programação."},
    {"id": 168, "text": "Pergunta: O que é o elemento <dfn> em HTML? Resposta: O elemento <dfn> em HTML é usado para definir uma instância de um termo definido em um glossário ou dicionário."},
    {"id": 169, "text": "Pergunta: O que é o elemento <em> em HTML? Resposta: O elemento <em> em HTML é usado para enfatizar o texto, geralmente exibindo-o em itálico."},
    {"id": 170, "text": "Pergunta: O que é o elemento <kbd> em HTML? Resposta: O elemento <kbd> em HTML é usado para representar a entrada do teclado, como a pressionar de uma tecla."},
    {"id": 171, "text": "Pergunta: O que é o elemento <mark> em HTML? Resposta: O elemento <mark> em HTML é usado para destacar ou marcar partes do texto, geralmente com um fundo amarelo."},
    {"id": 172, "text": "Pergunta: O que é o elemento <samp> em HTML? Resposta: O elemento <samp> em HTML é usado para representar saída de amostra de programas de computador, como saída de terminal ou console."},
    {"id": 173, "text": "Pergunta: O que é o elemento <strong> em HTML? Resposta: O elemento <strong> em HTML é usado para enfatizar o texto, geralmente exibindo-o em negrito."},
    {"id": 174, "text": "Pergunta: O que é o elemento <var> em HTML? Resposta: O elemento <var> em HTML é usado para representar uma variável em um contexto de programação ou matemática."},
    {"id": 175, "text": "Pergunta: O que é o elemento <bdi> em HTML? Resposta: O elemento <bdi> em HTML é usado para isolar uma parte do texto que pode ser formatada de maneira diferente do texto circundante devido a direções de texto diferentes."},
    {"id": 176, "text": "Pergunta: O que é o elemento <bdo> em HTML? Resposta: O elemento <bdo> em HTML é usado para especificar a direção de texto para o texto dentro do elemento, como de direita para esquerda."},
    {"id": 177, "text": "Pergunta: O que é o elemento <span> em HTML? Resposta: O elemento <span> em HTML é usado para aplicar estilos a partes específicas do texto sem alterar a estrutura do documento."},
    {"id": 178, "text": "Pergunta: O que é o elemento <br> em HTML? Resposta: O elemento <br> em HTML é usado para inserir uma quebra de linha, forçando o texto seguinte a iniciar em uma nova linha."},
    {"id": 179, "text": "Pergunta: O que é o elemento <wbr> em HTML? Resposta: O elemento <wbr> em HTML é usado para indicar um local onde a quebra de palavra pode ocorrer em uma linha."},
    {"id": 180, "text": "Pergunta: O que é o elemento <del> em HTML? Resposta: O elemento <del> em HTML é usado para representar texto que foi removido ou deletado de um documento."},
    {"id": 181, "text": "Pergunta: O que é o atributo cite em uma tag <blockquote> em HTML? Resposta: O atributo cite em uma tag <blockquote> em HTML especifica a fonte do conteúdo citado."},
    {"id": 182, "text": "Pergunta: O que é o elemento <hr> em HTML? Resposta: O elemento <hr> em HTML é usado para criar uma linha horizontal que separa o conteúdo."},
    {"id": 183, "text": "Pergunta: O que é o elemento <q> em HTML? Resposta: O elemento <q> em HTML é usado para criar uma citação em linha, indicando que o texto está entre aspas."},
    {"id": 184, "text": "Pergunta: O que é o elemento <sub> em HTML? Resposta: O elemento <sub> em HTML é usado para representar texto subscrito, geralmente letras menores colocadas abaixo da linha de base."},
    {"id": 185, "text": "Pergunta: O que é o elemento <sup> em HTML? Resposta: O elemento <sup> em HTML é usado para representar texto sobrescrito, geralmente letras menores colocadas acima da linha de base."},
    {"id": 186, "text": "Pergunta: O que é o elemento <pre> em HTML? Resposta: O elemento <pre> em HTML é usado para preservar a formatação de texto, exibindo-o exatamente como está no código-fonte, com espaçamento e quebras de linha intactos."},
    {"id": 187, "text": "Pergunta: O que é o elemento <address> em HTML? Resposta: O elemento <address> em HTML é usado para fornecer informações de contato para o autor ou proprietário de um documento."},
    {"id": 188, "text": "Pergunta: O que é o elemento <article> em HTML? Resposta: O elemento <article> em HTML é usado para definir uma seção autônoma de conteúdo em uma página da web, como um post de blog ou um artigo."},
    {"id": 189, "text": "Pergunta: O que é o elemento <aside> em HTML? Resposta: O elemento <aside> em HTML é usado para definir um conteúdo lateral relacionado ao conteúdo circundante, como barras laterais ou informações adicionais."},
    {"id": 190, "text": "Pergunta: O que é o elemento <details> em HTML? Resposta: O elemento <details> em HTML é usado para criar um elemento de detalhes interativo que pode ser expandido ou recolhido para exibir ou ocultar informações adicionais."},
    {"id": 191, "text": "Pergunta: O que é o atributo open em uma tag <details> em HTML? Resposta: O atributo open em uma tag <details> em HTML especifica que os detalhes devem ser visíveis por padrão."},
    {"id": 192, "text": "Pergunta: O que é o elemento <summary> em HTML? Resposta: O elemento <summary> em HTML é usado dentro de um elemento <details> para fornecer um título ou uma legenda para os detalhes."},
    {"id": 193, "text": "Pergunta: O que é o elemento <figcaption> em HTML? Resposta: O elemento <figcaption> em HTML é usado para fornecer uma legenda ou uma descrição para um elemento <figure>."},
    {"id": 194, "text": "Pergunta: O que é o elemento <figure> em HTML? Resposta: O elemento <figure> em HTML é usado para encapsular conteúdo multimídia, como imagens, vídeos ou gráficos, juntamente com uma legenda opcional representada pela tag <figcaption>."},
    {"id": 195, "text": "Pergunta: O que é o elemento <footer> em HTML? Resposta: O elemento <footer> em HTML é usado para definir o rodapé de uma página ou de uma seção específica de uma página."},
    {"id": 196, "text": "Pergunta: O que é o elemento <header> em HTML? Resposta: O elemento <header> em HTML é usado para definir o cabeçalho de uma página ou de uma seção específica de uma página."},
    {"id": 197, "text": "Pergunta: O que é o elemento <hgroup> em HTML? Resposta: O elemento <hgroup> em HTML é usado para agrupar múltiplos elementos <h1> a <h6> que fazem parte de um título ou cabeçalho."},
    {"id": 198, "text": "Pergunta: O que é o elemento <main> em HTML? Resposta: O elemento <main> em HTML é usado para definir o conteúdo principal de uma página da web, excluindo cabeçalhos, rodapés e barras laterais."},
    {"id": 199, "text": "Pergunta: O que é o elemento <mark> em HTML? Resposta: O elemento <mark> em HTML é usado para destacar ou marcar partes do texto, geralmente com um fundo amarelo."},
    {"id": 200, "text": "Pergunta: O que é o elemento <nav> em HTML? Resposta: O elemento <nav> em HTML é usado para definir uma seção de navegação em uma página da web, contendo links para outras páginas ou áreas da mesma página."},
    {"id": 201, "text": "Pergunta: O que é o elemento <section> em HTML? Resposta: O elemento <section> em HTML é usado para agrupar conteúdo relacionado em uma página da web, como uma seção de um artigo ou uma parte de uma página."},
    {"id": 202, "text": "Pergunta: O que é o atributo role em HTML? Resposta: O atributo role em HTML é usado para especificar a função de um elemento em uma página da web, ajudando a melhorar a acessibilidade e a semântica do código."},
    {"id": 203, "text": "Pergunta: O que é o elemento <blockquote> em HTML? Resposta: O elemento <blockquote> em HTML é usado para criar uma citação longa ou um bloco de texto que foi citado de outra fonte."},
    {"id": 204, "text": "Pergunta: O que é o atributo cite em uma tag <blockquote> em HTML? Resposta: O atributo cite em uma tag <blockquote> em HTML especifica a fonte do conteúdo citado."},
    {"id": 205, "text": "Pergunta: O que é o elemento <dd> em HTML? Resposta: O elemento <dd> em HTML é usado dentro de um elemento <dl> para definir a descrição de um termo ou item de lista."},
    {"id": 206, "text": "Pergunta: O que é o elemento <div> em HTML? Resposta: O elemento <div> em HTML é usado como um contêiner genérico para agrupar elementos e estilizá-los com CSS."},
    {"id": 207, "text": "Pergunta: O que é o elemento <dl> em HTML? Resposta: O elemento <dl> em HTML é usado para criar uma lista de descrição, onde cada termo é seguido por uma ou mais descrições."},
    {"id": 208, "text": "Pergunta: O que é o elemento <dt> em HTML? Resposta: O elemento <dt> em HTML é usado dentro de um elemento <dl> para definir um termo ou um item de lista."},
    {"id": 209, "text": "Pergunta: O que é o elemento <figcaption> em HTML? Resposta: O elemento <figcaption> em HTML é usado para fornecer uma legenda ou uma descrição para um elemento <figure>."},
    {"id": 210, "text": "Pergunta: O que é o elemento <figure> em HTML? Resposta: O elemento <figure> em HTML é usado para encapsular conteúdo multimídia, como imagens, vídeos ou gráficos, juntamente com uma legenda opcional representada pela tag <figcaption>."},
    {"id": 211, "text": "Pergunta: O que é o elemento <hr> em HTML? Resposta: O elemento <hr> em HTML é usado para criar uma linha horizontal que separa o conteúdo."},
    {"id": 212, "text": "Pergunta: O que é o elemento <html> em HTML? Resposta: O elemento <html> em HTML é o elemento raiz de um documento HTML, envolvendo todo o conteúdo da página."},
    {"id": 213, "text": "Pergunta: O que é o elemento <head> em HTML? Resposta: O elemento <head> em HTML é usado para conter metadados, como título, metatags, scripts e links para folhas de estilo, que não são exibidos diretamente na página."},
    {"id": 214, "text": "Pergunta: O que é o elemento <title> em HTML? Resposta: O elemento <title> em HTML é usado dentro do elemento <head> para especificar o título da página, que é exibido na barra de título do navegador ou na guia."},
    {"id": 215, "text": "Pergunta: O que são metatags em HTML? Resposta: Metatags em HTML são tags especiais usadas para fornecer informações sobre a página, como descrição, palavras-chave, codificação de caracteres e autor."},
    {"id": 216, "text": "Pergunta: O que é o elemento <meta> em HTML? Resposta: O elemento <meta> em HTML é usado para definir metadados que não são exibidos na página, como a codificação de caracteres, a descrição da página e as palavras-chave."},
    {"id": 217, "text": "Pergunta: O que é o atributo charset em uma tag <meta> em HTML? Resposta: O atributo charset em uma tag <meta> em HTML especifica a codificação de caracteres do documento, como UTF-8."},
    {"id": 218, "text": "Pergunta: O que é o atributo content em uma tag <meta> em HTML? Resposta: O atributo content em uma tag <meta> em HTML especifica o valor associado ao atributo, como o texto da descrição da página ou as palavras-chave."},
    {"id": 219, "text": "Pergunta: O que é o atributo name em uma tag <meta> em HTML? Resposta: O atributo name em uma tag <meta> em HTML especifica o nome do metadado, como 'description' para a descrição da página ou 'keywords' para palavras-chave."},
    {"id": 220, "text": "Pergunta: O que é o atributo http-equiv em uma tag <meta> em HTML? Resposta: O atributo http-equiv em uma tag <meta> em HTML é usado para fornecer informações equivalentes aos cabeçalhos HTTP, como 'refresh' para redirecionamentos ou 'content-type' para especificar o tipo de conteúdo."},
    {"id": 221, "text": "Pergunta: O que é o elemento <base> em HTML? Resposta: O elemento <base> em HTML é usado para especificar o URL base para todas as URLs relativas em uma página, como links e imagens."},
    {"id": 222, "text": "Pergunta: O que é o atributo href em uma tag <base> em HTML? Resposta: O atributo href em uma tag <base> em HTML especifica o URL base para URLs relativas na página."},
    {"id": 223, "text": "Pergunta: O que é o atributo target em uma tag <base> em HTML? Resposta: O atributo target em uma tag <base> em HTML especifica o destino padrão para links na página."},
    {"id": 224, "text": "Pergunta: O que é o elemento <link> em HTML? Resposta: O elemento <link> em HTML é usado para criar uma ligação entre o documento atual e outro recurso, como uma folha de estilo ou um ícone."},
    {"id": 225, "text": "Pergunta: O que é o atributo rel em uma tag <link> em HTML? Resposta: O atributo rel em uma tag <link> em HTML especifica o relacionamento entre o documento atual e o recurso vinculado, como 'stylesheet' para uma folha de estilo."},
    {"id": 226, "text": "Pergunta: O que é o atributo href em uma tag <link> em HTML? Resposta: O atributo href em uma tag <link> em HTML especifica o URL do recurso vinculado, como o URL de uma folha de estilo."},
    {"id": 227, "text": "Pergunta: O que é o atributo type em uma tag <link> em HTML? Resposta: O atributo type em uma tag <link> em HTML especifica o tipo MIME do recurso vinculado, como 'text/css' para uma folha de estilo CSS."},
    {"id": 228, "text": "Pergunta: O que é o elemento <style> em HTML? Resposta: O elemento <style> em HTML é usado para incluir estilos CSS diretamente na página, sem a necessidade de um arquivo externo."},
    {"id": 229, "text": "Pergunta: O que é o atributo media em uma tag <style> em HTML? Resposta: O atributo media em uma tag <style> em HTML especifica o tipo de dispositivo ou mídia para o qual os estilos CSS devem ser aplicados, como 'screen' para dispositivos de tela."},
    {"id": 230, "text": "Pergunta: O que é o elemento <script> em HTML? Resposta: O elemento <script> em HTML é usado para incluir scripts JavaScript diretamente na página ou para referenciar arquivos de script externos."},
    {"id": 231, "text": "Pergunta: O que é o atributo src em uma tag <script> em HTML? Resposta: O atributo src em uma tag <script> em HTML especifica o URL do arquivo de script externo ou inline."},
    {"id": 232, "text": "Pergunta: O que é o atributo type em uma tag <script> em HTML? Resposta: O atributo type em uma tag <script> em HTML especifica o tipo MIME do script, geralmente 'text/javascript' ou 'module' para scripts JavaScript."},
    {"id": 233, "text": "Pergunta: O que é o atributo defer em uma tag <script> em HTML? Resposta: O atributo defer em uma tag <script> em HTML especifica que o script será executado após o carregamento da página."},
    {"id": 234, "text": "Pergunta: O que é o atributo async em uma tag <script> em HTML? Resposta: O atributo async em uma tag <script> em HTML especifica que o script será baixado e executado de forma assíncrona, não bloqueando o carregamento da página."},
    {"id": 235, "text": "Pergunta: O que é o atributo crossorigin em uma tag <script> ou <link> em HTML? Resposta: O atributo crossorigin em uma tag <script> ou <link> em HTML especifica como o navegador deve lidar com solicitações de recursos de origens cruzadas, como fontes ou scripts de terceiros."},
    {"id": 236, "text": "Pergunta: O que é o atributo integrity em uma tag <script> ou <link> em HTML? Resposta: O atributo integrity em uma tag <script> ou <link> em HTML é usado para garantir que o recurso seja entregue sem modificações, verificando sua integridade com um hash criptográfico."},
    {"id": 237, "text": "Pergunta: O que é o elemento <noscript> em HTML? Resposta: O elemento <noscript> em HTML é usado para fornecer conteúdo alternativo que deve ser exibido quando o JavaScript está desativado no navegador do usuário."},
    {"id": 238, "text": "Pergunta: O que é o elemento <canvas> em HTML? Resposta: O elemento <canvas> em HTML é usado para desenhar gráficos, gráficos ou animações usando JavaScript."},
    {"id": 239, "text": "Pergunta: O que é o atributo width em uma tag <canvas> em HTML? Resposta: O atributo width em uma tag <canvas> em HTML especifica a largura da área de desenho do canvas, em pixels."},
    {"id": 240, "text": "Pergunta: O que é o atributo height em uma tag <canvas> em HTML? Resposta: O atributo height em uma tag <canvas> em HTML especifica a altura da área de desenho do canvas, em pixels."},
    {"id": 241, "text": "Pergunta: O que é o elemento <svg> em HTML? Resposta: O elemento <svg> em HTML é usado para desenhar gráficos vetoriais escaláveis usando XML, permitindo a criação de gráficos e animações complexas."},
    {"id": 242, "text": "Pergunta: O que é o atributo xmlns em uma tag <svg> em HTML? Resposta: O atributo xmlns em uma tag <svg> em HTML especifica o namespace XML do documento SVG."},
    {"id": 243, "text": "Pergunta: O que é o atributo viewBox em uma tag <svg> em HTML? Resposta: O atributo viewBox em uma tag <svg> em HTML define a caixa de visualização do SVG, especificando a posição e o dimensionamento do conteúdo dentro do elemento SVG."},
    {"id": 244, "text": "Pergunta: O que é o atributo fill em uma tag <svg> em HTML? Resposta: O atributo fill em uma tag <svg> em HTML especifica a cor de preenchimento do elemento SVG, como uma cor sólida, gradiente ou padrão."},
    {"id": 245, "text": "Pergunta: O que é o atributo stroke em uma tag <svg> em HTML? Resposta: O atributo stroke em uma tag <svg> em HTML especifica a cor da linha ou traçado ao desenhar o contorno de um elemento SVG."},
    {"id": 246, "text": "Pergunta: O que é o elemento <image> em HTML? Resposta: O elemento <image> em HTML é usado para exibir uma imagem dentro de um documento SVG."},
    {"id": 247, "text": "Pergunta: O que é o atributo xlink:href em uma tag <image> em HTML? Resposta: O atributo xlink:href em uma tag <image> em HTML especifica o URL da imagem a ser exibida."},
    {"id": 248, "text": "Pergunta: O que é o atributo x em uma tag <image> em HTML? Resposta: O atributo x em uma tag <image> em HTML especifica a posição horizontal da imagem dentro do documento SVG."},
    {"id": 249, "text": "Pergunta: O que é o atributo y em uma tag <image> em HTML? Resposta: O atributo y em uma tag <image> em HTML especifica a posição vertical da imagem dentro do documento SVG."},
    {"id": 250, "text": "Pergunta: O que é o elemento <path> em HTML? Resposta: O elemento <path> em HTML é usado para definir um caminho em um documento SVG, consistindo em linhas, curvas ou formas complexas."},
    {"id": 251, "text": "Pergunta: O que é o atributo d em uma tag <path> em HTML? Resposta: O atributo d em uma tag <path> em HTML especifica os comandos de desenho que definem o caminho."},
    {"id": 252, "text": "Pergunta: O que é o atributo fill em uma tag <path> em HTML? Resposta: O atributo fill em uma tag <path> em HTML especifica a cor de preenchimento do caminho."},
    {"id": 253, "text": "Pergunta: O que é o atributo stroke em uma tag <path> em HTML? Resposta: O atributo stroke em uma tag <path> em HTML especifica a cor da linha ou traçado ao desenhar o contorno do caminho."},
    {"id": 254, "text": "Pergunta: O que é o atributo stroke-width em uma tag <path> em HTML? Resposta: O atributo stroke-width em uma tag <path> em HTML especifica a largura da linha ao desenhar o contorno do caminho."},
    {"id": 255, "text": "Pergunta: O que é o elemento <polygon> em HTML? Resposta: O elemento <polygon> em HTML é usado para desenhar um polígono em um documento SVG, especificando uma série de pontos que definem os vértices do polígono."},
    {"id": 256, "text": "Pergunta: O que é o atributo points em uma tag <polygon> em HTML? Resposta: O atributo points em uma tag <polygon> em HTML especifica as coordenadas dos vértices do polígono, como pares de valores x e y separados por espaços."},
    {"id": 257, "text": "Pergunta: O que é o elemento <polyline> em HTML? Resposta: O elemento <polyline> em HTML é usado para desenhar uma série de segmentos de linha conectados em um documento SVG, especificando uma série de pontos que definem os vértices das linhas."},
    {"id": 258, "text": "Pergunta: O que é o atributo points em uma tag <polyline> em HTML? Resposta: O atributo points em uma tag <polyline> em HTML especifica as coordenadas dos vértices das linhas, como pares de valores x e y separados por espaços."},
    {"id": 259, "text": "Pergunta: O que é o elemento <circle> em HTML? Resposta: O elemento <circle> em HTML é usado para desenhar um círculo em um documento SVG, especificando o centro e o raio do círculo."},
    {"id": 260, "text": "Pergunta: O que é o atributo cx em uma tag <circle> em HTML? Resposta: O atributo cx em uma tag <circle> em HTML especifica a coordenada x do centro do círculo."},
    {"id": 261, "text": "Pergunta: O que é o atributo cy em uma tag <circle> em HTML? Resposta: O atributo cy em uma tag <circle> em HTML especifica a coordenada y do centro do círculo."},
    {"id": 262, "text": "Pergunta: O que é o atributo r em uma tag <circle> em HTML? Resposta: O atributo r em uma tag <circle> em HTML especifica o raio do círculo."},
    {"id": 263, "text": "Pergunta: O que é o elemento <ellipse> em HTML? Resposta: O elemento <ellipse> em HTML é usado para desenhar uma elipse em um documento SVG, especificando o centro, o raio horizontal e o raio vertical da elipse."},
    {"id": 264, "text": "Pergunta: O que é o atributo rx em uma tag <ellipse> em HTML? Resposta: O atributo rx em uma tag <ellipse> em HTML especifica o raio horizontal da elipse."},
    {"id": 265, "text": "Pergunta: O que é o atributo ry em uma tag <ellipse> em HTML? Resposta: O atributo ry em uma tag <ellipse> em HTML especifica o raio vertical da elipse."},
    {"id": 266, "text": "Pergunta: O que é o elemento <line> em HTML? Resposta: O elemento <line> em HTML é usado para desenhar uma linha em um documento SVG, especificando as coordenadas de início e fim da linha."},
    {"id": 267, "text": "Pergunta: O que é o atributo x1 em uma tag <line> em HTML? Resposta: O atributo x1 em uma tag <line> em HTML especifica a coordenada x do ponto de início da linha."},
    {"id": 268, "text": "Pergunta: O que é o atributo y1 em uma tag <line> em HTML? Resposta: O atributo y1 em uma tag <line> em HTML especifica a coordenada y do ponto de início da linha."},
    {"id": 269, "text": "Pergunta: O que é o atributo x2 em uma tag <line> em HTML? Resposta: O atributo x2 em uma tag <line> em HTML especifica a coordenada x do ponto final da linha."},
    {"id": 270, "text": "Pergunta: O que é o atributo y2 em uma tag <line> em HTML? Resposta: O atributo y2 em uma tag <line> em HTML especifica a coordenada y do ponto final da linha."},
    {"id": 271, "text": "Pergunta: O que é o elemento <text> em HTML? Resposta: O elemento <text> em HTML é usado para adicionar texto em um documento SVG, especificando as coordenadas onde o texto deve ser exibido."},
    {"id": 272, "text": "Pergunta: O que é o atributo x em uma tag <text> em HTML? Resposta: O atributo x em uma tag <text> em HTML especifica a coordenada x onde o texto deve ser posicionado."},
    {"id": 273, "text": "Pergunta: O que é o atributo y em uma tag <text> em HTML? Resposta: O atributo y em uma tag <text> em HTML especifica a coordenada y onde o texto deve ser posicionado."},
    {"id": 274, "text": "Pergunta: O que é o elemento <tspan> em HTML? Resposta: O elemento <tspan> em HTML é usado para agrupar e estilizar partes específicas de um texto em um documento SVG."},
    {"id": 275, "text": "Pergunta: O que é o atributo dx em uma tag <tspan> em HTML? Resposta: O atributo dx em uma tag <tspan> em HTML especifica um deslocamento horizontal para o texto contido."},
    {"id": 276, "text": "Pergunta: O que é o atributo dy em uma tag <tspan> em HTML? Resposta: O atributo dy em uma tag <tspan> em HTML especifica um deslocamento vertical para o texto contido."},
    {"id": 277, "text": "Pergunta: O que é o elemento <textPath> em HTML? Resposta: O elemento <textPath> em HTML é usado para alinhar um texto ao longo de um caminho definido em um documento SVG."},
    {"id": 278, "text": "Pergunta: O que é o atributo xlink:href em uma tag <textPath> em HTML? Resposta: O atributo xlink:href em uma tag <textPath> em HTML especifica o URL do caminho ao longo do qual o texto deve ser alinhado."},
    {"id": 279, "text": "Pergunta: O que é o elemento <pattern> em HTML? Resposta: O elemento <pattern> em HTML é usado para definir um padrão que pode ser usado para preencher áreas em um documento SVG."},
    {"id": 280, "text": "Pergunta: O que é o atributo viewBox em uma tag <pattern> em HTML? Resposta: O atributo viewBox em uma tag <pattern> em HTML especifica a caixa de visualização do padrão, controlando como o padrão é exibido e repetido."},
    {"id": 281, "text": "Pergunta: O que é o atributo patternUnits em uma tag <pattern> em HTML? Resposta: O atributo patternUnits em uma tag <pattern> em HTML especifica a unidade de medida utilizada para o padrão, como 'userSpaceOnUse' ou 'objectBoundingBox'."},
    {"id": 282, "text": "Pergunta: O que é o atributo patternContentUnits em uma tag <pattern> em HTML? Resposta: O atributo patternContentUnits em uma tag <pattern> em HTML especifica a unidade de medida utilizada para o conteúdo do padrão."},
    {"id": 283, "text": "Pergunta: O que é o elemento <defs> em HTML? Resposta: O elemento <defs> em HTML é usado para definir elementos que podem ser referenciados e usados posteriormente em um documento SVG."},
    {"id": 284, "text": "Pergunta: O que é o elemento <linearGradient> em HTML? Resposta: O elemento <linearGradient> em HTML é usado para definir um gradiente linear que pode ser usado para preencher áreas em um documento SVG."},
    {"id": 285, "text": "Pergunta: O que é o atributo x1 em uma tag <linearGradient> em HTML? Resposta: O atributo x1 em uma tag <linearGradient> em HTML especifica a coordenada x do primeiro ponto do gradiente."},
    {"id": 286, "text": "Pergunta: O que é o atributo y1 em uma tag <linearGradient> em HTML? Resposta: O atributo y1 em uma tag <linearGradient> em HTML especifica a coordenada y do primeiro ponto do gradiente."},
    {"id": 287, "text": "Pergunta: O que é o atributo x2 em uma tag <linearGradient> em HTML? Resposta: O atributo x2 em uma tag <linearGradient> em HTML especifica a coordenada x do segundo ponto do gradiente."},
    {"id": 288, "text": "Pergunta: O que é o atributo y2 em uma tag <linearGradient> em HTML? Resposta: O atributo y2 em uma tag <linearGradient> em HTML especifica a coordenada y do segundo ponto do gradiente."},
    {"id": 289, "text": "Pergunta: O que é o elemento <radialGradient> em HTML? Resposta: O elemento <radialGradient> em HTML é usado para definir um gradiente radial que pode ser usado para preencher áreas em um documento SVG."},
    {"id": 290, "text": "Pergunta: O que é o atributo cx em uma tag <radialGradient> em HTML? Resposta: O atributo cx em uma tag <radialGradient> em HTML especifica a coordenada x do centro do gradiente radial."},
    {"id": 291, "text": "Pergunta: O que é o atributo cy em uma tag <radialGradient> em HTML? Resposta: O atributo cy em uma tag <radialGradient> em HTML especifica a coordenada y do centro do gradiente radial."},
    {"id": 292, "text": "Pergunta: O que é o atributo r em uma tag <radialGradient> em HTML? Resposta: O atributo r em uma tag <radialGradient> em HTML especifica o raio do gradiente radial."},
    {"id": 293, "text": "Pergunta: O que é o atributo fx em uma tag <radialGradient> em HTML? Resposta: O atributo fx em uma tag <radialGradient> em HTML especifica a coordenada x da origem do foco do gradiente radial."},
    {"id": 294, "text": "Pergunta: O que é o atributo fy em uma tag <radialGradient> em HTML? Resposta: O atributo fy em uma tag <radialGradient> em HTML especifica a coordenada y da origem do foco do gradiente radial."},
    {"id": 295, "text": "Pergunta: O que é o atributo fr em uma tag <radialGradient> em HTML? Resposta: O atributo fr em uma tag <radialGradient> em HTML especifica a distância do foco ao centro do gradiente radial."},
    {"id": 296, "text": "Pergunta: O que é o elemento <stop> em HTML? Resposta: O elemento <stop> em HTML é usado para definir os pontos de parada em um gradiente linear ou radial."},
    {"id": 297, "text": "Pergunta: O que é o atributo offset em uma tag <stop> em HTML? Resposta: O atributo offset em uma tag <stop> em HTML especifica a posição ao longo do gradiente onde a parada de cor deve ser colocada."},
    {"id": 298, "text": "Pergunta: O que é o atributo stop-color em uma tag <stop> em HTML? Resposta: O atributo stop-color em uma tag <stop> em HTML especifica a cor da parada."},
    {"id": 299, "text": "Pergunta: O que é o atributo stop-opacity em uma tag <stop> em HTML? Resposta: O atributo stop-opacity em uma tag <stop> em HTML especifica a opacidade da parada de cor."},
    {"id": 300, "text": "Pergunta: O que é o elemento <filter> em HTML? Resposta: O elemento <filter> em HTML é usado para aplicar efeitos visuais, como desfoque ou sombra, a elementos gráficos em um documento SVG."},
    {"id": 301, "text": "Pergunta: O que é o atributo filterUnits em uma tag <filter> em HTML? Resposta: O atributo filterUnits em uma tag <filter> em HTML especifica a unidade de medida utilizada para o filtro, como 'userSpaceOnUse' ou 'objectBoundingBox'."},
    {"id": 302, "text": "Pergunta: O que é o atributo primitiveUnits em uma tag <filter> em HTML? Resposta: O atributo primitiveUnits em uma tag <filter> em HTML especifica a unidade de medida utilizada para os primitivos do filtro."},
    {"id": 303, "text": "Pergunta: O que é o elemento <feBlend> em HTML? Resposta: O elemento <feBlend> em HTML é usado para mesclar dois elementos gráficos usando modos de mistura como 'normal' ou 'multiply'."},
    {"id": 304, "text": "Pergunta: O que é o atributo mode em uma tag <feBlend> em HTML? Resposta: O atributo mode em uma tag <feBlend> em HTML especifica o modo de mistura a ser aplicado, como 'normal', 'multiply' ou 'screen'."},
    {"id": 305, "text": "Pergunta: O que é o elemento <feColorMatrix> em HTML? Resposta: O elemento <feColorMatrix> em HTML é usado para transformar as cores de um elemento gráfico em um documento SVG, aplicando operações de matriz de cor."},
    {"id": 306, "text": "Pergunta: O que é o atributo type em uma tag <feColorMatrix> em HTML? Resposta: O atributo type em uma tag <feColorMatrix> em HTML especifica o tipo de operação de matriz de cor a ser aplicada, como 'matrix' ou 'saturate'."},
    {"id": 307, "text": "Pergunta: O que é o atributo values em uma tag <feColorMatrix> em HTML? Resposta: O atributo values em uma tag <feColorMatrix> em HTML especifica os valores da matriz de cor a serem aplicados."},
    {"id": 308, "text": "Pergunta: O que é o elemento <feComponentTransfer> em HTML? Resposta: O elemento <feComponentTransfer> em HTML é usado para modificar os componentes de cor de um elemento gráfico em um documento SVG, como brilho ou contraste."},
    {"id": 309, "text": "Pergunta: O que é o elemento <feComposite> em HTML? Resposta: O elemento <feComposite> em HTML é usado para compor elementos gráficos em um documento SVG, aplicando operações de composição como 'over' ou 'in'."},
    {"id": 310, "text": "Pergunta: O que é o atributo operator em uma tag <feComposite> em HTML? Resposta: O atributo operator em uma tag <feComposite> em HTML especifica o tipo de operação de composição a ser aplicada, como 'over' ou 'in'."},
    {"id": 311, "text": "Pergunta: O que é o elemento <feConvolveMatrix> em HTML? Resposta: O elemento <feConvolveMatrix> em HTML é usado para aplicar uma operação de convolução a um elemento gráfico em um documento SVG, como desfoque ou detecção de bordas."},
    {"id": 312, "text": "Pergunta: O que é o atributo order em uma tag <feConvolveMatrix> em HTML? Resposta: O atributo order em uma tag <feConvolveMatrix> em HTML especifica o tamanho da matriz de convolução, controlando o número de valores a serem considerados em cada direção."},
    {"id": 313, "text": "Pergunta: O que é o atributo kernelMatrix em uma tag <feConvolveMatrix> em HTML? Resposta: O atributo kernelMatrix em uma tag <feConvolveMatrix> em HTML especifica a matriz de convolução a ser aplicada."},
    {"id": 314, "text": "Pergunta: O que é o atributo edgeMode em uma tag <feConvolveMatrix> em HTML? Resposta: O atributo edgeMode em uma tag <feConvolveMatrix> em HTML especifica como lidar com pixels fora do tamanho da matriz de convolução."},
    {"id": 315, "text": "Pergunta: O que é o elemento <feDiffuseLighting> em HTML? Resposta: O elemento <feDiffuseLighting> em HTML é usado para simular iluminação difusa em um elemento gráfico em um documento SVG, como a luz de uma fonte."},
    {"id": 316, "text": "Pergunta: O que é o atributo surfaceScale em uma tag <feDiffuseLighting> em HTML? Resposta: O atributo surfaceScale em uma tag <feDiffuseLighting> em HTML especifica a quantidade de difusão a ser aplicada ao elemento gráfico."},
    {"id": 317, "text": "Pergunta: O que é o atributo diffuseConstant em uma tag <feDiffuseLighting> em HTML? Resposta: O atributo diffuseConstant em uma tag <feDiffuseLighting> em HTML especifica a constante de difusão a ser aplicada ao elemento gráfico."},
    {"id": 318, "text": "Pergunta: O que é o elemento <feDisplacementMap> em HTML? Resposta: O elemento <feDisplacementMap> em HTML é usado para distorcer elementos gráficos em um documento SVG com base em valores de mapa de deslocamento."},
    {"id": 319, "text": "Pergunta: O que é o atributo scale em uma tag <feDisplacementMap> em HTML? Resposta: O atributo scale em uma tag <feDisplacementMap> em HTML especifica a escala do efeito de deslocamento."},
    {"id": 320, "text": "Pergunta: O que é o atributo xChannelSelector em uma tag <feDisplacementMap> em HTML? Resposta: O atributo xChannelSelector em uma tag <feDisplacementMap> em HTML especifica a forma como o canal x do mapa de deslocamento deve ser interpretado."},
    {"id": 321, "text": "Pergunta: O que é o atributo yChannelSelector em uma tag <feDisplacementMap> em HTML? Resposta: O atributo yChannelSelector em uma tag <feDisplacementMap> em HTML especifica a forma como o canal y do mapa de deslocamento deve ser interpretado."},
    {"id": 322, "text": "Pergunta: O que é o elemento <feDistantLight> em HTML? Resposta: O elemento <feDistantLight> em HTML é usado para simular uma fonte de luz distante em um elemento gráfico em um documento SVG."},
    {"id": 323, "text": "Pergunta: O que é o atributo azimuth em uma tag <feDistantLight> em HTML? Resposta: O atributo azimuth em uma tag <feDistantLight> em HTML especifica a direção da luz, medida em graus a partir do eixo x."},
    {"id": 324, "text": "Pergunta: O que é o atributo elevation em uma tag <feDistantLight> em HTML? Resposta: O atributo elevation em uma tag <feDistantLight> em HTML especifica a inclinação da luz em relação à superfície, medida em graus a partir do plano xy."},
    {"id": 325, "text": "Pergunta: O que é o elemento <feFlood> em HTML? Resposta: O elemento <feFlood> em HTML é usado para preencher uma área com uma cor sólida em um documento SVG."},
    {"id": 326, "text": "Pergunta: O que é o atributo flood-color em uma tag <feFlood> em HTML? Resposta: O atributo flood-color em uma tag <feFlood> em HTML especifica a cor utilizada para preencher a área."},
    {"id": 327, "text": "Pergunta: O que é o atributo flood-opacity em uma tag <feFlood> em HTML? Resposta: O atributo flood-opacity em uma tag <feFlood> em HTML especifica a opacidade da cor utilizada para preencher a área."},
    {"id": 328, "text": "Pergunta: O que é o elemento <feGaussianBlur> em HTML? Resposta: O elemento <feGaussianBlur> em HTML é usado para aplicar um desfoque gaussiano a um elemento gráfico em um documento SVG."},
    {"id": 329, "text": "Pergunta: O que é o atributo stdDeviation em uma tag <feGaussianBlur> em HTML? Resposta: O atributo stdDeviation em uma tag <feGaussianBlur> em HTML especifica o desvio padrão do desfoque gaussiano."},
    {"id": 330, "text": "Pergunta: O que é o elemento <feImage> em HTML? Resposta: O elemento <feImage> em HTML é usado para incluir uma imagem em um documento SVG."},
    {"id": 331, "text": "Pergunta: O que é o atributo href em uma tag <feImage> em HTML? Resposta: O atributo href em uma tag <feImage> em HTML especifica o URL da imagem a ser incluída."},
    {"id": 332, "text": "Pergunta: O que é o elemento <feMerge> em HTML? Resposta: O elemento <feMerge> em HTML é usado para combinar vários elementos gráficos em um documento SVG."},
    {"id": 333, "text": "Pergunta: O que é o elemento <feMergeNode> em HTML? Resposta: O elemento <feMergeNode> em HTML é usado para especificar os elementos gráficos a serem mesclados dentro de um elemento <feMerge>."},
    {"id": 334, "text": "Pergunta: O que é o elemento <feMorphology> em HTML? Resposta: O elemento <feMorphology> em HTML é usado para realizar operações morfológicas, como dilatação ou erosão, em elementos gráficos em um documento SVG."},
    {"id": 335, "text": "Pergunta: O que é o atributo operator em uma tag <feMorphology> em HTML? Resposta: O atributo operator em uma tag <feMorphology> em HTML especifica o tipo de operação morfológica a ser aplicada, como 'erode' ou 'dilate'."},
    {"id": 336, "text": "Pergunta: O que é o atributo radius em uma tag <feMorphology> em HTML? Resposta: O atributo radius em uma tag <feMorphology> em HTML especifica o tamanho do raio da operação morfológica."},
    {"id": 337, "text": "Pergunta: O que é o elemento <feOffset> em HTML? Resposta: O elemento <feOffset> em HTML é usado para deslocar um elemento gráfico em um documento SVG."},
    {"id": 338, "text": "Pergunta: O que é o atributo dx em uma tag <feOffset> em HTML? Resposta: O atributo dx em uma tag <feOffset> em HTML especifica o deslocamento horizontal do elemento gráfico."},
    {"id": 339, "text": "Pergunta: O que é o atributo dy em uma tag <feOffset> em HTML? Resposta: O atributo dy em uma tag <feOffset> em HTML especifica o deslocamento vertical do elemento gráfico."},
    {"id": 340, "text": "Pergunta: O que é o elemento <feSpecularLighting> em HTML? Resposta: O elemento <feSpecularLighting> em HTML é usado para simular iluminação especular em um elemento gráfico em um documento SVG."},
    {"id": 341, "text": "Pergunta: O que é o atributo specularConstant em uma tag <feSpecularLighting> em HTML? Resposta: O atributo specularConstant em uma tag <feSpecularLighting> em HTML especifica a constante especular a ser aplicada."},
    {"id": 342, "text": "Pergunta: O que é o atributo specularExponent em uma tag <feSpecularLighting> em HTML? Resposta: O atributo specularExponent em uma tag <feSpecularLighting> em HTML especifica o expoente especular a ser aplicado."},
    {"id": 343, "text": "Pergunta: O que é o elemento <feTile> em HTML? Resposta: O elemento <feTile> em HTML é usado para replicar um padrão de imagem em um documento SVG, preenchendo uma área com cópias da imagem."},
    {"id": 344, "text": "Pergunta: O que é o elemento <feTurbulence> em HTML? Resposta: O elemento <feTurbulence> em HTML é usado para criar texturas de ruído ou padrões de turbulência em um documento SVG."},
    {"id": 345, "text": "Pergunta: O que é o atributo baseFrequency em uma tag <feTurbulence> em HTML? Resposta: O atributo baseFrequency em uma tag <feTurbulence> em HTML especifica a frequência base da turbulência."},
    {"id": 346, "text": "Pergunta: O que é o atributo numOctaves em uma tag <feTurbulence> em HTML? Resposta: O atributo numOctaves em uma tag <feTurbulence> em HTML especifica o número de oitavas de turbulência a serem aplicadas."},
    {"id": 347, "text": "Pergunta: O que é o atributo seed em uma tag <feTurbulence> em HTML? Resposta: O atributo seed em uma tag <feTurbulence> em HTML especifica a semente inicial para a geração de ruído ou padrões de turbulência."},
    {"id": 348, "text": "Pergunta: O que é o elemento <foreignObject> em HTML? Resposta: O elemento <foreignObject> em HTML é usado para incluir conteúdo HTML arbitrário dentro de um documento SVG."},
    {"id": 349, "text": "Pergunta: Qual é a finalidade do atributo x em uma tag <foreignObject> em HTML? Resposta: O atributo x em uma tag <foreignObject> em HTML especifica a posição x do elemento no sistema de coordenadas do documento SVG."},
    {"id": 350, "text": "Pergunta: Qual é a finalidade do atributo y em uma tag <foreignObject> em HTML? Resposta: O atributo y em uma tag <foreignObject> em HTML especifica a posição y do elemento no sistema de coordenadas do documento SVG."},
    {"id": 351, "text": "Pergunta: Qual é a finalidade do atributo width em uma tag <foreignObject> em HTML? Resposta: O atributo width em uma tag <foreignObject> em HTML especifica a largura do elemento."},
    {"id": 352, "text": "Pergunta: Qual é a finalidade do atributo height em uma tag <foreignObject> em HTML? Resposta: O atributo height em uma tag <foreignObject> em HTML especifica a altura do elemento."},
    {"id": 353, "text": "Pergunta: O que é o elemento <annotation> em HTML? Resposta: O elemento <annotation> em HTML é usado para fornecer informações adicionais sobre um elemento em um documento SVG."},
    {"id": 354, "text": "Pergunta: Qual é a finalidade do atributo encoding em uma tag <annotation> em HTML? Resposta: O atributo encoding em uma tag <annotation> em HTML especifica o esquema de codificação para o conteúdo da anotação."},
    {"id": 355, "text": "Pergunta: O que é o elemento <desc> em HTML? Resposta: O elemento <desc> em HTML é usado para fornecer uma descrição textual de um elemento em um documento SVG."},
    {"id": 356, "text": "Pergunta: Qual é a finalidade do elemento <title> em HTML? Resposta: O elemento <title> em HTML é usado para fornecer um título para um elemento em um documento SVG."},
    {"id": 357, "text": "Pergunta: O que é o elemento <metadata> em HTML? Resposta: O elemento <metadata> em HTML é usado para incluir metadados adicionais em um documento SVG, como informações sobre o autor ou a data de criação."},
    {"id": 358, "text": "Pergunta: Qual é a finalidade do atributo viewBox em uma tag <svg> em HTML? Resposta: O atributo viewBox em uma tag <svg> em HTML especifica a caixa de visualização do documento SVG, controlando como o conteúdo é exibido e dimensionado."},
    {"id": 359, "text": "Pergunta: Qual é a finalidade do atributo preserveAspectRatio em uma tag <svg> em HTML? Resposta: O atributo preserveAspectRatio em uma tag <svg> em HTML especifica como o aspecto do conteúdo do documento SVG deve ser preservado durante o dimensionamento."},
    {"id": 360, "text": "Pergunta: O que é SVG em HTML? Resposta: SVG (Scalable Vector Graphics) em HTML é uma linguagem de marcação baseada em XML para descrever gráficos vetoriais bidimensionais."},
    {"id": 361, "text": "Pergunta: Qual é a principal vantagem de usar SVG em comparação com imagens rasterizadas? Resposta: A principal vantagem de usar SVG é que os gráficos podem ser dimensionados indefinidamente sem perder qualidade, já que são baseados em vetores."},
    {"id": 362, "text": "Pergunta: Quais são algumas das características do SVG? Resposta: Algumas características do SVG incluem suporte a formas geométricas, texto, gradientes, efeitos, animações e interatividade."},
    {"id": 363, "text": "Pergunta: Como o SVG é incluído em documentos HTML? Resposta: O SVG pode ser incluído em documentos HTML usando a tag <svg>."},
    {"id": 364, "text": "Pergunta: Quais são algumas das formas geométricas que podem ser criadas com SVG? Resposta: Algumas das formas geométricas que podem ser criadas com SVG incluem retângulos, círculos, elipses, linhas, polígonos e polilinhas."},
    {"id": 365, "text": "Pergunta: Como os elementos SVG podem ser estilizados? Resposta: Os elementos SVG podem ser estilizados usando CSS ou atributos de estilo diretamente nos elementos."},
    {"id": 366, "text": "Pergunta: O que é uma máscara em SVG? Resposta: Uma máscara em SVG é usada para ocultar ou revelar partes de um elemento usando um padrão definido."},
    {"id": 367, "text": "Pergunta: Como as animações são criadas em SVG? Resposta: As animações em SVG podem ser criadas usando a tag <animate> ou utilizando CSS."},
    {"id": 368, "text": "Pergunta: Quais são os benefícios de usar SVG para gráficos na web? Resposta: Alguns benefícios de usar SVG incluem escalabilidade, acessibilidade, SEO aprimorado e menor tamanho de arquivo em comparação com imagens rasterizadas."},
    {"id": 369, "text": "Pergunta: O que são gráficos vetoriais? Resposta: Gráficos vetoriais são representações de imagens baseadas em vetores matemáticos, que permitem escalonamento sem perda de qualidade."},
    {"id": 370, "text": "Pergunta: Quais são as principais desvantagens do uso de SVG? Resposta: Algumas desvantagens do uso de SVG incluem suporte limitado em navegadores mais antigos e a complexidade de criação e edição de gráficos vetoriais."},
    {"id": 371, "text": "Pergunta: O que é o elemento <use> em SVG? Resposta: O elemento <use> em SVG é usado para reutilizar elementos gráficos definidos em outro lugar no documento."},
    {"id": 372, "text": "Pergunta: Qual é a finalidade do atributo xlink:href em uma tag <use> em SVG? Resposta: O atributo xlink:href em uma tag <use> em SVG especifica o URI do elemento a ser referenciado e usado."},
    {"id": 373, "text": "Pergunta: O que é o elemento <animate> em SVG? Resposta: O elemento <animate> em SVG é usado para animar atributos de elementos gráficos ao longo do tempo."},
    {"id": 374, "text": "Pergunta: Qual é a finalidade do atributo attributeName em uma tag <animate> em SVG? Resposta: O atributo attributeName em uma tag <animate> em SVG especifica o nome do atributo que será animado."},
    {"id": 375, "text": "Pergunta: Qual é a finalidade do atributo values em uma tag <animate> em SVG? Resposta: O atributo values em uma tag <animate> em SVG especifica uma lista de valores para a animação percorrer."},
    {"id": 376, "text": "Pergunta: Qual é a finalidade do atributo dur em uma tag <animate> em SVG? Resposta: O atributo dur em uma tag <animate> em SVG especifica a duração da animação."},
    {"id": 377, "text": "Pergunta: Qual é a finalidade do atributo repeatCount em uma tag <animate> em SVG? Resposta: O atributo repeatCount em uma tag <animate> em SVG especifica quantas vezes a animação deve ser repetida."},
    {"id": 378, "text": "Pergunta: O que é o elemento <filter> em SVG? Resposta: O elemento <filter> em SVG é usado para aplicar efeitos de imagem, como desfoque ou sombra, a elementos gráficos."},
    {"id": 379, "text": "Pergunta: Qual é a finalidade do atributo filter em uma tag <filter> em SVG? Resposta: O atributo filter em uma tag <filter> em SVG especifica a lista de operações de filtragem a serem aplicadas."},
    {"id": 380, "text": "Pergunta: O que é o elemento <foreignObject> em SVG? Resposta: O elemento <foreignObject> em SVG é usado para incluir conteúdo HTML arbitrário dentro de um documento SVG."},
    {"id": 381, "text": "Pergunta: Qual é a finalidade do atributo x em uma tag <foreignObject> em SVG? Resposta: O atributo x em uma tag <foreignObject> em SVG especifica a posição x do elemento no sistema de coordenadas do documento SVG."},
    {"id": 382, "text": "Pergunta: Qual é a finalidade do atributo y em uma tag <foreignObject> em SVG? Resposta: O atributo y em uma tag <foreignObject> em SVG especifica a posição y do elemento no sistema de coordenadas do documento SVG."},
    {"id": 383, "text": "Pergunta: Qual é a finalidade do atributo width em uma tag <foreignObject> em SVG? Resposta: O atributo width em uma tag <foreignObject> em SVG especifica a largura do elemento."},
    {"id": 384, "text": "Pergunta: Qual é a finalidade do atributo height em uma tag <foreignObject> em SVG? Resposta: O atributo height em uma tag <foreignObject> em SVG especifica a altura do elemento."},
    {"id": 385, "text": "Pergunta: O que é o elemento <mask> em SVG? Resposta: O elemento <mask> em SVG é usado para ocultar ou revelar partes de um elemento usando um padrão definido."},
    {"id": 386, "text": "Pergunta: Qual é a finalidade do atributo mask em uma tag <mask> em SVG? Resposta: O atributo mask em uma tag <mask> em SVG especifica o elemento ou padrão a ser usado como máscara."},
    {"id": 387, "text": "Pergunta: O que é o elemento <pattern> em SVG? Resposta: O elemento <pattern> em SVG é usado para definir um padrão que pode ser usado para preencher formas ou outros elementos."},
    {"id": 388, "text": "Pergunta: Qual é a finalidade do atributo patternUnits em uma tag <pattern> em SVG? Resposta: O atributo patternUnits em uma tag <pattern> em SVG especifica a unidade de medida utilizada para o padrão, como 'userSpaceOnUse' ou 'objectBoundingBox'."},
    {"id": 389, "text": "Pergunta: Qual é a finalidade do atributo patternContentUnits em uma tag <pattern> em SVG? Resposta: O atributo patternContentUnits em uma tag <pattern> em SVG especifica a unidade de medida utilizada para o conteúdo do padrão."},
    {"id": 390, "text": "Pergunta: O que é o elemento <linearGradient> em SVG? Resposta: O elemento <linearGradient> em SVG é usado para definir um gradiente linear que pode ser usado para preencher áreas."},
    {"id": 391, "text": "Pergunta: Qual é a finalidade do atributo x1 em uma tag <linearGradient> em SVG? Resposta: O atributo x1 em uma tag <linearGradient> em SVG especifica a coordenada x do primeiro ponto do gradiente."},
    {"id": 392, "text": "Pergunta: Qual é a finalidade do atributo y1 em uma tag <linearGradient> em SVG? Resposta: O atributo y1 em uma tag <linearGradient> em SVG especifica a coordenada y do primeiro ponto do gradiente."},
    {"id": 393, "text": "Pergunta: Qual é a finalidade do atributo x2 em uma tag <linearGradient> em SVG? Resposta: O atributo x2 em uma tag <linearGradient> em SVG especifica a coordenada x do segundo ponto do gradiente."},
    {"id": 394, "text": "Pergunta: Qual é a finalidade do atributo y2 em uma tag <linearGradient> em SVG? Resposta: O atributo y2 em uma tag <linearGradient> em SVG especifica a coordenada y do segundo ponto do gradiente."},
    {"id": 395, "text": "Pergunta: O que é o elemento <radialGradient> em SVG? Resposta: O elemento <radialGradient> em SVG é usado para definir um gradiente radial que pode ser usado para preencher áreas."},
    {"id": 396, "text": "Pergunta: Qual é a finalidade do atributo cx em uma tag <radialGradient> em SVG? Resposta: O atributo cx em uma tag <radialGradient> em SVG especifica a coordenada x do centro do círculo que define o gradiente radial."},
    {"id": 397, "text": "Pergunta: Qual é a finalidade do atributo cy em uma tag <radialGradient> em SVG? Resposta: O atributo cy em uma tag <radialGradient> em SVG especifica a coordenada y do centro do círculo que define o gradiente radial."},
    {"id": 398, "text": "Pergunta: Qual é a finalidade do atributo r em uma tag <radialGradient> em SVG? Resposta: O atributo r em uma tag <radialGradient> em SVG especifica o raio do círculo que define o gradiente radial."},
    {"id": 399, "text": "Pergunta: Qual é a finalidade do atributo fx em uma tag <radialGradient> em SVG? Resposta: O atributo fx em uma tag <radialGradient> em SVG especifica a coordenada x do ponto focal do gradiente radial."},
    {"id": 400, "text": "Pergunta: Qual é a finalidade do atributo fy em uma tag <radialGradient> em SVG? Resposta: O atributo fy em uma tag <radialGradient> em SVG especifica a coordenada y do ponto focal do gradiente radial."},
    {"id": 401, "text": "Pergunta: O que é o elemento <stop> em SVG? Resposta: O elemento <stop> em SVG é usado dentro de gradientes para definir pontos de cor ao longo do gradiente."},
    {"id": 402, "text": "Pergunta: Qual é a finalidade do atributo offset em uma tag <stop> em SVG? Resposta: O atributo offset em uma tag <stop> em SVG especifica a posição do ponto de cor ao longo do gradiente."},
    {"id": 403, "text": "Pergunta: Qual é a finalidade do atributo stop-color em uma tag <stop> em SVG? Resposta: O atributo stop-color em uma tag <stop> em SVG especifica a cor do ponto de cor no gradiente."},
    {"id": 404, "text": "Pergunta: Qual é a finalidade do atributo stop-opacity em uma tag <stop> em SVG? Resposta: O atributo stop-opacity em uma tag <stop> em SVG especifica a opacidade do ponto de cor no gradiente."},
    {"id": 405, "text": "Pergunta: O que é o elemento <clipPath> em SVG? Resposta: O elemento <clipPath> em SVG é usado para definir uma região de recorte que limita a renderização de elementos gráficos."},
    {"id": 406, "text": "Pergunta: Qual é a finalidade do atributo clip-path em uma tag <clipPath> em SVG? Resposta: O atributo clip-path em uma tag <clipPath> em SVG especifica a forma da região de recorte."},
    {"id": 407, "text": "Pergunta: O que é o elemento <defs> em SVG? Resposta: O elemento <defs> em SVG é usado para definir elementos gráficos que podem ser referenciados posteriormente no documento."},
    {"id": 408, "text": "Pergunta: Qual é a finalidade do elemento <symbol> em SVG? Resposta: O elemento <symbol> em SVG é usado para definir gráficos que podem ser reutilizados em diferentes partes de um documento."},
    {"id": 409, "text": "Pergunta: O que é o elemento <use> em SVG? Resposta: O elemento <use> em SVG é usado para instanciar um símbolo definido anteriormente."},
    {"id": 410, "text": "Pergunta: Qual é a finalidade do atributo xlink:href em uma tag <use> em SVG? Resposta: O atributo xlink:href em uma tag <use> em SVG especifica o URI do elemento a ser referenciado e usado."},
    {"id": 411, "text": "Pergunta: O que é o elemento <view> em SVG? Resposta: O elemento <view> em SVG é usado para definir uma área de visualização dentro de um documento SVG."},
    {"id": 412, "text": "Pergunta: Qual é a finalidade do atributo viewBox em uma tag <view> em SVG? Resposta: O atributo viewBox em uma tag <view> em SVG especifica a caixa de visualização do documento SVG."},
    {"id": 413, "text": "Pergunta: Qual é a finalidade do atributo preserveAspectRatio em uma tag <view> em SVG? Resposta: O atributo preserveAspectRatio em uma tag <view> em SVG especifica como o aspecto do conteúdo do documento SVG deve ser preservado durante o dimensionamento."},
    {"id": 414, "text": "Pergunta: O que é o elemento <animate> em SVG? Resposta: O elemento <animate> em SVG é usado para animar atributos de elementos gráficos ao longo do tempo."},
    {"id": 415, "text": "Pergunta: Qual é a finalidade do atributo attributeName em uma tag <animate> em SVG? Resposta: O atributo attributeName em uma tag <animate> em SVG especifica o nome do atributo que será animado."},
    {"id": 416, "text": "Pergunta: Qual é a finalidade do atributo values em uma tag <animate> em SVG? Resposta: O atributo values em uma tag <animate> em SVG especifica uma lista de valores para a animação percorrer."},
    {"id": 417, "text": "Pergunta: Qual é a finalidade do atributo dur em uma tag <animate> em SVG? Resposta: O atributo dur em uma tag <animate> em SVG especifica a duração da animação."},
    {"id": 418, "text": "Pergunta: Qual é a finalidade do atributo repeatCount em uma tag <animate> em SVG? Resposta: O atributo repeatCount em uma tag <animate> em SVG especifica quantas vezes a animação deve ser repetida."},
    {"id": 419, "text": "Pergunta: O que é o elemento <filter> em SVG? Resposta: O elemento <filter> em SVG é usado para aplicar efeitos de imagem, como desfoque ou sombra, a elementos gráficos."},
    {"id": 420, "text": "Pergunta: Qual é a finalidade do atributo filter em uma tag <filter> em SVG? Resposta: O atributo filter em uma tag <filter> em SVG especifica a lista de operações de filtragem a serem aplicadas."},
    {"id": 421, "text": "Pergunta: O que é o elemento <feBlend> em SVG? Resposta: O elemento <feBlend> em SVG é usado para combinar dois elementos gráficos usando um modo de mesclagem especificado."},
    {"id": 422, "text": "Pergunta: Qual é a finalidade do atributo mode em uma tag <feBlend> em SVG? Resposta: O atributo mode em uma tag <feBlend> em SVG especifica o modo de mesclagem a ser aplicado, como 'normal', 'multiply', 'screen', entre outros."},
    {"id": 423, "text": "Pergunta: O que é o elemento <feColorMatrix> em SVG? Resposta: O elemento <feColorMatrix> em SVG é usado para aplicar transformações de cor a elementos gráficos."},
    {"id": 424, "text": "Pergunta: Qual é a finalidade do atributo type em uma tag <feColorMatrix> em SVG? Resposta: O atributo type em uma tag <feColorMatrix> em SVG especifica o tipo de matriz de cor a ser aplicada, como 'matrix', 'saturate', entre outros."},
    {"id": 425, "text": "Pergunta: O que é o elemento <feComponentTransfer> em SVG? Resposta: O elemento <feComponentTransfer> em SVG é usado para aplicar transferências de componente, como curvas de gama ou ajustes de contraste, a elementos gráficos."},
    {"id": 426, "text": "Pergunta: Qual é a finalidade do atributo result em uma tag <feComponentTransfer> em SVG? Resposta: O atributo result em uma tag <feComponentTransfer> em SVG especifica o nome do resultado da operação."},
    {"id": 427, "text": "Pergunta: O que é o elemento <feComposite> em SVG? Resposta: O elemento <feComposite> em SVG é usado para combinar dois elementos gráficos usando uma operação de composição, como 'over', 'in', 'out', entre outros."},
    {"id": 428, "text": "Pergunta: Qual é a finalidade do atributo operator em uma tag <feComposite> em SVG? Resposta: O atributo operator em uma tag <feComposite> em SVG especifica o tipo de operação de composição a ser aplicada."},
    {"id": 429, "text": "Pergunta: O que é o elemento <feConvolveMatrix> em SVG? Resposta: O elemento <feConvolveMatrix> em SVG é usado para aplicar transformações de convolução, como desfoque ou detecção de bordas, a elementos gráficos."},
    {"id": 430, "text": "Pergunta: Qual é a finalidade do atributo kernelMatrix em uma tag <feConvolveMatrix> em SVG? Resposta: O atributo kernelMatrix em uma tag <feConvolveMatrix> em SVG especifica a matriz de convolução a ser aplicada."},
    {"id": 431, "text": "Pergunta: O que é o elemento <feDiffuseLighting> em SVG? Resposta: O elemento <feDiffuseLighting> em SVG é usado para simular iluminação difusa em elementos gráficos."},
    {"id": 432, "text": "Pergunta: Qual é a finalidade do atributo surfaceScale em uma tag <feDiffuseLighting> em SVG? Resposta: O atributo surfaceScale em uma tag <feDiffuseLighting> em SVG especifica a escala da superfície para cálculos de iluminação."},
    {"id": 433, "text": "Pergunta: O que é o elemento <feDisplacementMap> em SVG? Resposta: O elemento <feDisplacementMap> em SVG é usado para deslocar pixels de acordo com um mapa de deslocamento."},
    {"id": 434, "text": "Pergunta: Qual é a finalidade do atributo in2 em uma tag <feDisplacementMap> em SVG? Resposta: O atributo in2 em uma tag <feDisplacementMap> em SVG especifica o segundo elemento de entrada."},
    {"id": 435, "text": "Pergunta: O que é o elemento <feDropShadow> em SVG? Resposta: O elemento <feDropShadow> em SVG é usado para aplicar sombras a elementos gráficos."},
    {"id": 436, "text": "Pergunta: Qual é a finalidade do atributo dx em uma tag <feDropShadow> em SVG? Resposta: O atributo dx em uma tag <feDropShadow> em SVG especifica o deslocamento horizontal da sombra."},
    {"id": 437, "text": "Pergunta: Qual é a finalidade do atributo dy em uma tag <feDropShadow> em SVG? Resposta: O atributo dy em uma tag <feDropShadow> em SVG especifica o deslocamento vertical da sombra."},
    {"id": 438, "text": "Pergunta: Qual é a finalidade do atributo stdDeviation em uma tag <feDropShadow> em SVG? Resposta: O atributo stdDeviation em uma tag <feDropShadow> em SVG especifica o desvio padrão do desfoque da sombra."},
    {"id": 439, "text": "Pergunta: O que é o elemento <feFlood> em SVG? Resposta: O elemento <feFlood> em SVG é usado para preencher uma área com uma cor sólida."},
    {"id": 440, "text": "Pergunta: Qual é a finalidade do atributo flood-color em uma tag <feFlood> em SVG? Resposta: O atributo flood-color em uma tag <feFlood> em SVG especifica a cor usada para preencher a área."},
    {"id": 441, "text": "Pergunta: Qual é a finalidade do atributo flood-opacity em uma tag <feFlood> em SVG? Resposta: O atributo flood-opacity em uma tag <feFlood> em SVG especifica a opacidade da cor usada para preencher a área."},
    {"id": 442, "text": "Pergunta: O que é o elemento <feGaussianBlur> em SVG? Resposta: O elemento <feGaussianBlur> em SVG é usado para aplicar um desfoque gaussiano a elementos gráficos."},
    {"id": 443, "text": "Pergunta: Qual é a finalidade do atributo stdDeviation em uma tag <feGaussianBlur> em SVG? Resposta: O atributo stdDeviation em uma tag <feGaussianBlur> em SVG especifica o desvio padrão do desfoque gaussiano."},
    {"id": 444, "text": "Pergunta: O que é o elemento <feImage> em SVG? Resposta: O elemento <feImage> em SVG é usado para incluir uma imagem rasterizada dentro de um documento SVG."},
    {"id": 445, "text": "Pergunta: Qual é a finalidade do atributo xlink:href em uma tag <feImage> em SVG? Resposta: O atributo xlink:href em uma tag <feImage> em SVG especifica o URI da imagem a ser incluída."},
    {"id": 446, "text": "Pergunta: O que é o elemento <feMerge> em SVG? Resposta: O elemento <feMerge> em SVG é usado para mesclar várias camadas de elementos gráficos em uma única imagem."},
    {"id": 447, "text": "Pergunta: O que é o elemento <feMergeNode> em SVG? Resposta: O elemento <feMergeNode> em SVG é usado para indicar quais elementos gráficos devem ser mesclados em uma operação de mesclagem."},
    {"id": 448, "text": "Pergunta: O que é o elemento <feMorphology> em SVG? Resposta: O elemento <feMorphology> em SVG é usado para realizar operações morfológicas em elementos gráficos, como dilatação ou erosão."},
    {"id": 449, "text": "Pergunta: Qual é a finalidade do atributo operator em uma tag <feMorphology> em SVG? Resposta: O atributo operator em uma tag <feMorphology> em SVG especifica o tipo de operação morfológica a ser aplicada."},
    {"id": 450, "text": "Pergunta: O que é o elemento <feOffset> em SVG? Resposta: O elemento <feOffset> em SVG é usado para deslocar um elemento gráfico em relação à sua posição original."},
    {"id": 451, "text": "Pergunta: Qual é a finalidade do atributo dx em uma tag <feOffset> em SVG? Resposta: O atributo dx em uma tag <feOffset> em SVG especifica o deslocamento horizontal."},
    {"id": 452, "text": "Pergunta: Qual é a finalidade do atributo dy em uma tag <feOffset> em SVG? Resposta: O atributo dy em uma tag <feOffset> em SVG especifica o deslocamento vertical."},
    {"id": 453, "text": "Pergunta: O que é o elemento <feSpecularLighting> em SVG? Resposta: O elemento <feSpecularLighting> em SVG é usado para simular iluminação especular em elementos gráficos."},
    {"id": 454, "text": "Pergunta: Qual é a finalidade do atributo specularConstant em uma tag <feSpecularLighting> em SVG? Resposta: O atributo specularConstant em uma tag <feSpecularLighting> em SVG especifica a constante especular."},
    {"id": 455, "text": "Pergunta: Qual é a finalidade do atributo specularExponent em uma tag <feSpecularLighting> em SVG? Resposta: O atributo specularExponent em uma tag <feSpecularLighting> em SVG especifica o expoente especular."},
    {"id": 456, "text": "Pergunta: Qual é a finalidade do atributo limitingConeAngle em uma tag <feSpecularLighting> em SVG? Resposta: O atributo limitingConeAngle em uma tag <feSpecularLighting> em SVG especifica o ângulo de cone de limite."},
    {"id": 457, "text": "Pergunta: O que é o elemento <feTile> em SVG? Resposta: O elemento <feTile> em SVG é usado para preencher uma área com uma imagem repetida."},
    {"id": 458, "text": "Pergunta: Qual é a finalidade do atributo result em uma tag <feTile> em SVG? Resposta: O atributo result em uma tag <feTile> em SVG especifica o nome do resultado da operação."},
    {"id": 459, "text": "Pergunta: O que é o elemento <feTurbulence> em SVG? Resposta: O elemento <feTurbulence> em SVG é usado para gerar texturas procedurais, como nuvens ou fumaça."},
    {"id": 460, "text": "Pergunta: Qual é a finalidade do atributo type em uma tag <feTurbulence> em SVG? Resposta: O atributo type em uma tag <feTurbulence> em SVG especifica o tipo de turbulência a ser gerada, como 'fractalNoise' ou 'turbulence'."},
    {"id": 461, "text": "Pergunta: Qual é a finalidade do atributo baseFrequency em uma tag <feTurbulence> em SVG? Resposta: O atributo baseFrequency em uma tag <feTurbulence> em SVG especifica a frequência base da turbulência."},
    {"id": 462, "text": "Pergunta: Qual é a finalidade do atributo numOctaves em uma tag <feTurbulence> em SVG? Resposta: O atributo numOctaves em uma tag <feTurbulence> em SVG especifica o número de octaves na turbulência."},
    {"id": 463, "text": "Pergunta: O que é o elemento <foreignObject> em SVG? Resposta: O elemento <foreignObject> em SVG é usado para incluir conteúdo HTML arbitrário dentro de um documento SVG."},
    {"id": 464, "text": "Pergunta: Qual é a finalidade do atributo x em uma tag <foreignObject> em SVG? Resposta: O atributo x em uma tag <foreignObject> em SVG especifica a posição x do elemento no sistema de coordenadas do documento SVG."},
    {"id": 465, "text": "Pergunta: Qual é a finalidade do atributo y em uma tag <foreignObject> em SVG? Resposta: O atributo y em uma tag <foreignObject> em SVG especifica a posição y do elemento no sistema de coordenadas do documento SVG."},
    {"id": 466, "text": "Pergunta: Qual é a finalidade do atributo width em uma tag <foreignObject> em SVG? Resposta: O atributo width em uma tag <foreignObject> em SVG especifica a largura do elemento."},
    {"id": 467, "text": "Pergunta: Qual é a finalidade do atributo height em uma tag <foreignObject> em SVG? Resposta: O atributo height em uma tag <foreignObject> em SVG especifica a altura do elemento."},
    {"id": 468, "text": "Pergunta: O que é o elemento <desc> em SVG? Resposta: O elemento <desc> em SVG é usado para fornecer uma descrição textual de um elemento gráfico."},
    {"id": 469, "text": "Pergunta: O que é o elemento <title> em SVG? Resposta: O elemento <title> em SVG é usado para fornecer um título descritivo de um elemento gráfico."},
    {"id": 470, "text": "Pergunta: O que é o elemento <a> em SVG? Resposta: O elemento <a> em SVG é usado para criar links em torno de elementos gráficos."},
    {"id": 471, "text": "Pergunta: Qual é a finalidade do atributo xlink:href em uma tag <a> em SVG? Resposta: O atributo xlink:href em uma tag <a> em SVG especifica o URI para o qual o link deve apontar."},
    {"id": 472, "text": "Pergunta: Qual é a finalidade do atributo target em uma tag <a> em SVG? Resposta: O atributo target em uma tag <a> em SVG especifica onde abrir o destino do link, como '_self', '_blank', '_parent', '_top'."},
    {"id": 473, "text": "Pergunta: O que é o elemento <script> em SVG? Resposta: O elemento <script> em SVG é usado para incluir scripts dentro de um documento SVG."},
    {"id": 474, "text": "Pergunta: Qual é a finalidade do atributo type em uma tag <script> em SVG? Resposta: O atributo type em uma tag <script> em SVG especifica o tipo de conteúdo do script, como 'text/javascript' ou 'application/ecmascript'."},
    {"id": 475, "text": "Pergunta: O que é o elemento <style> em SVG? Resposta: O elemento <style> em SVG é usado para incluir estilos CSS dentro de um documento SVG."},
    {"id": 476, "text": "Pergunta: Qual é a finalidade do atributo type em uma tag <style> em SVG? Resposta: O atributo type em uma tag <style> em SVG especifica o tipo de conteúdo do estilo, geralmente 'text/css'."},
    {"id": 477, "text": "Pergunta: O que é o elemento <metadata> em SVG? Resposta: O elemento <metadata> em SVG é usado para incluir metadados adicionais dentro de um documento SVG."},
    {"id": 478, "text": "Pergunta: O que é o elemento <svg> em HTML? Resposta: O elemento <svg> em HTML é usado para criar gráficos vetoriais escaláveis dentro de um documento HTML."},
    {"id": 479, "text": "Pergunta: Qual é a finalidade do atributo xmlns em uma tag <svg>? Resposta: O atributo xmlns em uma tag <svg> especifica o namespace XML do elemento SVG."},
    {"id": 480, "text": "Pergunta: Qual é a finalidade do atributo viewBox em uma tag <svg>? Resposta: O atributo viewBox em uma tag <svg> especifica a caixa de visualização do documento SVG."},
    {"id": 481, "text": "Pergunta: Qual é a finalidade do atributo width em uma tag <svg>? Resposta: O atributo width em uma tag <svg> especifica a largura do elemento SVG."},
    {"id": 482, "text": "Pergunta: Qual é a finalidade do atributo height em uma tag <svg>? Resposta: O atributo height em uma tag <svg> especifica a altura do elemento SVG."},
    {"id": 483, "text": "Pergunta: O que é o elemento <circle> em SVG? Resposta: O elemento <circle> em SVG é usado para criar círculos."},
    {"id": 484, "text": "Pergunta: Qual é a finalidade do atributo cx em uma tag <circle>? Resposta: O atributo cx em uma tag <circle> especifica a coordenada x do centro do círculo."},
    {"id": 485, "text": "Pergunta: Qual é a finalidade do atributo cy em uma tag <circle>? Resposta: O atributo cy em uma tag <circle> especifica a coordenada y do centro do círculo."},
    {"id": 486, "text": "Pergunta: Qual é a finalidade do atributo r em uma tag <circle>? Resposta: O atributo r em uma tag <circle> especifica o raio do círculo."},
    {"id": 487, "text": "Pergunta: O que é o elemento <ellipse> em SVG? Resposta: O elemento <ellipse> em SVG é usado para criar elipses."},
    {"id": 488, "text": "Pergunta: Qual é a finalidade do atributo cx em uma tag <ellipse>? Resposta: O atributo cx em uma tag <ellipse> especifica a coordenada x do centro da elipse."},
    {"id": 489, "text": "Pergunta: Qual é a finalidade do atributo cy em uma tag <ellipse>? Resposta: O atributo cy em uma tag <ellipse> especifica a coordenada y do centro da elipse."},
    {"id": 490, "text": "Pergunta: Qual é a finalidade do atributo rx em uma tag <ellipse>? Resposta: O atributo rx em uma tag <ellipse> especifica o raio horizontal da elipse."},
    {"id": 491, "text": "Pergunta: Qual é a finalidade do atributo ry em uma tag <ellipse>? Resposta: O atributo ry em uma tag <ellipse> especifica o raio vertical da elipse."},
    {"id": 492, "text": "Pergunta: O que é o elemento <line> em SVG? Resposta: O elemento <line> em SVG é usado para criar linhas."},
    {"id": 493, "text": "Pergunta: O que é HTML? Resposta: HTML é uma linguagem de marcação usada para estruturar o conteúdo na web."},
    {"id": 494, "text": "Pergunta: O que significa <!DOCTYPE html>? Resposta: É uma declaração que informa ao navegador a versão do HTML que o documento está usando."},
    {"id": 495, "text": "Pergunta: O que é uma tag HTML? Resposta: Uma tag HTML é uma palavra-chave cercada por colchetes angulares (<>) usada para definir o conteúdo."},
    {"id": 496, "text": "Pergunta: Qual é a estrutura básica de um documento HTML? Resposta: A estrutura básica de um documento HTML inclui a declaração do tipo de documento, a tag <html>, que contém as tags <head> e <body>."},
    {"id": 497, "text": "Pergunta: O que é uma tag de abertura e fechamento em HTML? Resposta: Uma tag de abertura é usada para iniciar um elemento e uma tag de fechamento é usada para encerrá-lo."},
    {"id": 498, "text": "Pergunta: Como criar um link em HTML? Resposta: Você pode criar um link em HTML usando a tag <a> e especificando o atributo href com o URL desejado."},
    {"id": 499, "text": "Pergunta: O que é um elemento de lista em HTML? Resposta: Um elemento de lista em HTML é usado para criar listas ordenadas ou não ordenadas e é definido pelas tags <ul> (para listas não ordenadas) ou <ol> (para listas ordenadas)."},
    {"id": 500, "text": "Pergunta: O que é o elemento <progress> em HTML? Resposta: O elemento <progress> em HTML é usado para criar uma barra de progresso que representa o andamento de uma tarefa."}
]