[
    {"id": 1, "text": "Pergunta: O que é SQL? Resposta: SQL é uma linguagem de consulta estruturada usada para gerenciar e manipular bancos de dados relacionais."},
    {"id": 2, "text": "Pergunta: O que significa SELECT em SQL? Resposta: SELECT é uma declaração usada para consultar dados de um banco de dados."},
    {"id": 3, "text": "Pergunta: O que faz a cláusula WHERE em SQL? Resposta: A cláusula WHERE é usada para filtrar registros com base em uma condição específica."},
    {"id": 4, "text": "Pergunta: O que é uma chave primária em SQL? Resposta: Uma chave primária é um campo que identifica de forma exclusiva cada registro em uma tabela."},
    {"id": 5, "text": "Pergunta: O que é uma chave estrangeira em SQL? Resposta: Uma chave estrangeira é um campo em uma tabela que cria um vínculo entre duas tabelas."},
    {"id": 6, "text": "Pergunta: O que é uma junção (JOIN) em SQL? Resposta: JOIN é uma operação usada para combinar registros de duas ou mais tabelas com base em um campo comum."},
    {"id": 7, "text": "Pergunta: Qual a função do comando INSERT em SQL? Resposta: INSERT é usado para adicionar novos registros a uma tabela."},
    {"id": 8, "text": "Pergunta: O que faz o comando UPDATE em SQL? Resposta: UPDATE é usado para modificar registros existentes em uma tabela."},
    {"id": 9, "text": "Pergunta: Qual a finalidade do comando DELETE em SQL? Resposta: DELETE é usado para remover registros de uma tabela."},
    {"id": 10, "text": "Pergunta: O que é um índice em SQL? Resposta: Um índice é uma estrutura de dados que melhora a velocidade das operações de consulta em uma tabela."},
    {"id": 11, "text": "Pergunta: O que significa NULL em SQL? Resposta: NULL representa um valor desconhecido ou ausente em uma coluna."},
    {"id": 12, "text": "Pergunta: O que é uma subconsulta em SQL? Resposta: Uma subconsulta é uma consulta aninhada dentro de outra consulta."},
    {"id": 13, "text": "Pergunta: O que faz a função COUNT() em SQL? Resposta: COUNT() retorna o número de linhas que correspondem a um critério especificado."},
    {"id": 14, "text": "Pergunta: O que faz a função AVG() em SQL? Resposta: AVG() calcula a média de um conjunto de valores numéricos."},
    {"id": 15, "text": "Pergunta: O que faz a função SUM() em SQL? Resposta: SUM() retorna a soma total de um conjunto de valores numéricos."},
    {"id": 16, "text": "Pergunta: O que faz a função MAX() em SQL? Resposta: MAX() retorna o valor máximo de um conjunto de valores."},
    {"id": 17, "text": "Pergunta: O que faz a função MIN() em SQL? Resposta: MIN() retorna o valor mínimo de um conjunto de valores."},
    {"id": 18, "text": "Pergunta: O que é a cláusula GROUP BY em SQL? Resposta: GROUP BY é usada para agrupar linhas que têm valores iguais em colunas especificadas."},
    {"id": 19, "text": "Pergunta: O que é a cláusula HAVING em SQL? Resposta: HAVING é usada para filtrar registros depois de um agrupamento com a cláusula GROUP BY."},
    {"id": 20, "text": "Pergunta: O que é a cláusula ORDER BY em SQL? Resposta: ORDER BY é usada para ordenar os resultados de uma consulta em ordem ascendente ou descendente."},
    {"id": 21, "text": "Pergunta: O que faz o comando CREATE TABLE em SQL? Resposta: CREATE TABLE é usado para criar uma nova tabela em um banco de dados."},
    {"id": 22, "text": "Pergunta: O que é um tipo de dado em SQL? Resposta: Tipo de dado define o tipo de valor que pode ser armazenado em uma coluna, como INT, VARCHAR, DATE, etc."},
    {"id": 23, "text": "Pergunta: O que é uma restrição (constraint) em SQL? Resposta: Restrições são regras aplicadas às colunas de uma tabela para garantir a integridade dos dados."},
    {"id": 24, "text": "Pergunta: O que faz a restrição PRIMARY KEY em SQL? Resposta: PRIMARY KEY identifica exclusivamente cada registro em uma tabela."},
    {"id": 25, "text": "Pergunta: O que faz a restrição FOREIGN KEY em SQL? Resposta: FOREIGN KEY garante que o valor de uma coluna corresponda ao valor de uma coluna em outra tabela."},
    {"id": 26, "text": "Pergunta: O que faz a restrição UNIQUE em SQL? Resposta: UNIQUE garante que todos os valores em uma coluna sejam distintos."},
    {"id": 27, "text": "Pergunta: O que faz a restrição NOT NULL em SQL? Resposta: NOT NULL garante que uma coluna não possa ter um valor NULL."},
    {"id": 28, "text": "Pergunta: O que faz a cláusula DEFAULT em SQL? Resposta: DEFAULT define um valor padrão para uma coluna quando nenhum valor é especificado."},
    {"id": 29, "text": "Pergunta: O que é a normalização em SQL? Resposta: Normalização é o processo de organizar os dados para reduzir a redundância e melhorar a integridade dos dados."},
    {"id": 30, "text": "Pergunta: O que é a desnormalização em SQL? Resposta: Desnormalização é o processo de combinar dados de tabelas normalizadas para melhorar o desempenho de leitura."},
    {"id": 31, "text": "Pergunta: O que faz a cláusula UNION em SQL? Resposta: UNION combina os resultados de duas ou mais consultas SELECT em uma única tabela de resultados."},
    {"id": 32, "text": "Pergunta: O que faz a cláusula INTERSECT em SQL? Resposta: INTERSECT retorna os registros que são comuns a duas consultas SELECT."},
    {"id": 33, "text": "Pergunta: O que faz a cláusula EXCEPT em SQL? Resposta: EXCEPT retorna os registros da primeira consulta SELECT que não estão na segunda consulta SELECT."},
    {"id": 34, "text": "Pergunta: O que é uma visão (view) em SQL? Resposta: Uma visão é uma tabela virtual baseada no resultado de uma consulta SQL."},
    {"id": 35, "text": "Pergunta: O que é um procedimento armazenado (stored procedure) em SQL? Resposta: Um procedimento armazenado é um conjunto de comandos SQL que podem ser executados como uma única unidade."},
    {"id": 36, "text": "Pergunta: O que é uma trigger em SQL? Resposta: Uma trigger é um conjunto de comandos SQL que são automaticamente executados em resposta a certos eventos em uma tabela."},
    {"id": 37, "text": "Pergunta: O que é um cursor em SQL? Resposta: Um cursor é um objeto que permite a navegação linha a linha através de um conjunto de resultados de uma consulta."},
    {"id": 38, "text": "Pergunta: O que é uma transação em SQL? Resposta: Uma transação é uma sequência de operações que são tratadas como uma única unidade de trabalho."},
    {"id": 39, "text": "Pergunta: O que faz o comando COMMIT em SQL? Resposta: COMMIT salva todas as alterações feitas durante a transação no banco de dados."},
    {"id": 40, "text": "Pergunta: O que faz o comando ROLLBACK em SQL? Resposta: ROLLBACK desfaz todas as alterações feitas durante a transação."},
    {"id": 41, "text": "Pergunta: O que faz o comando SAVEPOINT em SQL? Resposta: SAVEPOINT cria um ponto de salvamento dentro de uma transação para permitir a reversão parcial das operações."},
    {"id": 42, "text": "Pergunta: O que é ACID em SQL? Resposta: ACID é um conjunto de propriedades (Atomicidade, Consistência, Isolamento, Durabilidade) que garantem a integridade das transações no banco de dados."},
    {"id": 43, "text": "Pergunta: O que é uma função definida pelo usuário (UDF) em SQL? Resposta: UDF é uma função que pode ser criada pelo usuário para realizar operações personalizadas no banco de dados."},
    {"id": 44, "text": "Pergunta: O que é SQL injection? Resposta: SQL injection é uma técnica de ataque em que comandos SQL maliciosos são inseridos em uma entrada para manipular o banco de dados."},
    {"id": 45, "text": "Pergunta: O que é a cláusula DISTINCT em SQL? Resposta: DISTINCT é usada para remover duplicatas dos resultados de uma consulta."},
    {"id": 46, "text": "Pergunta: O que é uma tabela temporária em SQL? Resposta: Uma tabela temporária é uma tabela que existe temporariamente durante a sessão do banco de dados."},
    {"id": 47, "text": "Pergunta: O que é um banco de dados relacional? Resposta: Um banco de dados relacional organiza os dados em tabelas que podem ser relacionadas entre si."},
    {"id": 48, "text": "Pergunta: O que é um banco de dados NoSQL? Resposta: Um banco de dados NoSQL é projetado para armazenar e recuperar dados que não são organizados em tabelas relacionais."},
    {"id": 49, "text": "Pergunta: O que faz a função CONCAT() em SQL? Resposta: CONCAT() é usada para concatenar duas ou mais strings em uma única string."},
    {"id": 50, "text": "Pergunta: O que é uma consulta aninhada em SQL? Resposta: Uma consulta aninhada é uma consulta SQL dentro de outra consulta SQL."},
    {"id": 51, "text": "Pergunta: O que é um esquema em SQL? Resposta: Um esquema é uma coleção de objetos de banco de dados, incluindo tabelas, visões e índices, associados a um usuário específico."},
    {"id": 52, "text": "Pergunta: O que é a função COALESCE() em SQL? Resposta: COALESCE() retorna o primeiro valor não nulo em uma lista de argumentos."},
    {"id": 53, "text": "Pergunta: O que é uma chave composta em SQL? Resposta: Uma chave composta é uma chave primária que consiste em mais de uma coluna."},
    {"id": 54, "text": "Pergunta: O que é uma transação distribuída em SQL? Resposta: Uma transação distribuída é uma transação que envolve múltiplos sistemas de banco de dados."},
    {"id": 55, "text": "Pergunta: O que é uma função agregada em SQL? Resposta: Uma função agregada realiza um cálculo em um conjunto de valores e retorna um único valor, como SUM(), AVG(), COUNT(), etc."},
    {"id": 56, "text": "Pergunta: O que é uma stored procedure em SQL? Resposta: Uma stored procedure é um conjunto de comandos SQL que podem ser executados como uma única unidade de trabalho."},
    {"id": 57, "text": "Pergunta: O que é uma constraint em SQL? Resposta: Uma constraint é uma regra aplicada aos dados em uma tabela para garantir a integridade dos dados."},
    {"id": 58, "text": "Pergunta: O que faz o comando ALTER TABLE em SQL? Resposta: ALTER TABLE é usado para modificar a estrutura de uma tabela existente."},
    {"id": 59, "text": "Pergunta: O que faz o comando DROP TABLE em SQL? Resposta: DROP TABLE é usado para remover uma tabela e todos os seus dados do banco de dados."},
    {"id": 60, "text": "Pergunta: O que faz o comando TRUNCATE TABLE em SQL? Resposta: TRUNCATE TABLE remove todos os registros de uma tabela, mas mantém a estrutura da tabela."},
    {"id": 61, "text": "Pergunta: O que é uma instrução DDL em SQL? Resposta: DDL (Data Definition Language) é usada para definir e gerenciar objetos de banco de dados, como tabelas e índices."},
    {"id": 62, "text": "Pergunta: O que é uma instrução DML em SQL? Resposta: DML (Data Manipulation Language) é usada para manipular dados em um banco de dados, incluindo SELECT, INSERT, UPDATE e DELETE."},
    {"id": 63, "text": "Pergunta: O que é uma instrução DCL em SQL? Resposta: DCL (Data Control Language) é usada para controlar o acesso aos dados em um banco de dados, incluindo GRANT e REVOKE."},
    {"id": 64, "text": "Pergunta: O que é uma instrução TCL em SQL? Resposta: TCL (Transaction Control Language) é usada para gerenciar transações em um banco de dados, incluindo COMMIT, ROLLBACK e SAVEPOINT."},
    {"id": 65, "text": "Pergunta: O que é um alias em SQL? Resposta: Um alias é um nome temporário dado a uma tabela ou coluna para simplificar a consulta SQL."},
    {"id": 66, "text": "Pergunta: O que é um banco de dados distribuído? Resposta: Um banco de dados distribuído é um banco de dados em que os dados são armazenados em vários locais físicos diferentes."},
    {"id": 67, "text": "Pergunta: O que é um cluster de banco de dados? Resposta: Um cluster de banco de dados é um grupo de servidores que trabalham juntos para fornecer alta disponibilidade e escalabilidade."},
    {"id": 68, "text": "Pergunta: O que é replicação em SQL? Resposta: Replicação é o processo de copiar e manter dados sincronizados em múltiplos servidores de banco de dados."},
    {"id": 69, "text": "Pergunta: O que é sharding em SQL? Resposta: Sharding é uma técnica de particionamento de banco de dados que distribui dados em várias máquinas para melhorar o desempenho."},
    {"id": 70, "text": "Pergunta: O que é um índice único em SQL? Resposta: Um índice único garante que os valores indexados em uma coluna ou conjunto de colunas sejam únicos."},
    {"id": 71, "text": "Pergunta: O que é um índice clusterizado em SQL? Resposta: Um índice clusterizado determina a ordem física dos dados em uma tabela e é usado para melhorar a velocidade das consultas."},
    {"id": 72, "text": "Pergunta: O que é um índice não clusterizado em SQL? Resposta: Um índice não clusterizado cria uma estrutura separada que aponta para os dados armazenados na tabela e é usado para melhorar o desempenho das consultas."},
    {"id": 73, "text": "Pergunta: O que é uma tabela derivada em SQL? Resposta: Uma tabela derivada é uma tabela temporária criada a partir do resultado de uma subconsulta em uma cláusula FROM."},
    {"id": 74, "text": "Pergunta: O que é uma chave candidata em SQL? Resposta: Uma chave candidata é uma coluna, ou um conjunto de colunas, que pode ser usada como uma chave primária."},
    {"id": 75, "text": "Pergunta: O que é um modelo entidade-relacionamento (ER)? Resposta: Um modelo ER é uma representação gráfica de entidades e seus relacionamentos em um banco de dados."},
    {"id": 76, "text": "Pergunta: O que é uma relação de um para muitos em SQL? Resposta: Uma relação de um para muitos ocorre quando uma linha em uma tabela pode estar relacionada a múltiplas linhas em outra tabela."},
    {"id": 77, "text": "Pergunta: O que é uma relação de muitos para muitos em SQL? Resposta: Uma relação de muitos para muitos ocorre quando múltiplas linhas em uma tabela podem estar relacionadas a múltiplas linhas em outra tabela."},
    {"id": 78, "text": "Pergunta: O que é uma relação de um para um em SQL? Resposta: Uma relação de um para um ocorre quando uma linha em uma tabela está relacionada a uma única linha em outra tabela."},
    {"id": 79, "text": "Pergunta: O que é a cláusula LIMIT em SQL? Resposta: LIMIT é usada para especificar o número máximo de registros que a consulta deve retornar."},
    {"id": 80, "text": "Pergunta: O que é uma transação ACID em SQL? Resposta: Uma transação ACID é uma transação que segue as propriedades de Atomicidade, Consistência, Isolamento e Durabilidade."},
    {"id": 81, "text": "Pergunta: O que é atomicidade em SQL? Resposta: Atomicidade garante que todas as operações em uma transação sejam concluídas com sucesso ou nenhuma delas seja aplicada."},
    {"id": 82, "text": "Pergunta: O que é consistência em SQL? Resposta: Consistência garante que uma transação leve o banco de dados de um estado válido a outro estado válido."},
    {"id": 83, "text": "Pergunta: O que é isolamento em SQL? Resposta: Isolamento garante que as operações de uma transação sejam invisíveis para outras transações até que a transação esteja completa."},
    {"id": 84, "text": "Pergunta: O que é durabilidade em SQL? Resposta: Durabilidade garante que uma vez que uma transação é confirmada, suas alterações são permanentes, mesmo em caso de falha do sistema."},
    {"id": 85, "text": "Pergunta: O que é um banco de dados OLTP? Resposta: OLTP (Online Transaction Processing) é um tipo de banco de dados projetado para gerenciar transações em tempo real."},
    {"id": 86, "text": "Pergunta: O que é um banco de dados OLAP? Resposta: OLAP (Online Analytical Processing) é um tipo de banco de dados projetado para consultas analíticas e relatórios."},
    {"id": 87, "text": "Pergunta: O que é um plano de execução em SQL? Resposta: Um plano de execução é um conjunto de etapas que o SQL Server usa para executar uma consulta."},
    {"id": 88, "text": "Pergunta: O que é um hint de otimização em SQL? Resposta: Um hint de otimização é uma instrução que orienta o otimizador de consultas sobre como executar uma consulta."},
    {"id": 89, "text": "Pergunta: O que é particionamento de tabelas em SQL? Resposta: Particionamento de tabelas é o processo de dividir uma tabela grande em partes menores para melhorar o desempenho e a gestão."},
    {"id": 90, "text": "Pergunta: O que é um banco de dados in-memory? Resposta: Um banco de dados in-memory armazena dados principalmente na memória RAM para melhorar significativamente o desempenho."},
    {"id": 91, "text": "Pergunta: O que é uma restrição CHECK em SQL? Resposta: CHECK é uma restrição que limita os valores que podem ser colocados em uma coluna."},
    {"id": 92, "text": "Pergunta: O que é um sinônimo em SQL? Resposta: Um sinônimo é um nome alternativo para um objeto de banco de dados, como uma tabela ou visão."},
    {"id": 93, "text": "Pergunta: O que é a cláusula MERGE em SQL? Resposta: MERGE é usada para inserir, atualizar ou excluir registros em uma tabela com base nos resultados de uma junção."},
    {"id": 94, "text": "Pergunta: O que é a função NVL() em SQL? Resposta: NVL() substitui um valor NULL por um valor alternativo especificado."},
    {"id": 95, "text": "Pergunta: O que é a função NULLIF() em SQL? Resposta: NULLIF() retorna NULL se dois valores forem iguais, caso contrário, retorna o primeiro valor."},
    {"id": 96, "text": "Pergunta: O que é a cláusula FETCH em SQL? Resposta: FETCH é usada para limitar o número de linhas retornadas por uma consulta, em combinação com OFFSET."},
    {"id": 97, "text": "Pergunta: O que é a função LAG() em SQL? Resposta: LAG() é usada para acessar um valor de uma linha anterior no mesmo conjunto de resultados."},
    {"id": 98, "text": "Pergunta: O que é a função LEAD() em SQL? Resposta: LEAD() é usada para acessar um valor de uma linha seguinte no mesmo conjunto de resultados."},
    {"id": 99, "text": "Pergunta: O que é a função RANK() em SQL? Resposta: RANK() atribui um número de classificação a cada linha em um conjunto de resultados, com lacunas nos números em caso de empates."},
    {"id": 100, "text": "Pergunta: O que é a função DENSE_RANK() em SQL? Resposta: DENSE_RANK() atribui um número de classificação a cada linha em um conjunto de resultados, sem lacunas nos números em caso de empates."},
    {"id": 101, "text": "Pergunta: O que é a função ROW_NUMBER() em SQL? Resposta: ROW_NUMBER() atribui um número sequencial único a cada linha em um conjunto de resultados."},
    {"id": 102, "text": "Pergunta: O que é a função NTILE() em SQL? Resposta: NTILE() distribui as linhas em um conjunto de resultados em um número especificado de grupos, cada grupo recebendo um número de grupo."},
    {"id": 103, "text": "Pergunta: O que é uma CTE em SQL? Resposta: Uma CTE (Common Table Expression) é uma tabela temporária que pode ser referenciada dentro de uma instrução SELECT, INSERT, UPDATE ou DELETE."},
    {"id": 104, "text": "Pergunta: O que é um banco de dados multi-tenant? Resposta: Um banco de dados multi-tenant é um banco de dados que suporta múltiplos clientes (tenants) com uma única instância de software."},
    {"id": 105, "text": "Pergunta: O que é a função REPLACE() em SQL? Resposta: REPLACE() substitui todas as ocorrências de uma substring em uma string por outra substring."},
    {"id": 106, "text": "Pergunta: O que é a função SUBSTRING() em SQL? Resposta: SUBSTRING() extrai uma parte de uma string, a partir de uma posição inicial e com um comprimento especificado."},
    {"id": 107, "text": "Pergunta: O que é a função CHARINDEX() em SQL? Resposta: CHARINDEX() retorna a posição inicial de uma substring em uma string, ou zero se a substring não for encontrada."},
    {"id": 108, "text": "Pergunta: O que é a função LEN() em SQL? Resposta: LEN() retorna o comprimento de uma string."},
    {"id": 109, "text": "Pergunta: O que é a função LOWER() em SQL? Resposta: LOWER() converte todos os caracteres de uma string para minúsculas."},
    {"id": 110, "text": "Pergunta: O que é a função UPPER() em SQL? Resposta: UPPER() converte todos os caracteres de uma string para maiúsculas."},
    {"id": 111, "text": "Pergunta: O que é a função LTRIM() em SQL? Resposta: LTRIM() remove os espaços em branco à esquerda de uma string."},
    {"id": 112, "text": "Pergunta: O que é a função RTRIM() em SQL? Resposta: RTRIM() remove os espaços em branco à direita de uma string."},
    {"id": 113, "text": "Pergunta: O que é a função ROUND() em SQL? Resposta: ROUND() arredonda um valor numérico para um número especificado de decimais."},
    {"id": 114, "text": "Pergunta: O que é a função CEILING() em SQL? Resposta: CEILING() retorna o menor número inteiro maior ou igual a um valor especificado."},
    {"id": 115, "text": "Pergunta: O que é a função FLOOR() em SQL? Resposta: FLOOR() retorna o maior número inteiro menor ou igual a um valor especificado."},
    {"id": 116, "text": "Pergunta: O que é a função ABS() em SQL? Resposta: ABS() retorna o valor absoluto de um número."},
    {"id": 117, "text": "Pergunta: O que é a função POWER() em SQL? Resposta: POWER() retorna um número elevado a uma potência especificada."},
    {"id": 118, "text": "Pergunta: O que é a função SQRT() em SQL? Resposta: SQRT() retorna a raiz quadrada de um número."},
    {"id": 119, "text": "Pergunta: O que é a função LOG() em SQL? Resposta: LOG() retorna o logaritmo natural de um número."},
    {"id": 120, "text": "Pergunta: O que é a função EXP() em SQL? Resposta: EXP() retorna o valor de e elevado a uma potência especificada."},
    {"id": 121, "text": "Pergunta: O que é a função PI() em SQL? Resposta: PI() retorna o valor de pi."},
    {"id": 122, "text": "Pergunta: O que é a função SIN() em SQL? Resposta: SIN() retorna o seno de um ângulo especificado."},
    {"id": 123, "text": "Pergunta: O que é a função COS() em SQL? Resposta: COS() retorna o cosseno de um ângulo especificado."},
    {"id": 124, "text": "Pergunta: O que é a função TAN() em SQL? Resposta: TAN() retorna a tangente de um ângulo especificado."},
    {"id": 125, "text": "Pergunta: O que é a função ASIN() em SQL? Resposta: ASIN() retorna o arco seno de um número especificado."},
    {"id": 126, "text": "Pergunta: O que é a função ACOS() em SQL? Resposta: ACOS() retorna o arco cosseno de um número especificado."},
    {"id": 127, "text": "Pergunta: O que é a função ATAN() em SQL? Resposta: ATAN() retorna o arco tangente de um número especificado."},
    {"id": 128, "text": "Pergunta: O que é a função ATN2() em SQL? Resposta: ATN2() retorna o arco tangente dos dois números especificados."},
    {"id": 129, "text": "Pergunta: O que é a função SIGN() em SQL? Resposta: SIGN() retorna o sinal de um número especificado."},
    {"id": 130, "text": "Pergunta: O que é a função RAND() em SQL? Resposta: RAND() retorna um número aleatório entre 0 e 1."},
    {"id": 131, "text": "Pergunta: O que é uma função de janela em SQL? Resposta: Uma função de janela realiza um cálculo em um conjunto de linhas relacionadas ao redor da linha atual."},
    {"id": 132, "text": "Pergunta: O que é a cláusula PARTITION BY em SQL? Resposta: PARTITION BY divide o conjunto de resultados em partições para a aplicação de funções de janela."},
    {"id": 133, "text": "Pergunta: O que é a cláusula ORDER BY em SQL? Resposta: ORDER BY é usada para classificar os resultados de uma consulta em ordem crescente ou decrescente."},
    {"id": 134, "text": "Pergunta: O que é a cláusula GROUP BY em SQL? Resposta: GROUP BY é usada para agrupar linhas que têm valores de coluna iguais em conjuntos de resumo."},
    {"id": 135, "text": "Pergunta: O que é a cláusula HAVING em SQL? Resposta: HAVING é usada para filtrar grupos de linhas com base em uma condição especificada."},
    {"id": 136, "text": "Pergunta: O que é uma função de agregado em SQL? Resposta: Uma função de agregado realiza um cálculo em um conjunto de valores e retorna um único valor."},
    {"id": 137, "text": "Pergunta: O que é uma junção interna (INNER JOIN) em SQL? Resposta: INNER JOIN retorna linhas que têm valores correspondentes em ambas as tabelas envolvidas na junção."},
    {"id": 138, "text": "Pergunta: O que é uma junção externa (OUTER JOIN) em SQL? Resposta: OUTER JOIN retorna todas as linhas de uma tabela e as linhas correspondentes da outra tabela. Se não houver correspondência, os resultados conterão valores NULL."},
    {"id": 139, "text": "Pergunta: O que é uma junção à esquerda (LEFT JOIN) em SQL? Resposta: LEFT JOIN retorna todas as linhas da tabela à esquerda e as linhas correspondentes da tabela à direita. Se não houver correspondência, os resultados conterão valores NULL."},
    {"id": 140, "text": "Pergunta: O que é uma junção à direita (RIGHT JOIN) em SQL? Resposta: RIGHT JOIN retorna todas as linhas da tabela à direita e as linhas correspondentes da tabela à esquerda. Se não houver correspondência, os resultados conterão valores NULL."},
    {"id": 141, "text": "Pergunta: O que é uma junção completa (FULL JOIN) em SQL? Resposta: FULL JOIN retorna todas as linhas quando há uma correspondência em uma das tabelas. Se não houver correspondência, os resultados conterão valores NULL."},
    {"id": 142, "text": "Pergunta: O que é uma chave estrangeira (FOREIGN KEY) em SQL? Resposta: Uma chave estrangeira é uma coluna ou conjunto de colunas que estabelece um vínculo entre os dados de duas tabelas."},
    {"id": 143, "text": "Pergunta: O que é a integridade referencial em SQL? Resposta: Integridade referencial garante que as relações entre as tabelas permaneçam consistentes."},
    {"id": 144, "text": "Pergunta: O que é uma subconsulta em SQL? Resposta: Uma subconsulta é uma consulta aninhada dentro de outra consulta."},
    {"id": 145, "text": "Pergunta: O que é uma visão (VIEW) em SQL? Resposta: Uma visão é uma tabela virtual baseada no resultado de uma consulta SQL."},
    {"id": 146, "text": "Pergunta: O que é um banco de dados temporal? Resposta: Um banco de dados temporal armazena dados relacionados ao tempo, permitindo consultas que consideram a dimensão temporal."},
    {"id": 147, "text": "Pergunta: O que é um campo calculado em SQL? Resposta: Um campo calculado é uma coluna que exibe dados derivados de uma expressão envolvendo outras colunas."},
    {"id": 148, "text": "Pergunta: O que é a cláusula WHERE em SQL? Resposta: WHERE é usada para filtrar registros com base em uma condição especificada."},
    {"id": 149, "text": "Pergunta: O que é uma chave estrangeira (foreign key) em SQL? Resposta: Uma chave estrangeira é uma coluna ou conjunto de colunas que estabelece um vínculo entre os dados de duas tabelas."},
    {"id": 150, "text": "Pergunta: O que é a função SUM() em SQL? Resposta: SUM() retorna a soma de um conjunto de valores."},
    {"id": 151, "text": "Pergunta: O que é a função AVG() em SQL? Resposta: AVG() retorna a média de um conjunto de valores."},
    {"id": 152, "text": "Pergunta: O que é a função COUNT() em SQL? Resposta: COUNT() retorna o número de valores (ou linhas) em um conjunto de resultados."},
    {"id": 153, "text": "Pergunta: O que é a função MIN() em SQL? Resposta: MIN() retorna o menor valor em um conjunto de valores."},
    {"id": 154, "text": "Pergunta: O que é a função MAX() em SQL? Resposta: MAX() retorna o maior valor em um conjunto de valores."},
    {"id": 155, "text": "Pergunta: O que é a função CAST() em SQL? Resposta: CAST() converte uma expressão de um tipo de dado para outro."},
    {"id": 156, "text": "Pergunta: O que é a função CONVERT() em SQL? Resposta: CONVERT() converte uma expressão de um tipo de dado para outro, permitindo especificar um estilo de formatação."},
    {"id": 157, "text": "Pergunta: O que é a função ISNULL() em SQL? Resposta: ISNULL() substitui NULL por um valor especificado."},
    {"id": 158, "text": "Pergunta: O que é um índice em SQL? Resposta: Um índice é uma estrutura de dados que melhora a velocidade de recuperação de registros de uma tabela."},
    {"id": 159, "text": "Pergunta: O que é a cláusula UNION em SQL? Resposta: UNION combina os resultados de duas ou mais consultas SELECT em um único conjunto de resultados."},
    {"id": 160, "text": "Pergunta: O que é a cláusula UNION ALL em SQL? Resposta: UNION ALL combina os resultados de duas ou mais consultas SELECT, incluindo duplicatas."},
    {"id": 161, "text": "Pergunta: O que é uma junção cruzada (CROSS JOIN) em SQL? Resposta: CROSS JOIN retorna o produto cartesiano de duas tabelas, combinando todas as linhas de uma tabela com todas as linhas da outra tabela."},
    {"id": 162, "text": "Pergunta: O que é a função REPLICATE() em SQL? Resposta: REPLICATE() repete uma string um número especificado de vezes."},
    {"id": 163, "text": "Pergunta: O que é a função LEFT() em SQL? Resposta: LEFT() retorna um número especificado de caracteres do início de uma string."},
    {"id": 164, "text": "Pergunta: O que é a função RIGHT() em SQL? Resposta: RIGHT() retorna um número especificado de caracteres do final de uma string."},
    {"id": 165, "text": "Pergunta: O que é a função PATINDEX() em SQL? Resposta: PATINDEX() retorna a posição inicial de um padrão especificado em uma string."},
    {"id": 166, "text": "Pergunta: O que é a função STUFF() em SQL? Resposta: STUFF() insere uma string em outra string, excluindo um número especificado de caracteres da string original."},
    {"id": 167, "text": "Pergunta: O que é uma transação em SQL? Resposta: Uma transação é uma sequência de operações de banco de dados que são executadas como uma única unidade de trabalho."},
    {"id": 168, "text": "Pergunta: O que é uma cláusula de condição CASE em SQL? Resposta: CASE é usada para retornar valores diferentes com base em condições especificadas."},
    {"id": 169, "text": "Pergunta: O que é a cláusula INTERSECT em SQL? Resposta: INTERSECT retorna as linhas comuns entre duas consultas SELECT."},
    {"id": 170, "text": "Pergunta: O que é a cláusula EXCEPT em SQL? Resposta: EXCEPT retorna as linhas da primeira consulta SELECT que não estão na segunda consulta SELECT."},
    {"id": 171, "text": "Pergunta: O que é a função CONCAT_WS() em SQL? Resposta: CONCAT_WS() concatena strings com um separador especificado."},
    {"id": 172, "text": "Pergunta: O que é a função FORMAT() em SQL? Resposta: FORMAT() formata um valor com base em um formato especificado."},
    {"id": 173, "text": "Pergunta: O que é a função STRING_SPLIT() em SQL? Resposta: STRING_SPLIT() divide uma string em um conjunto de substrings com base em um delimitador especificado."},
    {"id": 174, "text": "Pergunta: O que é a cláusula PIVOT em SQL? Resposta: PIVOT transforma dados de colunas em linhas, permitindo a criação de tabelas dinâmicas."},
    {"id": 175, "text": "Pergunta: O que é a cláusula UNPIVOT em SQL? Resposta: UNPIVOT transforma dados de linhas em colunas, permitindo a normalização de tabelas."},
    {"id": 176, "text": "Pergunta: O que é a função JSON_VALUE() em SQL? Resposta: JSON_VALUE() extrai um valor de uma string JSON com base em uma chave especificada."},
    {"id": 177, "text": "Pergunta: O que é a função JSON_QUERY() em SQL? Resposta: JSON_QUERY() extrai um objeto ou array JSON de uma string JSON."},
    {"id": 178, "text": "Pergunta: O que é a função JSON_MODIFY() em SQL? Resposta: JSON_MODIFY() modifica um valor em uma string JSON com base em uma chave especificada."},
    {"id": 179, "text": "Pergunta: O que é o comando CREATE PROCEDURE em SQL? Resposta: CREATE PROCEDURE define uma nova procedure armazenada no banco de dados."},
    {"id": 180, "text": "Pergunta: O que é o comando CREATE FUNCTION em SQL? Resposta: CREATE FUNCTION define uma nova função armazenada no banco de dados."},
    {"id": 181, "text": "Pergunta: O que é o comando CREATE TRIGGER em SQL? Resposta: CREATE TRIGGER define um novo gatilho que é executado em resposta a eventos especificados em uma tabela ou vista."},
    {"id": 182, "text": "Pergunta: O que é o comando CREATE INDEX em SQL? Resposta: CREATE INDEX cria um novo índice em uma tabela para melhorar o desempenho das consultas."},
    {"id": 183, "text": "Pergunta: O que é o comando DROP TABLE em SQL? Resposta: DROP TABLE remove uma tabela existente e todos os seus dados do banco de dados."},
    {"id": 184, "text": "Pergunta: O que é o comando DROP PROCEDURE em SQL? Resposta: DROP PROCEDURE remove uma procedure armazenada existente do banco de dados."},
    {"id": 185, "text": "Pergunta: O que é o comando DROP FUNCTION em SQL? Resposta: DROP FUNCTION remove uma função armazenada existente do banco de dados."},
    {"id": 186, "text": "Pergunta: O que é o comando DROP TRIGGER em SQL? Resposta: DROP TRIGGER remove um gatilho existente do banco de dados."},
    {"id": 187, "text": "Pergunta: O que é o comando DROP INDEX em SQL? Resposta: DROP INDEX remove um índice existente de uma tabela."},
    {"id": 188, "text": "Pergunta: O que é o comando ALTER TABLE em SQL? Resposta: ALTER TABLE altera a estrutura de uma tabela existente, permitindo adicionar, modificar ou excluir colunas e restrições."},
    {"id": 189, "text": "Pergunta: O que é o comando ALTER PROCEDURE em SQL? Resposta: ALTER PROCEDURE modifica uma procedure armazenada existente no banco de dados."},
    {"id": 190, "text": "Pergunta: O que é o comando ALTER FUNCTION em SQL? Resposta: ALTER FUNCTION modifica uma função armazenada existente no banco de dados."},
    {"id": 191, "text": "Pergunta: O que é o comando ALTER TRIGGER em SQL? Resposta: ALTER TRIGGER modifica um gatilho existente no banco de dados."},
    {"id": 192, "text": "Pergunta: O que é o comando ALTER INDEX em SQL? Resposta: ALTER INDEX modifica um índice existente em uma tabela."},
    {"id": 193, "text": "Pergunta: O que é uma transação em SQL? Resposta: Uma transação é uma sequência de operações de banco de dados que são executadas como uma única unidade de trabalho."},
    {"id": 194, "text": "Pergunta: O que é ACID em SQL? Resposta: ACID representa Atomicidade, Consistência, Isolamento e Durabilidade, que são propriedades essenciais de uma transação de banco de dados."},
    {"id": 195, "text": "Pergunta: O que é a função ISNULL() em SQL? Resposta: ISNULL() substitui NULL por um valor especificado."},
    {"id": 196, "text": "Pergunta: O que é a função COALESCE() em SQL? Resposta: COALESCE() retorna o primeiro valor não NULL em uma lista de argumentos."},
    {"id": 197, "text": "Pergunta: O que é um deadlock em SQL? Resposta: Um deadlock ocorre quando duas ou mais transações bloqueiam mutuamente, esperando pelos recursos umas das outras, o que impede que qualquer uma delas prossiga."},
    {"id": 198, "text": "Pergunta: O que é um índice clusterizado em SQL? Resposta: Um índice clusterizado armazena as linhas de dados na tabela com base na ordem das chaves de índice."},
    {"id": 199, "text": "Pergunta: O que é um índice não clusterizado em SQL? Resposta: Um índice não clusterizado armazena uma cópia das chaves de índice em uma estrutura separada, com ponteiros para as linhas de dados originais na tabela."},
    {"id": 200, "text": "Pergunta: O que é a integridade de dados em SQL? Resposta: Integridade de dados garante a precisão e consistência dos dados no banco de dados."},
    {"id": 201, "text": "Pergunta: O que é um backup completo em SQL? Resposta: Um backup completo é uma cópia completa de todo o banco de dados em um ponto no tempo."},
    {"id": 202, "text": "Pergunta: O que é um backup diferencial em SQL? Resposta: Um backup diferencial é uma cópia de todas as alterações feitas no banco de dados desde o último backup completo."},
    {"id": 203, "text": "Pergunta: O que é um backup de log em SQL? Resposta: Um backup de log é uma cópia do log de transações, que inclui todas as transações realizadas no banco de dados desde o último backup de log."},
    {"id": 204, "text": "Pergunta: O que é a replicação em SQL? Resposta: Replicação é o processo de copiar e manter dados e objetos de banco de dados em vários bancos de dados distribuídos ou sincronizados."},
    {"id": 205, "text": "Pergunta: O que é o espelhamento de banco de dados em SQL? Resposta: Espelhamento de banco de dados é uma solução de alta disponibilidade que envolve a duplicação de um banco de dados em um servidor parceiro."},
    {"id": 206, "text": "Pergunta: O que é particionamento de tabelas em SQL? Resposta: Particionamento de tabelas é o processo de dividir uma tabela grande em partes menores e gerenciáveis, chamadas partições."},
    {"id": 207, "text": "Pergunta: O que é um plano de execução em SQL? Resposta: Um plano de execução é um conjunto de etapas que o otimizador de consultas do SQL Server usa para executar uma consulta."},
    {"id": 208, "text": "Pergunta: O que é um hint de otimização em SQL? Resposta: Um hint de otimização é uma instrução que orienta o otimizador de consultas sobre como executar uma consulta de uma maneira específica."},
    {"id": 209, "text": "Pergunta: O que é um banco de dados NoSQL? Resposta: Um banco de dados NoSQL é um tipo de banco de dados projetado para lidar com grandes volumes de dados não estruturados ou semi-estruturados, sem usar a estrutura de tabelas do SQL tradicional."},
    {"id": 210, "text": "Pergunta: O que é um banco de dados OLTP? Resposta: OLTP (Online Transaction Processing) é um tipo de banco de dados projetado para gerenciar transações de alta velocidade e grande número de usuários simultâneos."},
    {"id": 211, "text": "Pergunta: O que é a indexação em SQL? Resposta: A indexação é o processo de criar índices para acelerar a recuperação de dados em uma tabela."},
    {"id": 212, "text": "Pergunta: O que é uma tabela temporária em SQL? Resposta: Uma tabela temporária é uma tabela que existe temporariamente e é usada para armazenar dados intermediários durante o processamento de consultas."},
    {"id": 213, "text": "Pergunta: O que é a função STRING_AGG() em SQL? Resposta: STRING_AGG() concatena valores de string de um grupo, com um delimitador especificado."},
    {"id": 214, "text": "Pergunta: O que é a função ROW_NUMBER() em SQL? Resposta: ROW_NUMBER() atribui um número sequencial único a cada linha dentro de uma partição de um conjunto de resultados."},
    {"id": 215, "text": "Pergunta: O que é a função RANK() em SQL? Resposta: RANK() atribui uma classificação a cada linha em uma partição de um conjunto de resultados, com lacunas na classificação quando há empates."},
    {"id": 216, "text": "Pergunta: O que é a função DENSE_RANK() em SQL? Resposta: DENSE_RANK() atribui uma classificação a cada linha em uma partição de um conjunto de resultados, sem lacunas na classificação quando há empates."},
    {"id": 217, "text": "Pergunta: O que é a função NTILE() em SQL? Resposta: NTILE() distribui as linhas em uma partição em um número especificado de grupos aproximadamente iguais."},
    {"id": 218, "text": "Pergunta: O que é uma função de janela em SQL? Resposta: Uma função de janela realiza um cálculo em um conjunto de linhas relacionadas ao redor da linha atual."},
    {"id": 219, "text": "Pergunta: O que é a função LAG() em SQL? Resposta: LAG() retorna um valor de uma linha anterior no conjunto de resultados."},
    {"id": 220, "text": "Pergunta: O que é a função LEAD() em SQL? Resposta: LEAD() retorna um valor de uma linha subsequente no conjunto de resultados."},
    {"id": 221, "text": "Pergunta: O que é a cláusula ROWS BETWEEN em SQL? Resposta: ROWS BETWEEN define um intervalo de linhas para funções de janela, especificando as linhas a serem incluídas no cálculo."},
    {"id": 222, "text": "Pergunta: O que é a função FIRST_VALUE() em SQL? Resposta: FIRST_VALUE() retorna o primeiro valor de um conjunto de resultados ordenado."},
    {"id": 223, "text": "Pergunta: O que é a função LAST_VALUE() em SQL? Resposta: LAST_VALUE() retorna o último valor de um conjunto de resultados ordenado."},
    {"id": 224, "text": "Pergunta: O que é a cláusula RANGE em SQL? Resposta: RANGE define um intervalo de valores para funções de janela, especificando os valores a serem incluídos no cálculo."},
    {"id": 225, "text": "Pergunta: O que é a função PERCENT_RANK() em SQL? Resposta: PERCENT_RANK() calcula a classificação percentual de uma linha em relação ao conjunto de resultados."},
    {"id": 226, "text": "Pergunta: O que é a função CUME_DIST() em SQL? Resposta: CUME_DIST() calcula a distribuição cumulativa de uma linha em relação ao conjunto de resultados."},
    {"id": 227, "text": "Pergunta: O que é a função MEDIAN() em SQL? Resposta: MEDIAN() calcula o valor mediano de um conjunto de valores."},
    {"id": 228, "text": "Pergunta: O que é a função VARIANCE() em SQL? Resposta: VARIANCE() calcula a variância de um conjunto de valores."},
    {"id": 229, "text": "Pergunta: O que é a função STDEV() em SQL? Resposta: STDEV() calcula o desvio padrão de um conjunto de valores."},
    {"id": 230, "text": "Pergunta: O que é um índice XML em SQL? Resposta: Um índice XML é um tipo especial de índice usado para consultas em colunas XML."},
    {"id": 231, "text": "Pergunta: O que é um índice espacial em SQL? Resposta: Um índice espacial é um tipo especial de índice usado para consultas em dados espaciais, como coordenadas geográficas."},
    {"id": 232, "text": "Pergunta: O que é uma CTE (Common Table Expression) em SQL? Resposta: Uma CTE é uma expressão de tabela temporária que é usada para simplificar consultas complexas."},
    {"id": 233, "text": "Pergunta: O que é a cláusula WITH em SQL? Resposta: WITH define uma CTE (Common Table Expression), permitindo a reutilização de subconsultas nomeadas."},
    {"id": 234, "text": "Pergunta: O que é um CURSOR em SQL? Resposta: Um cursor é um objeto de banco de dados usado para recuperar uma linha por vez de um conjunto de resultados."},
    {"id": 235, "text": "Pergunta: O que é a instrução FETCH em SQL? Resposta: FETCH recupera uma ou mais linhas de dados de um cursor."},
    {"id": 236, "text": "Pergunta: O que é a função FORMAT() em SQL? Resposta: FORMAT() formata um valor com base em uma cadeia de formato especificada."},
    {"id": 237, "text": "Pergunta: O que é uma subconsulta em SQL? Resposta: Uma subconsulta é uma consulta aninhada dentro de outra consulta."},
    {"id": 238, "text": "Pergunta: O que é a instrução IF EXISTS em SQL? Resposta: IF EXISTS é usada para condicionalmente executar uma instrução se um determinado objeto existir no banco de dados."},
    {"id": 239, "text": "Pergunta: O que é a instrução CASE em SQL? Resposta: CASE permite executar instruções condicionais em uma consulta."},
    {"id": 240, "text": "Pergunta: O que é a função SUBSTRING() em SQL? Resposta: SUBSTRING() extrai uma parte de uma string, com base em uma posição inicial e um comprimento especificados."},
    {"id": 241, "text": "Pergunta: O que é a função LEFT() em SQL? Resposta: LEFT() retorna um número especificado de caracteres do início de uma string."},
    {"id": 242, "text": "Pergunta: O que é a função RIGHT() em SQL? Resposta: RIGHT() retorna um número especificado de caracteres do final de uma string."},
    {"id": 243, "text": "Pergunta: O que é a função REPLACE() em SQL? Resposta: REPLACE() substitui todas as ocorrências de uma substring em uma string por outra substring."},
    {"id": 244, "text": "Pergunta: O que é a função REVERSE() em SQL? Resposta: REVERSE() inverte a ordem dos caracteres em uma string."},
    {"id": 245, "text": "Pergunta: O que é a função CHARINDEX() em SQL? Resposta: CHARINDEX() retorna a posição de uma substring dentro de uma string."},
    {"id": 246, "text": "Pergunta: O que é a função PATINDEX() em SQL? Resposta: PATINDEX() retorna a posição de um padrão dentro de uma string."},
    {"id": 247, "text": "Pergunta: O que é a função ASCII() em SQL? Resposta: ASCII() retorna o valor ASCII do primeiro caractere de uma string."},
    {"id": 248, "text": "Pergunta: O que é a função CHAR() em SQL? Resposta: CHAR() retorna o caractere correspondente a um valor ASCII especificado."},
    {"id": 249, "text": "Pergunta: O que é a função LTRIM() em SQL? Resposta: LTRIM() remove os espaços em branco à esquerda de uma string."},
    {"id": 250, "text": "Pergunta: O que é a função RTRIM() em SQL? Resposta: RTRIM() remove os espaços em branco à direita de uma string."},
    {"id": 251, "text": "Pergunta: O que é a função UPPER() em SQL? Resposta: UPPER() converte uma string em letras maiúsculas."},
    {"id": 252, "text": "Pergunta: O que é a função LOWER() em SQL? Resposta: LOWER() converte uma string em letras minúsculas."},
    {"id": 253, "text": "Pergunta: O que é a função LEN() em SQL? Resposta: LEN() retorna o comprimento de uma string, excluindo espaços em branco à direita."},
    {"id": 254, "text": "Pergunta: O que é a função DATALENGTH() em SQL? Resposta: DATALENGTH() retorna o número de bytes usados para representar uma expressão."},
    {"id": 255, "text": "Pergunta: O que é a função GETDATE() em SQL? Resposta: GETDATE() retorna a data e hora atuais do sistema."},
    {"id": 256, "text": "Pergunta: O que é a função DATEADD() em SQL? Resposta: DATEADD() adiciona um intervalo de tempo especificado a uma data."},
    {"id": 257, "text": "Pergunta: O que é a função DATEDIFF() em SQL? Resposta: DATEDIFF() retorna a diferença entre duas datas."},
    {"id": 258, "text": "Pergunta: O que é a função DATEPART() em SQL? Resposta: DATEPART() retorna uma parte especificada de uma data."},
    {"id": 259, "text": "Pergunta: O que é SQL? Resposta: SQL (Structured Query Language) é uma linguagem de programação usada para gerenciar e manipular bancos de dados."},
    {"id": 260, "text": "Pergunta: Quais são os tipos básicos de comandos SQL? Resposta: Os comandos básicos incluem SELECT, INSERT, UPDATE, DELETE, CREATE e DROP."},
    {"id": 261, "text": "Pergunta: O que é um banco de dados relacional? Resposta: Um banco de dados relacional organiza os dados em tabelas que podem ser relacionadas entre si usando chaves estrangeiras."},
    {"id": 262, "text": "Pergunta: Qual é a diferença entre SQL e MySQL? Resposta: SQL é a linguagem padrão para bancos de dados relacionais, enquanto MySQL é um sistema de gerenciamento de banco de dados (SGBD) que utiliza SQL."},
    {"id": 263, "text": "Pergunta: O que é uma consulta SQL? Resposta: Uma consulta SQL é uma instrução usada para extrair dados de um banco de dados."},
    {"id": 264, "text": "Pergunta: Quais são os operadores lógicos mais comuns em SQL? Resposta: Os operadores mais comuns são AND, OR e NOT."},
    {"id": 265, "text": "Pergunta: O que é uma chave primária em SQL? Resposta: Uma chave primária é um campo ou conjunto de campos que identifica exclusivamente cada registro em uma tabela."},
    {"id": 266, "text": "Pergunta: O que é um índice em SQL? Resposta: Um índice em SQL é uma estrutura de dados que melhora a velocidade de operações de consulta, especialmente em tabelas grandes."},
    {"id": 267, "text": "Pergunta: Como se faz uma junção (join) em SQL? Resposta: Junções são feitas usando cláusulas como INNER JOIN, LEFT JOIN, RIGHT JOIN ou FULL JOIN, para combinar dados de duas ou mais tabelas."},
    {"id": 268, "text": "Pergunta: O que é uma transação em SQL? Resposta: Uma transação em SQL é uma sequência de operações que são tratadas como uma unidade única e atômica."},
    {"id": 269, "text": "Pergunta: Qual é a diferença entre SQL e NoSQL? Resposta: SQL é um modelo de banco de dados relacional baseado em tabelas, enquanto NoSQL é um modelo de banco de dados não relacional que pode usar estruturas diferentes para armazenamento de dados."},
    {"id": 270, "text": "Pergunta: O que é a cláusula WHERE em SQL? Resposta: A cláusula WHERE é usada para filtrar registros em uma consulta SQL com base em uma condição específica."},
    {"id": 271, "text": "Pergunta: O que são funções de agregação em SQL? Resposta: Funções de agregação como SUM, AVG, COUNT, MAX e MIN são usadas para realizar cálculos em um conjunto de valores e retornar um único valor resumido."},
    {"id": 272, "text": "Pergunta: O que é uma subconsulta em SQL? Resposta: Uma subconsulta é uma consulta aninhada dentro de outra consulta SQL, usada para realizar operações mais complexas."},
    {"id": 273, "text": "Pergunta: O que são cursores em SQL? Resposta: Cursores são objetos usados para percorrer e processar linhas de uma tabela de forma sequencial."},
    {"id": 274, "text": "Pergunta: O que é a cláusula GROUP BY em SQL? Resposta: A cláusula GROUP BY é usada para agrupar linhas que têm o mesmo valor em uma ou mais colunas específicas."},
    {"id": 275, "text": "Pergunta: O que é a cláusula HAVING em SQL? Resposta: A cláusula HAVING é usada em conjunto com a cláusula GROUP BY para filtrar registros de um conjunto de resultados agrupados com base em uma condição específica."},
    {"id": 276, "text": "Pergunta: O que é a cláusula ORDER BY em SQL? Resposta: A cláusula ORDER BY é usada para classificar o resultado de uma consulta SQL em ordem ascendente ou descendente."},
    {"id": 277, "text": "Pergunta: O que é a cláusula LIMIT em SQL? Resposta: A cláusula LIMIT é usada para limitar o número de registros retornados por uma consulta SQL."},
    {"id": 278, "text": "Pergunta: O que é a cláusula OFFSET em SQL? Resposta: A cláusula OFFSET é usada em conjunto com a cláusula LIMIT para especificar a partir de qual linha começar a retornar registros."},
    {"id": 279, "text": "Pergunta: O que é a cláusula JOIN em SQL? Resposta: A cláusula JOIN é usada para combinar linhas de duas ou mais tabelas com base em uma condição relacionada entre elas."},
    {"id": 280, "text": "Pergunta: O que é a cláusula UNION em SQL? Resposta: A cláusula UNION é usada para combinar o resultado de duas ou mais consultas SQL em um único conjunto de resultados."},
    {"id": 281, "text": "Pergunta: O que é um procedimento armazenado em SQL? Resposta: Um procedimento armazenado é um conjunto de instruções SQL nomeadas e armazenadas no banco de dados para serem reutilizadas."},
    {"id": 282, "text": "Pergunta: O que é um gatilho (trigger) em SQL? Resposta: Um gatilho é um conjunto de instruções SQL automaticamente executadas em resposta a certos eventos em uma tabela ou visualização."},
    {"id": 283, "text": "Pergunta: O que é a normalização de dados em SQL? Resposta: A normalização de dados é o processo de organização de um banco de dados em estruturas lógicas eficientes e sem redundâncias."},
    {"id": 284, "text": "Pergunta: O que são visões (views) em SQL? Resposta: Visões são consultas SQL armazenadas como objetos virtuais que podem ser usados para simplificar consultas complexas e reutilizáveis."},
    {"id": 285, "text": "Pergunta: O que é a álgebra relacional em SQL? Resposta: A álgebra relacional é um conjunto de operações matemáticas usadas para manipular dados em bancos de dados relacionais."},
    {"id": 286, "text": "Pergunta: O que é a integridade referencial em SQL? Resposta: A integridade referencial é a consistência dos relacionamentos entre chaves estrangeiras e chaves primárias em um banco de dados relacional."},
    {"id": 287, "text": "Pergunta: O que é um modelo entidade-relacionamento (ER) em SQL? Resposta: Um modelo ER é um modelo de dados usado para descrever os objetos e relacionamentos em um banco de dados."},
    {"id": 288, "text": "Pergunta: O que é a cláusula CASCADE em SQL? Resposta: A cláusula CASCADE é usada para especificar a ação que deve ocorrer quando uma operação afeta uma tabela ou visualização relacionada."},
    {"id": 289, "text": "Pergunta: O que é a cláusula IN em SQL? Resposta: A cláusula IN é usada para verificar se um valor especificado corresponde a qualquer valor em uma lista de valores ou subconsulta."},
    {"id": 290, "text": "Pergunta: O que é a cláusula EXISTS em SQL? Resposta: A cláusula EXISTS é usada para testar a existência de quaisquer registros em uma subconsulta e retorna true se a subconsulta retornar um ou mais registros."},
    {"id": 291, "text": "Pergunta: O que é o modelo relacional em SQL? Resposta: O modelo relacional é um modelo de dados que organiza os dados em tabelas (relações), onde cada linha contém um único registro e cada coluna representa um atributo desse registro."},
    {"id": 292, "text": "Pergunta: O que é a normalização de banco de dados em SQL? Resposta: A normalização de banco de dados é o processo de projetar um banco de dados para reduzir a redundância de dados e garantir a integridade dos dados."},
    {"id": 293, "text": "Pergunta: O que é o DDL em SQL? Resposta: DDL (Data Definition Language) é uma parte da SQL que permite definir e modificar estruturas de objetos no banco de dados, como tabelas e índices."},
    {"id": 294, "text": "Pergunta: O que é o DML em SQL? Resposta: DML (Data Manipulation Language) é uma parte da SQL usada para inserir, atualizar, deletar e recuperar dados de um banco de dados."},
    {"id": 295, "text": "Pergunta: O que é o DCL em SQL? Resposta: DCL (Data Control Language) é uma parte da SQL usada para gerenciar permissões e acessos aos objetos do banco de dados."},
    {"id": 296, "text": "Pergunta: O que é o TCL em SQL? Resposta: TCL (Transaction Control Language) é uma parte da SQL usada para gerenciar transações em um banco de dados, como COMMIT e ROLLBACK."},
    {"id": 297, "text": "Pergunta: O que é a chave estrangeira (foreign key) em SQL? Resposta: Uma chave estrangeira é um campo em uma tabela que se refere à chave primária de outra tabela, estabelecendo assim um relacionamento entre as duas tabelas."},
    {"id": 298, "text": "Pergunta: O que é a chave candidata em SQL? Resposta: Uma chave candidata é um conjunto de um ou mais campos que podem ser usados para identificar de forma única cada registro em uma tabela."},
    {"id": 299, "text": "Pergunta: O que é a cardinalidade em SQL? Resposta: A cardinalidade em SQL refere-se ao número de entidades filhas que podem estar associadas a uma única entidade pai em um relacionamento."},
    {"id": 300, "text": "Pergunta: O que é a normalização de terceira forma (3NF) em SQL? Resposta: A normalização de terceira forma (3NF) é um processo no qual uma tabela de banco de dados é dividida em tabelas menores para reduzir a redundância de dados e melhorar a integridade dos dados."},
    {"id": 301, "text": "Pergunta: O que é o modelo entidade-relacionamento estendido (EER) em SQL? Resposta: O modelo EER é uma extensão do modelo ER que inclui conceitos adicionais como herança e generalização para representar relacionamentos mais complexos entre entidades."},
    {"id": 302, "text": "Pergunta: O que é a normalização de segunda forma (2NF) em SQL? Resposta: A normalização de segunda forma (2NF) é um processo no qual uma tabela de banco de dados é organizada para garantir que todos os atributos não chave dependam completamente da chave primária."},
    {"id": 303, "text": "Pergunta: O que é a normalização de primeira forma (1NF) em SQL? Resposta: A normalização de primeira forma (1NF) é o processo de organizar dados em uma tabela de modo que não haja valores repetidos ou grupos de valores repetidos em qualquer campo."},
    {"id": 304, "text": "Pergunta: O que é o SQL injection? Resposta: O SQL injection é uma vulnerabilidade de segurança que ocorre quando um invasor insere código SQL malicioso em uma entrada de um aplicativo web, aproveitando falhas na validação de entrada de dados."},
    {"id": 305, "text": "Pergunta: O que são transações ACID em SQL? Resposta: ACID é um acrônimo para Atomicidade, Consistência, Isolamento e Durabilidade, princípios que garantem a integridade e confiabilidade das transações em um banco de dados."},
    {"id": 306, "text": "Pergunta: O que é o comando SELECT em SQL? Resposta: O comando SELECT é usado para recuperar dados de uma ou mais tabelas em um banco de dados."},
    {"id": 307, "text": "Pergunta: O que é o comando INSERT em SQL? Resposta: O comando INSERT é usado para adicionar novos registros a uma tabela existente em um banco de dados."},
    {"id": 308, "text": "Pergunta: O que é o comando UPDATE em SQL? Resposta: O comando UPDATE é usado para modificar os registros existentes em uma tabela de banco de dados."},
    {"id": 309, "text": "Pergunta: O que é o comando DELETE em SQL? Resposta: O comando DELETE é usado para remover registros de uma tabela de banco de dados."},
    {"id": 310, "text": "Pergunta: O que é o comando CREATE TABLE em SQL? Resposta: O comando CREATE TABLE é usado para criar uma nova tabela em um banco de dados."},
    {"id": 311, "text": "Pergunta: O que é o comando DROP TABLE em SQL? Resposta: O comando DROP TABLE é usado para excluir uma tabela existente de um banco de dados."},
    {"id": 312, "text": "Pergunta: O que é o comando ALTER TABLE em SQL? Resposta: O comando ALTER TABLE é usado para modificar a estrutura de uma tabela existente no banco de dados."},
    {"id": 313, "text": "Pergunta: O que é o comando CREATE INDEX em SQL? Resposta: O comando CREATE INDEX é usado para criar um índice em uma tabela, o que melhora a velocidade de recuperação de dados em consultas."},
    {"id": 314, "text": "Pergunta: O que é o comando DROP INDEX em SQL? Resposta: O comando DROP INDEX é usado para remover um índice existente de uma tabela no banco de dados."},
    {"id": 315, "text": "Pergunta: O que é o comando CREATE VIEW em SQL? Resposta: O comando CREATE VIEW é usado para criar uma visão (view) em um banco de dados, que é uma consulta armazenada como um objeto virtual."},
    {"id": 316, "text": "Pergunta: O que é o comando DROP VIEW em SQL? Resposta: O comando DROP VIEW é usado para excluir uma visão existente de um banco de dados."},
    {"id": 317, "text": "Pergunta: O que são gatilhos (triggers) de antes e depois em SQL? Resposta: Gatilhos de antes (BEFORE) são acionados antes de uma operação em uma tabela, enquanto gatilhos de depois (AFTER) são acionados após uma operação."},
    {"id": 318, "text": "Pergunta: O que é a cláusula FULL OUTER JOIN em SQL? Resposta: A cláusula FULL OUTER JOIN é usada para combinar todas as linhas de duas tabelas, mesmo que não haja correspondência entre elas."},
    {"id": 319, "text": "Pergunta: O que é a cláusula CROSS JOIN em SQL? Resposta: A cláusula CROSS JOIN é usada para produzir o produto cartesiano de duas tabelas, ou seja, todas as combinações possíveis entre os registros das tabelas."},
    {"id": 320, "text": "Pergunta: O que é a cláusula NATURAL JOIN em SQL? Resposta: A cláusula NATURAL JOIN é usada para combinar duas tabelas usando colunas com nomes idênticos automaticamente."},
    {"id": 321, "text": "Pergunta: O que é a cláusula SELF JOIN em SQL? Resposta: A cláusula SELF JOIN é usada para fazer uma junção de uma tabela consigo mesma, geralmente usando um alias para distingui-las."},
    {"id": 322, "text": "Pergunta: O que são procedimentos armazenados (stored procedures) em SQL? Resposta: Procedimentos armazenados são conjuntos de instruções SQL nomeadas e armazenadas no banco de dados para serem reutilizadas."},
    {"id": 323, "text": "Pergunta: O que são funções definidas pelo usuário (user-defined functions) em SQL? Resposta: Funções definidas pelo usuário são funções criadas pelo usuário para realizar operações específicas que podem ser reutilizadas em consultas SQL."},
    {"id": 324, "text": "Pergunta: O que são cursores explícitos em SQL? Resposta: Cursores explícitos são objetos que permitem percorrer e processar linhas de uma tabela em um banco de dados de forma controlada pelo programador."},
    {"id": 325, "text": "Pergunta: O que são índices únicos (unique indexes) em SQL? Resposta: Índices únicos garantem que todos os valores em uma coluna ou conjunto de colunas de uma tabela sejam exclusivos, o que impede a inserção de duplicatas."},
    {"id": 326, "text": "Pergunta: O que são transações aninhadas em SQL? Resposta: Transações aninhadas permitem iniciar uma transação dentro de outra transação, com a possibilidade de confirmar ou reverter alterações feitas somente na transação interna."},
    {"id": 327, "text": "Pergunta: O que é a cláusula UNION ALL em SQL? Resposta: A cláusula UNION ALL é semelhante à cláusula UNION, mas retorna todas as linhas de ambas as consultas, incluindo duplicatas."},
    {"id": 328, "text": "Pergunta: O que é a cláusula INTERSECT em SQL? Resposta: A cláusula INTERSECT é usada para combinar o resultado de duas consultas SQL, retornando apenas os registros que estão presentes em ambas as consultas."},
    {"id": 329, "text": "Pergunta: O que é a cláusula EXCEPT em SQL? Resposta: A cláusula EXCEPT é usada para combinar o resultado de duas consultas SQL, retornando apenas os registros que estão presentes na primeira consulta e não na segunda."},
    {"id": 330, "text": "Pergunta: O que é a cláusula MERGE em SQL? Resposta: A cláusula MERGE é usada para realizar operações INSERT, UPDATE ou DELETE em uma tabela de destino com base em uma condição de junção especificada."},
    {"id": 331, "text": "Pergunta: O que é a cláusula WITH em SQL? Resposta: A cláusula WITH, também conhecida como Common Table Expressions (CTE), permite definir subconsultas temporárias que podem ser usadas em uma consulta principal."},
    {"id": 332, "text": "Pergunta: O que é o operador UNION em SQL? Resposta: O operador UNION é usado para combinar o resultado de duas ou mais consultas SQL em um único conjunto de resultados, excluindo duplicatas automaticamente."},
    {"id": 333, "text": "Pergunta: O que é o operador UNION ALL em SQL? Resposta: O operador UNION ALL é usado para combinar o resultado de duas ou mais consultas SQL em um único conjunto de resultados, incluindo todas as linhas, inclusive duplicatas."},
    {"id": 334, "text": "Pergunta: O que são tabelas temporárias em SQL? Resposta: Tabelas temporárias são tabelas que existem apenas durante a sessão de usuário atual e são automaticamente descartadas quando a sessão é encerrada."},
    {"id": 335, "text": "Pergunta: O que são tabelas globais temporárias em SQL? Resposta: Tabelas globais temporárias são tabelas temporárias que estão disponíveis para todas as sessões de usuário e são descartadas quando a última sessão que as utiliza é encerrada."},
    {"id": 336, "text": "Pergunta: O que são comandos SAVEPOINT em SQL? Resposta: Comandos SAVEPOINT são usados para definir pontos de salvamento dentro de uma transação, permitindo desfazer partes específicas de uma transação."},
    {"id": 337, "text": "Pergunta: O que é o modelo lógico de dados em SQL? Resposta: O modelo lógico de dados em SQL descreve como os dados estão organizados e relacionados em um banco de dados relacional, usando tabelas, chaves e relacionamentos."},
    {"id": 338, "text": "Pergunta: O que é a modelagem de dados em SQL? Resposta: A modelagem de dados em SQL é o processo de criar um modelo de dados que descreve a estrutura de um banco de dados e as relações entre seus elementos."},
    {"id": 339, "text": "Pergunta: O que é a cláusula ROW_NUMBER() em SQL? Resposta: A cláusula ROW_NUMBER() é uma função analítica que atribui um número sequencial a cada linha de um conjunto de resultados, de acordo com a ordenação especificada."},
    {"id": 340, "text": "Pergunta: O que são dados semiestruturados em SQL? Resposta: Dados semiestruturados em SQL são dados que não seguem uma estrutura de tabela tradicional, como documentos XML, JSON ou outros formatos não relacionais."},
    {"id": 341, "text": "Pergunta: O que é a linguagem de definição de dados (DDL) em SQL? Resposta: A linguagem de definição de dados (DDL) em SQL é usada para definir a estrutura de objetos de banco de dados, como tabelas, índices e visões."},
    {"id": 342, "text": "Pergunta: O que é a linguagem de manipulação de dados (DML) em SQL? Resposta: A linguagem de manipulação de dados (DML) em SQL é usada para manipular (inserir, atualizar, excluir) os dados dentro de objetos de banco de dados."},
    {"id": 343, "text": "Pergunta: O que é a linguagem de controle de dados (DCL) em SQL? Resposta: A linguagem de controle de dados (DCL) em SQL é usada para gerenciar permissões e acessos aos objetos de banco de dados."},
    {"id": 344, "text": "Pergunta: O que é a linguagem de transação de controle (TCL) em SQL? Resposta: A linguagem de transação de controle (TCL) em SQL é usada para gerenciar transações dentro de um banco de dados, incluindo operações como COMMIT e ROLLBACK."},
    {"id": 345, "text": "Pergunta: O que é a função COUNT() em SQL? Resposta: A função COUNT() em SQL é usada para contar o número de linhas retornadas por uma consulta."},
    {"id": 346, "text": "Pergunta: O que é a função SUM() em SQL? Resposta: A função SUM() em SQL é usada para calcular a soma dos valores de uma coluna numérica em um conjunto de resultados."},
    {"id": 347, "text": "Pergunta: O que é a função AVG() em SQL? Resposta: A função AVG() em SQL é usada para calcular a média dos valores de uma coluna numérica em um conjunto de resultados."},
    {"id": 348, "text": "Pergunta: O que é a função MAX() em SQL? Resposta: A função MAX() em SQL é usada para retornar o valor máximo de uma coluna em um conjunto de resultados."},
    {"id": 349, "text": "Pergunta: O que é a função MIN() em SQL? Resposta: A função MIN() em SQL é usada para retornar o valor mínimo de uma coluna em um conjunto de resultados."},
    {"id": 350, "text": "Pergunta: O que é a função UPPER() em SQL? Resposta: A função UPPER() em SQL é usada para converter todos os caracteres de uma string em maiúsculas."},
    {"id": 351, "text": "Pergunta: O que é a função LOWER() em SQL? Resposta: A função LOWER() em SQL é usada para converter todos os caracteres de uma string em minúsculas."},
    {"id": 352, "text": "Pergunta: O que é a função SUBSTRING() em SQL? Resposta: A função SUBSTRING() em SQL é usada para extrair uma parte de uma string com base em uma posição inicial e um número de caracteres especificado."},
    {"id": 353, "text": "Pergunta: O que é a função CONCAT() em SQL? Resposta: A função CONCAT() em SQL é usada para concatenar duas ou mais strings em uma única string."},
    {"id": 354, "text": "Pergunta: O que é a função DATE_FORMAT() em SQL? Resposta: A função DATE_FORMAT() em SQL é usada para formatar uma data e hora de acordo com um formato especificado."},
    {"id": 355, "text": "Pergunta: O que é a função GETDATE() em SQL? Resposta: A função GETDATE() em SQL é usada para retornar a data e hora atuais do sistema."},
    {"id": 356, "text": "Pergunta: O que é a função DATEDIFF() em SQL? Resposta: A função DATEDIFF() em SQL é usada para calcular a diferença entre duas datas, em termos de tempo ou intervalo especificado."},
    {"id": 357, "text": "Pergunta: O que é a função COALESCE() em SQL? Resposta: A função COALESCE() em SQL é usada para retornar o primeiro valor não nulo em uma lista de expressões."},
    {"id": 358, "text": "Pergunta: O que é a função CASE WHEN em SQL? Resposta: A função CASE WHEN em SQL é usada para realizar avaliações condicionais dentro de uma consulta, semelhante a uma instrução IF-THEN-ELSE em outras linguagens de programação."},
    {"id": 359, "text": "Pergunta: O que é a função ROW_NUMBER() em SQL? Resposta: A função ROW_NUMBER() em SQL é uma função analítica que atribui um número sequencial a cada linha de um conjunto de resultados, de acordo com a ordenação especificada."},
    {"id": 360, "text": "Pergunta: O que é a função RANK() em SQL? Resposta: A função RANK() em SQL é uma função analítica que atribui uma classificação a cada linha de um conjunto de resultados, com lacunas possíveis na classificação se houver valores iguais."},
    {"id": 361, "text": "Pergunta: O que é a função DENSE_RANK() em SQL? Resposta: A função DENSE_RANK() em SQL é uma função analítica que atribui uma classificação a cada linha de um conjunto de resultados, sem lacunas na classificação se houver valores iguais."},
    {"id": 362, "text": "Pergunta: O que é a função NTILE() em SQL? Resposta: A função NTILE() em SQL é uma função analítica que divide um conjunto de resultados em 'níveis' ou 'baldes' com aproximadamente o mesmo número de linhas, atribuindo um número para cada 'balde'. "},
    {"id": 363, "text": "Pergunta: O que é a função LEAD() em SQL? Resposta: A função LEAD() em SQL é uma função analítica que permite acessar o próximo valor em um conjunto de resultados sem usar uma subconsulta."},
    {"id": 364, "text": "Pergunta: O que é a função LAG() em SQL? Resposta: A função LAG() em SQL é uma função analítica que permite acessar o valor anterior em um conjunto de resultados sem usar uma subconsulta."},
    {"id": 365, "text": "Pergunta: O que é a função FIRST_VALUE() em SQL? Resposta: A função FIRST_VALUE() em SQL é uma função analítica que retorna o primeiro valor em um conjunto de resultados de acordo com a cláusula ORDER BY especificada."},
    {"id": 366, "text": "Pergunta: O que é a função LAST_VALUE() em SQL? Resposta: A função LAST_VALUE() em SQL é uma função analítica que retorna o último valor em um conjunto de resultados de acordo com a cláusula ORDER BY especificada."},
    {"id": 367, "text": "Pergunta: O que é a função WINDOW() em SQL? Resposta: A função WINDOW() em SQL é usada para definir uma janela (window) para funções analíticas, especificando a ordem e o tamanho da janela sobre a qual a função será calculada."},
    {"id": 368, "text": "Pergunta: O que é a função CURRENT_TIMESTAMP em SQL? Resposta: A função CURRENT_TIMESTAMP em SQL retorna a data e hora atuais no formato de data e hora do sistema."},
    {"id": 369, "text": "Pergunta: O que são operadores de comparação em SQL? Resposta: Os operadores de comparação em SQL são usados para comparar valores em expressões SQL. Alguns exemplos incluem = (igual a), > (maior que), < (menor que), >= (maior ou igual a) e <= (menor ou igual a)."},
    {"id": 370, "text": "Pergunta: O que são operadores lógicos em SQL? Resposta: Os operadores lógicos em SQL são usados para combinar condições em consultas SQL. Alguns exemplos incluem AND, OR e NOT."},
    {"id": 371, "text": "Pergunta: O que são operadores de aritmética em SQL? Resposta: Os operadores de aritmética em SQL são usados para realizar operações matemáticas em valores numéricos. Alguns exemplos incluem + (adição), - (subtração), * (multiplicação) e / (divisão)."},
    {"id": 372, "text": "Pergunta: O que são funções de data e hora em SQL? Resposta: As funções de data e hora em SQL são usadas para manipular dados de data e hora em consultas SQL. Exemplos incluem DATE_FORMAT(), DATE_ADD(), DATE_SUB() e outras funções relacionadas."},
    {"id": 373, "text": "Pergunta: O que são funções de string em SQL? Resposta: As funções de string em SQL são usadas para manipular strings de caracteres em consultas SQL. Exemplos incluem CONCAT(), UPPER(), LOWER(), SUBSTRING() e outras funções relacionadas."},
    {"id": 374, "text": "Pergunta: O que é a função de agregação em SQL? Resposta: A função de agregação em SQL é usada para realizar cálculos em um conjunto de valores e retornar um único valor resumido. Exemplos incluem SUM(), AVG(), COUNT(), MIN() e MAX()."},
    {"id": 375, "text": "Pergunta: O que são subconsultas (subqueries) em SQL? Resposta: Subconsultas são consultas SQL aninhadas dentro de uma consulta principal, usadas para retornar um conjunto de resultados que é usado na condição de outra consulta."},
    {"id": 376, "text": "Pergunta: O que são junções (joins) em SQL? Resposta: Junções são usadas para combinar dados de duas ou mais tabelas em um único conjunto de resultados com base em uma condição de junção especificada."},
    {"id": 377, "text": "Pergunta: O que é a normalização de terceira forma (3NF) em SQL? Resposta: A normalização de terceira forma (3NF) é um processo no qual uma tabela de banco de dados é projetada para reduzir a duplicação de dados e melhorar a integridade dos dados."},
    {"id": 378, "text": "Pergunta: O que é a normalização de Boyce-Codd (BCNF) em SQL? Resposta: A normalização de Boyce-Codd (BCNF) é uma forma mais restrita de normalização que garante que cada dependência funcional seja uma chave candidata."},
    {"id": 379, "text": "Pergunta: O que é a chave primária composta em SQL? Resposta: Uma chave primária composta é uma chave primária que consiste em mais de um campo, sendo usada para identificar de forma exclusiva cada registro em uma tabela."},
    {"id": 380, "text": "Pergunta: O que é a chave estrangeira composta em SQL? Resposta: Uma chave estrangeira composta é uma chave estrangeira que consiste em mais de um campo, sendo usada para estabelecer um relacionamento entre várias tabelas."},
    {"id": 381, "text": "Pergunta: O que é a chave candidata composta em SQL? Resposta: Uma chave candidata composta é um conjunto de campos que podem ser usados para identificar de forma exclusiva cada registro em uma tabela, semelhante a uma chave primária."},
    {"id": 382, "text": "Pergunta: O que é a cardinalidade um para um (1:1) em SQL? Resposta: A cardinalidade um para um (1:1) em SQL refere-se a um relacionamento entre tabelas onde cada registro de uma tabela está associado a no máximo um registro da outra tabela e vice-versa."},
    {"id": 383, "text": "Pergunta: O que é a cardinalidade um para muitos (1:N) em SQL? Resposta: A cardinalidade um para muitos (1:N) em SQL refere-se a um relacionamento entre tabelas onde cada registro de uma tabela pode estar associado a vários registros na outra tabela, mas cada registro na segunda tabela está associado a no máximo um registro na primeira tabela."},
    {"id": 384, "text": "Pergunta: O que é a cardinalidade muitos para muitos (N:M) em SQL? Resposta: A cardinalidade muitos para muitos (N:M) em SQL refere-se a um relacionamento entre tabelas onde vários registros de uma tabela podem estar associados a vários registros da outra tabela."},
    {"id": 385, "text": "Pergunta: O que é a cardinalidade zero para um (0:1) em SQL? Resposta: A cardinalidade zero para um (0:1) em SQL refere-se a um relacionamento opcional entre tabelas onde um registro na tabela relacionada pode não ter um correspondente na outra tabela, mas se houver, é no máximo um."},
    {"id": 386, "text": "Pergunta: O que é a cardinalidade zero para muitos (0:N) em SQL? Resposta: A cardinalidade zero para muitos (0:N) em SQL refere-se a um relacionamento onde um registro na tabela relacionada pode não ter nenhum, um ou vários correspondentes na outra tabela."},
    {"id": 387, "text": "Pergunta: O que é a cardinalidade um para um obrigatório (1:1) em SQL? Resposta: A cardinalidade um para um obrigatório (1:1) em SQL refere-se a um relacionamento onde cada registro de uma tabela está associado a exatamente um registro da outra tabela e vice-versa."},
    {"id": 388, "text": "Pergunta: O que é a cardinalidade um para muitos obrigatório (1:N) em SQL? Resposta: A cardinalidade um para muitos obrigatório (1:N) em SQL refere-se a um relacionamento onde cada registro de uma tabela está associado a pelo menos um registro na outra tabela, mas pode estar associado a vários."},
    {"id": 389, "text": "Pergunta: O que é a cardinalidade muitos para muitos obrigatório (N:M) em SQL? Resposta: A cardinalidade muitos para muitos obrigatório (N:M) em SQL refere-se a um relacionamento onde vários registros de uma tabela estão associados a vários registros da outra tabela, e ambos os lados do relacionamento são obrigatórios."},
    {"id": 390, "text": "Pergunta: O que são dependências funcionais em SQL? Resposta: Dependências funcionais em SQL são restrições que especificam a relação entre duas ou mais colunas em uma tabela, onde o valor de uma coluna determina o valor de outra coluna."},
    {"id": 391, "text": "Pergunta: O que é a integridade referencial em SQL? Resposta: A integridade referencial em SQL é a garantia de que as relações entre tabelas são consistentes e válidas, com base em chaves estrangeiras e chaves primárias."},
    {"id": 392, "text": "Pergunta: O que é o diagrama de entidade-relacionamento (ERD) em SQL? Resposta: O diagrama de entidade-relacionamento (ERD) em SQL é uma representação visual das entidades (tabelas), atributos (colunas) e relacionamentos entre elas em um banco de dados."},
    {"id": 393, "text": "Pergunta: O que é o modelo relacional em SQL? Resposta: O modelo relacional em SQL é um modelo de dados que organiza informações em tabelas (relações) e colunas (atributos), permitindo a criação de relações entre essas tabelas."},
    {"id": 394, "text": "Pergunta: O que é a normalização em SQL? Resposta: A normalização em SQL é o processo de organizar dados em um banco de dados relacional para reduzir a redundância e melhorar a integridade dos dados."},
    {"id": 395, "text": "Pergunta: O que é a desnormalização em SQL? Resposta: A desnormalização em SQL é o processo de adicionar redundância aos dados de um banco de dados relacional para melhorar o desempenho das consultas."},
    {"id": 396, "text": "Pergunta: O que são SQL views (visualizações)? Resposta: SQL views (visualizações) são consultas salvas como objetos de banco de dados que podem ser referenciados e consultados como tabelas reais. Eles podem ser usados para ocultar a complexidade dos dados subjacentes e fornecer uma visão específica dos dados."},
    {"id": 397, "text": "Pergunta: O que é a otimização de consultas em SQL? Resposta: A otimização de consultas em SQL é o processo de projetar consultas SQL de maneira que sejam executadas de maneira eficiente, minimizando o tempo de resposta e maximizando o desempenho do banco de dados."},
    {"id": 398, "text": "Pergunta: O que são índices em SQL? Resposta: Índices em SQL são estruturas de dados usadas para melhorar a velocidade de recuperação de dados de uma tabela. Eles funcionam como um índice de um livro, permitindo que o banco de dados localize rapidamente os registros em uma consulta."},
    {"id": 399, "text": "Pergunta: O que é a cláusula WHERE em SQL? Resposta: A cláusula WHERE em SQL é usada para filtrar registros em uma consulta com base em uma condição especificada."},
    {"id": 400, "text": "Pergunta: O que é a cláusula ORDER BY em SQL? Resposta: A cláusula ORDER BY em SQL é usada para classificar os resultados de uma consulta de acordo com uma ou mais colunas, em ordem ascendente ou descendente."},
    {"id": 401, "text": "Pergunta: O que é a cláusula GROUP BY em SQL? Resposta: A cláusula GROUP BY em SQL é usada para agrupar registros que têm o mesmo valor em uma ou mais colunas e permitir a aplicação de funções de agregação aos grupos resultantes."},
    {"id": 402, "text": "Pergunta: O que é a cláusula HAVING em SQL? Resposta: A cláusula HAVING em SQL é usada para filtrar grupos de registros agrupados retornados pela cláusula GROUP BY com base em uma condição especificada."},
    {"id": 403, "text": "Pergunta: O que é a cláusula DISTINCT em SQL? Resposta: A cláusula DISTINCT em SQL é usada para retornar apenas valores únicos em uma consulta de conjunto de resultados."},
    {"id": 404, "text": "Pergunta: O que é a cláusula UNION em SQL? Resposta: A cláusula UNION em SQL é usada para combinar o resultado de duas ou mais consultas SQL em um único conjunto de resultados, excluindo duplicatas."},
    {"id": 405, "text": "Pergunta: O que é a cláusula UNION ALL em SQL? Resposta: A cláusula UNION ALL em SQL é usada para combinar o resultado de duas ou mais consultas SQL em um único conjunto de resultados, incluindo todas as linhas, inclusive duplicatas."},
    {"id": 406, "text": "Pergunta: O que é a cláusula JOIN em SQL? Resposta: A cláusula JOIN em SQL é usada para combinar dados de duas ou mais tabelas com base em uma condição de junção específica."},
    {"id": 407, "text": "Pergunta: O que é a cláusula LEFT JOIN em SQL? Resposta: A cláusula LEFT JOIN em SQL é usada para retornar todos os registros da tabela da esquerda e os registros correspondentes da tabela da direita, onde a condição de junção é atendida. Se não houver correspondência, retorna nulo para as colunas da tabela da direita."},
    {"id": 408, "text": "Pergunta: O que é a cláusula RIGHT JOIN em SQL? Resposta: A cláusula RIGHT JOIN em SQL é usada para retornar todos os registros da tabela da direita e os registros correspondentes da tabela da esquerda, onde a condição de junção é atendida. Se não houver correspondência, retorna nulo para as colunas da tabela da esquerda."},
    {"id": 409, "text": "Pergunta: O que é a cláusula INNER JOIN em SQL? Resposta: A cláusula INNER JOIN em SQL é usada para retornar registros quando houver pelo menos uma correspondência em ambas as tabelas envolvidas na junção."},
    {"id": 410, "text": "Pergunta: O que é a cláusula CROSS JOIN em SQL? Resposta: A cláusula CROSS JOIN em SQL é usada para produzir o produto cartesiano de duas ou mais tabelas, combinando cada linha da tabela da esquerda com cada linha da tabela da direita."},
    {"id": 411, "text": "Pergunta: O que é a cláusula SELF JOIN em SQL? Resposta: A cláusula SELF JOIN em SQL é usada para combinar uma tabela consigo mesma, como se a tabela fosse duas tabelas diferentes, mas com nomes de alias diferentes."},
    {"id": 412, "text": "Pergunta: O que é a cláusula NATURAL JOIN em SQL? Resposta: A cláusula NATURAL JOIN em SQL é usada para combinar tabelas usando colunas com o mesmo nome e tipo de dados, com base em uma condição de igualdade automática."},
    {"id": 413, "text": "Pergunta: O que é a cláusula USING em SQL? Resposta: A cláusula USING em SQL é usada com a cláusula JOIN para especificar colunas usadas para coincidir entre tabelas, evitando a duplicação de colunas em tabelas combinadas."},
    {"id": 414, "text": "Pergunta: O que é a cláusula INSERT INTO em SQL? Resposta: A cláusula INSERT INTO em SQL é usada para adicionar novos registros a uma tabela existente."},
    {"id": 415, "text": "Pergunta: O que é a cláusula UPDATE em SQL? Resposta: A cláusula UPDATE em SQL é usada para modificar os registros existentes em uma tabela."},
    {"id": 416, "text": "Pergunta: O que é a cláusula DELETE em SQL? Resposta: A cláusula DELETE em SQL é usada para remover registros existentes de uma tabela."},
    {"id": 417, "text": "Pergunta: O que é a cláusula TRUNCATE TABLE em SQL? Resposta: A cláusula TRUNCATE TABLE em SQL é usada para remover todos os registros de uma tabela, mas não para remover a estrutura da tabela."},
    {"id": 418, "text": "Pergunta: O que é a cláusula CREATE TABLE em SQL? Resposta: A cláusula CREATE TABLE em SQL é usada para criar uma nova tabela em um banco de dados."},
    {"id": 419, "text": "Pergunta: O que é a cláusula ALTER TABLE em SQL? Resposta: A cláusula ALTER TABLE em SQL é usada para modificar a estrutura de uma tabela existente no banco de dados."},
    {"id": 420, "text": "Pergunta: O que é a cláusula DROP TABLE em SQL? Resposta: A cláusula DROP TABLE em SQL é usada para remover uma tabela existente de um banco de dados."},
    {"id": 421, "text": "Pergunta: O que é a cláusula CREATE INDEX em SQL? Resposta: A cláusula CREATE INDEX em SQL é usada para criar um índice em uma tabela existente no banco de dados, melhorando a velocidade de recuperação de dados."},
    {"id": 422, "text": "Pergunta: O que é a cláusula DROP INDEX em SQL? Resposta: A cláusula DROP INDEX em SQL é usada para remover um índice existente de uma tabela no banco de dados."},
    {"id": 423, "text": "Pergunta: O que é a cláusula CREATE VIEW em SQL? Resposta: A cláusula CREATE VIEW em SQL é usada para criar uma nova visualização (view) no banco de dados a partir de uma consulta existente."},
    {"id": 424, "text": "Pergunta: O que é a cláusula DROP VIEW em SQL? Resposta: A cláusula DROP VIEW em SQL é usada para remover uma visualização (view) existente do banco de dados."},
    {"id": 425, "text": "Pergunta: O que é a cláusula GRANT em SQL? Resposta: A cláusula GRANT em SQL é usada para conceder permissões de acesso a objetos de banco de dados a usuários e funções."},
    {"id": 426, "text": "Pergunta: O que é a cláusula REVOKE em SQL? Resposta: A cláusula REVOKE em SQL é usada para revogar permissões previamente concedidas a usuários e funções."},
    {"id": 427, "text": "Pergunta: O que é a cláusula COMMIT em SQL? Resposta: A cláusula COMMIT em SQL é usada para salvar todas as transações ativas no banco de dados."},
    {"id": 428, "text": "Pergunta: O que é a cláusula ROLLBACK em SQL? Resposta: A cláusula ROLLBACK em SQL é usada para desfazer transações não salvas no banco de dados."},
    {"id": 429, "text": "Pergunta: O que é a cláusula SAVEPOINT em SQL? Resposta: A cláusula SAVEPOINT em SQL é usada para marcar um ponto específico em uma transação, permitindo que você retorne a esse ponto posteriormente usando a cláusula ROLLBACK."},
    {"id": 430, "text": "Pergunta: O que são índices primários em SQL? Resposta: Índices primários em SQL são índices usados para identificar exclusivamente cada linha em uma tabela, acelerando a pesquisa de registros."},
    {"id": 431, "text": "Pergunta: O que são índices secundários em SQL? Resposta: Índices secundários em SQL são índices usados para acelerar a pesquisa de registros com base em colunas que não são chaves primárias, permitindo consultas mais rápidas além das consultas por chave primária."},
    {"id": 432, "text": "Pergunta: O que são índices exclusivos em SQL? Resposta: Índices exclusivos em SQL são índices usados para garantir que nenhum valor de chave duplicada seja inserido em uma coluna, além de acelerar a pesquisa de registros."},
    {"id": 433, "text": "Pergunta: O que é a cláusula CHECK em SQL? Resposta: A cláusula CHECK em SQL é usada para impor condições específicas em uma coluna de uma tabela, garantindo que somente valores válidos sejam inseridos."},
    {"id": 434, "text": "Pergunta: O que é a cláusula DEFAULT em SQL? Resposta: A cláusula DEFAULT em SQL é usada para atribuir um valor padrão a uma coluna quando nenhum valor é especificado durante a inserção de um registro."},
    {"id": 435, "text": "Pergunta: O que é a cláusula PRIMARY KEY em SQL? Resposta: A cláusula PRIMARY KEY em SQL é usada para definir uma chave primária em uma tabela, garantindo que cada linha seja exclusiva e identificável de maneira única."},
    {"id": 436, "text": "Pergunta: O que é a cláusula FOREIGN KEY em SQL? Resposta: A cláusula FOREIGN KEY em SQL é usada para criar e impor um relacionamento entre duas tabelas, referenciando a chave primária de uma tabela em outra tabela como chave estrangeira."},
    {"id": 437, "text": "Pergunta: O que é a cláusula UNIQUE em SQL? Resposta: A cláusula UNIQUE em SQL é usada para garantir que todos os valores em uma coluna (ou um conjunto de colunas) sejam únicos em uma tabela, permitindo valores nulos, mas apenas um valor nulo."},
    {"id": 438, "text": "Pergunta: O que são procedimentos armazenados (stored procedures) em SQL? Resposta: Procedimentos armazenados (stored procedures) em SQL são blocos de código SQL que podem ser salvos e reutilizados no banco de dados para realizar uma ou várias operações específicas."},
    {"id": 439, "text": "Pergunta: O que são funções definidas pelo usuário (user-defined functions - UDFs) em SQL? Resposta: Funções definidas pelo usuário (user-defined functions - UDFs) em SQL são funções personalizadas criadas pelo usuário para realizar operações específicas no banco de dados."},
    {"id": 440, "text": "Pergunta: O que é a cláusula CASE em SQL? Resposta: A cláusula CASE em SQL é usada para fornecer lógica condicional em consultas SQL, semelhante a uma instrução if-else em muitas linguagens de programação."},
    {"id": 441, "text": "Pergunta: O que é a cláusula IF em SQL? Resposta: A cláusula IF em SQL não existe como uma instrução separada. No entanto, a lógica condicional pode ser implementada usando a cláusula CASE em consultas SQL."},
    {"id": 442, "text": "Pergunta: O que é a função COALESCE em SQL? Resposta: A função COALESCE em SQL é usada para retornar o primeiro valor não nulo em um conjunto de valores separados, seguindo a ordem dos argumentos especificados."},
    {"id": 443, "text": "Pergunta: O que é a função NULLIF em SQL? Resposta: A função NULLIF em SQL é usada para retornar nulo se dois argumentos forem iguais e o primeiro argumento não for nulo; caso contrário, retorna o primeiro argumento."},
    {"id": 444, "text": "Pergunta: O que é a função CASE em SQL? Resposta: A função CASE em SQL é usada para fornecer lógica condicional em consultas SQL, permitindo que você especifique um ou mais blocos de código a serem executados com base em uma condição específica."},
    {"id": 445, "text": "Pergunta: O que é a função CONCAT em SQL? Resposta: A função CONCAT em SQL é usada para concatenar duas ou mais strings de caracteres em uma única string, combinando-as em ordem."},
    {"id": 446, "text": "Pergunta: O que é a função SUBSTRING em SQL? Resposta: A função SUBSTRING em SQL é usada para extrair uma parte de uma string de caracteres com base em uma posição inicial e um comprimento especificados."},
    {"id": 447, "text": "Pergunta: O que é a função LEN em SQL? Resposta: A função LEN em SQL é usada para retornar o comprimento de uma string de caracteres especificada, incluindo todos os espaços e caracteres."},
    {"id": 448, "text": "Pergunta: O que é a função REPLACE em SQL? Resposta: A função REPLACE em SQL é usada para substituir todas as ocorrências de uma substring em uma string por outra substring especificada."},
    {"id": 449, "text": "Pergunta: O que é a função UPPER em SQL? Resposta: A função UPPER em SQL é usada para converter todos os caracteres de uma string em maiúsculas."},
    {"id": 450, "text": "Pergunta: O que é a função LOWER em SQL? Resposta: A função LOWER em SQL é usada para converter todos os caracteres de uma string em minúsculas."},
    {"id": 451, "text": "Pergunta: O que é a função TRIM em SQL? Resposta: A função TRIM em SQL é usada para remover espaços em branco do início e do final de uma string de caracteres."},
    {"id": 452, "text": "Pergunta: O que é a função RTRIM em SQL? Resposta: A função RTRIM em SQL é usada para remover espaços em branco do final de uma string de caracteres."},
    {"id": 453, "text": "Pergunta: O que é a função LTRIM em SQL? Resposta: A função LTRIM em SQL é usada para remover espaços em branco do início de uma string de caracteres."},
    {"id": 454, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema."},
    {"id": 455, "text": "Pergunta: O que é a função DATEADD em SQL? Resposta: A função DATEADD em SQL é usada para adicionar um intervalo de tempo especificado a uma data e hora específicas."},
    {"id": 456, "text": "Pergunta: O que é a função DATEDIFF em SQL? Resposta: A função DATEDIFF em SQL é usada para calcular a diferença entre duas datas e retornar um valor de intervalo com base em uma unidade de tempo especificada."},
    {"id": 457, "text": "Pergunta: O que é a função DAY em SQL? Resposta: A função DAY em SQL é usada para extrair o dia de uma data especificada como um valor de intervalo."},
    {"id": 458, "text": "Pergunta: O que é a função MONTH em SQL? Resposta: A função MONTH em SQL é usada para extrair o mês de uma data especificada como um valor de intervalo."},
    {"id": 459, "text": "Pergunta: O que é a função YEAR em SQL? Resposta: A função YEAR em SQL é usada para extrair o ano de uma data especificada como um valor de intervalo."},
    {"id": 460, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 461, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 462, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 463, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 464, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 465, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 466, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 467, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 468, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 469, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 470, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 471, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 472, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 473, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 474, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 475, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 476, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 477, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 478, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 479, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 480, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 481, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 482, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 483, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 484, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 485, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 486, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 487, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 488, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 489, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 490, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 491, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 492, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 493, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 494, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 495, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 496, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 497, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 498, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."},
    {"id": 499, "text": "Pergunta: O que é a função GETDATE em SQL? Resposta: A função GETDATE em SQL é usada para retornar a data e a hora atuais do sistema, mas não em UTC."},
    {"id": 500, "text": "Pergunta: O que é a função GETUTCDATE em SQL? Resposta: A função GETUTCDATE em SQL é usada para retornar a data e a hora atuais do sistema em UTC (Tempo Universal Coordenado)."}
]